Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/dbisam3.po
Languages: da

source: Browse for Database
da: Udvælg database

source: Select the database
da: Vælg database

source: &Cancel
da: &Annuller

source: Enter password
da: Indtast adgangskode

source: Cancel
da: Annuller

source: Password
da: Adgangskode

source: &Add
da: &Tilføj

source: &Remove
da: &Fjern

source: Re&move all
da: Fj&ern alle

source: Database name %s already exists.
da: Databasenavnet %s findes allerede.

source: Session name %s already exists.
da: Sessionsnavnet %s findes allerede.

source: Session name %s is not valid.
da: Sessionsnavnet %s er ikke tilladt.

source: Database name is missing.
da: Databasenavnet mangler.

source: Database name %s is not valid.
da: Databasenavnet %s er ikke tilladt.

source: Session name is missing.
da: Sessionsnavnet mangler.

source: Cannot perform this operation on an open database.
da: Kan ikke udføre denne handling på en åben database.

source: Cannot perform this operation on a closed database.
da: Kan ikke udføre denne handling på en lukket database.

source: Database handle owned by a different session
da: Database er ejet af en anden session.

source: Cannot perform this operation on an active session.
da: Kan ikke udføre denne handling på en aktiv session.

source: Cannot perform this operation on the active auto-session.
da: Kan ikke udføre denne handling på den aktive auto-session.

source: The active auto-session can be the only active session.
da: Den aktive auto-session kan være den eneste aktive session.

source: This auto-session already exists.
da: Denne auto-session findes allerede.

source: Error creating table handle.
da: Fejl ved oprettelse af tabel håndtag.

source: Field '%s' is of unknown type
da: Felt '%s' er af ukendt type

source: Field '%s' is of an unsupported type
da: Felt '%s' er af en type, der ikke understøttes

source: No SQL statement available
da: Ingen SQL kommando tilgængelig

source: No value for parameter '%s'
da: Ingen værdi for parameter '%s'

source: No parameter type for parameter '%s'
da: Ingen parameter type for parameter '%s'

source: Parameter '%s' not found
da: Parameter '%s' blev ikke fundet

source: Parameter '%s', cannot save data larger than %d bytes
da: Parameter '%s', kan ikke gemme data på mere end %d byte

source: Table is not in edit or insert mode.
da: Tabel er ikke i redigerings- eller indsætningstilstand

source: Source and destination tables are incompatible.
da: Kilde- og destinationstabeller er inkompatible

source: Field %s cannot be modified.
da: Felt %s kan ikke modificeres.

source: Field %s is not in the current index.
da: Felt %s er ikke i det nuværende indeks.

source: Circular data links are not allowed.
da: Cirkulære datareferencer er ikke tilladt.

source: Field index out of range.
da: Feltindeks er ugyldig.

source: No fields defined for the current index.
da: Der er ikke defineret felter for det nuværende indeks.

source: Cannot access index field %s.
da: Kan ikke tilgå indeksfeltet %s.

source: Database %s already has an active transaction.
da: Databasen %s har allerede en aktiv transaktion.

source: Database %s has no active transaction.
da: Databasen %s har ingen aktiv transaktion.

source: Missing table name.
da: Mangler tabelnavn.

source: Cannot access field %s.
da: Kan ikke tilgå feltet %s.

source: Unable to load bind parameters
da: Ude af stand til at indlæse bind parametre.

source: The database engine is not initialized
da: Databasemaskinen er ikke startet op

source: An unknown operating system error occurred with the table '%s'
da: En ukendt operativsystemsfejl skete med tabellen '%s'

source: There is insufficient operating system memory available for the current operation
da: Der er ikke nok hukommelse i operativsystemet til rådighed for handlingen

source: Table '%s' does not exist
da: Tabellen '%s' findes ikke

source: Access denied to table '%s'
da: Adgang til tabellen '%s' nægtet

source: Access denied to logical operating system device for the table '%s'
da: Adgang til en logisk operativsystemsenhed for tabellen '%s' blev nægtet

source: Cannot delete the table '%s'
da: Kan ikke slette tabellen '%s'

source: Error accessing header information for the table '%s'
da: Fejl ved adgang til hovedsektionsinformation i tabellen '%s'

source: The table '%s' is already locked by another user
da: En anden bruger har låst tabellen '%s'

source: General lock failure with the table '%s'
da: Generel låsningsfejl for tabellen '%s'

source: Cannot unlock table or record in the table '%s'
da: Kan ikke låse tabellen eller en post i tabel '%s'

source: The table '%s' is already in use
da: Tabellen '%s' er allerede i brug

source: Error reading from the table '%s'
da: Fejl ved læsning fra tabellen '%s'

source: Error writing to the table '%s'
da: Fejl ved skrivning til tabellen '%s'

source: Record in the table '%s' is in use by another user
da: En post i tabellen '%s' bruges af en anden bruger

source: Too many operating system files open while attempting to open the table '%s'
da: For mange operativsystemsfiler åben under forsøget på at slette tabellen '%s'

source: Invalid operating system file handle for the table '%s'
da: Operativsystemsfilhåndtaget for tabellen '%s' er ugyldigt

source: The table '%s' has been moved
da: Tabellen '%s' er flyttet

source: The table '%s' is not the correct version
da: Tabelversionen for tabel '%s' er ikke korrekt

source: Duplicate key found in the index '%s' of the table '%s'
da: Fundet en dubleret nøgle i indeks '%s' i tabellen '%s'

source: Record has been changed or deleted by another user, session, or table cursor in the table '%s'
da: Posten er ændret eller slettet af en anden bruger, session eller tabelcursor i tabellen '%s'

source: Maximum record size exceeded in the table '%s'
da: Maksimum poststørrelse er overskredet i tabellen '%s'

source: Maximum or minimum limits on number of fields, auto-increment field value, or field size exceeded in the table '%s'
da: Maksimum eller minimum begrænsninger på antal felter, autoinkrement feltværdi, eller feltstørrelse, blev overskredet i tabellen '%s'

source: Maximum or minimum limits on number of indexes or fields in an index exceeded in the table '%s'
da: Maksimum eller minimum for antal indekser eller antal felter i et indeks blev overskredet i tabellen '%s'

source: Record not found in the table '%s'
da: Post blev ikke fundet i tabellen '%s'

source: The table '%s' must be opened exclusively
da: Tabellen '%s' skal åbnes eksklusivt

source: Header information corrupt in the table '%s'
da: Hovedsektionsinformationen er korrupt i tabellen '%s'

source: Data record buffers corrupt in the table '%s'
da: Data record buffers er korrupte i tabellen '%s'

source: Index page buffers corrupt in the table '%s'
da: Indeks page buffers er korrupte i tabellen '%s'

source: BLOB block buffers corrupt in the table '%s'
da: BLOB blok bufferne er korrupte i tabellen '%s'

source: Invalid field number or name '%s' specified for the table '%s'
da: Ugyldigt feltnummer eller navn '%s' angivet for tabellen '%s'

source: Invalid key size specified in the index '%s' for the table '%s'
da: Ugyldig nøglestørrelse angivet for indeks '%s' i tabellen '%s'

source: A value must be provided for the field '%s' in the table '%s'
da: En værdi skal angives for feltet '%s' i tabellen '%s'

source: The value for the field '%s' in the table '%s' is below the minimum allowable value
da: Værdien for feltet '%s' i tabellen '%s' er under minimum

source: The value for the field '%s' in the table '%s' is above the maximum allowable value
da: Værdien for feltet '%s' i tabellen '%s' er over maksimum

source: Invalid field definition specified for the field '%s' in the table '%s'
da: Ugyldig feltdefinition angivet for felt '%s' i tabellen '%s'

source: Invalid field '%s' specified for the index '%s' in the table '%s'
da: Ugyldigt felt '%s' angivet for indeks '%s' i tabellen '%s'

source: Invalid blob length in the table '%s'
da: Ugyldig bloblængde i tabellen '%s'

source: Invalid blob field '%s' specified for the table '%s'
da: Ugyldigt blobfelt '%s' angivet for tabellen '%s'

source: End of blob data in the table '%s' reached prematurely
da: Blobdata i tabellen '%s' afsluttede for tidligt

source: Invalid blob offset into the table '%s' specified
da: Ugyldig blob position angivet for tabel '%s'

source: Invalid blob handle for the table '%s' specified
da: Ugyldigt blobhåndtag angivet for tabellen '%s'

source: Too many blobs opened in the table '%s'
da: Der er åbnet for mange blobs i tabellen '%s'

source: Too many blob fields or invalid blob block size specified for the table '%s'
da: For mange blob felter eller ugyldig blob blokstørrelse angivet for tabellen '%s'

source: Beginning of table '%s' unexpectedly encountered
da: Starten på tabel '%s' kom uventet

source: End of table '%s' unexpectedly encountered
da: Afslutningen på tabel '%s' kom uventet

source: A primary index is already defined for the table '%s' and cannot be added again
da: Et primært indeks er allerede defineret for tabel '%s' og kan ikke tilføjes igen

source: The primary index cannot be removed from the table '%s'
da: Det primære indeks kan ikke fjernes fra tabel '%s'

source: The secondary index name is missing or not specified for the table '%s'
da: Navnet for det sekundære indeks mangler eller er ikke angivet for tabel '%s'

source: The secondary index '%s' already exists for the table '%s'
da: Det sekundære indeks '%s' findes allerede i tabellen '%s'

source: Invalid secondary index name '%s' specified for the table '%s'
da: Ugyldigt navn for sekundært indeks '%s' angivet for tabellen '%s'

source: Invalid field number '%s' specified in the index '%s' for the table '%s'
da: Ugyldigt feltnummer '%s' angivet i indeks '%s' for tabellen '%s'

source: Filter error for the table '%s' - %s
da: Filterfejl for tabellen '%s' - %s

source: Invalid filter handle specified for the table '%s'
da: Ugyldigt filhåndtag angivet for tabellen '%s'

source: Too many filters defined for the table '%s'
da: Der er defineret for mange filtre for tabellen '%s'

source: Invalid or duplicate field name '%s' specified for the table '%s'
da: Ugyldigt eller dubleret feltnavn '%s' angivet for tabellen '%s'

source: Invalid default, min or max validity check, or expression specified for the field '%s' in the table '%s'
da: Ugyldig standard, min eller maks gyldighedstjek, eller udtryk specificeret for felt '%s' i tabellen '%s'

source: Insufficient rights to the table '%s', a password is required
da: Rettighederne til tabellen '%s' er ikke tilstrækkelige - en adgangskode er påkrævet

source: Password provided for the table '%s' is invalid
da: Den angivne adgangskode er ikke gyldig for tabellen '%s'

source: Invalid length for the in-memory table '%s'
da: Ugyldig længde for hukommelsestabellen '%s'

source: The language driver for the table '%s' is not available or installed
da: Sprogstyringen for tabel '%s' er ikke til rådighed eller ikke installeret

source: SQL error - %s
da: SQL fejl - %s

source: The table '%s' is full and cannot contain any more data
da: Tabellen '%s' er fuld og kan ikke indeholde flere data

source: No current record in the table '%s'
da: Der er ingen "current record" i tabellen '%s'

source: The table '%s' already exists
da: Tabellen '%s' findes allerede

source: Error compressing data
da: Fejl ved komprimering af data

source: Error uncompressing data
da: Fejl ved dekomprimering af data

source: The connection to the database server at '%s' has been lost
da: Forbindelsen til databaseværten '%s' blev tabt

source: An unknown error ('%s') occurred with the connection to the database server at '%s', please check the server log
da: En ukendt fejl ('%s') hændte med forbindelsen til databaseværten '%s', kontroller venligst værtens log

source: A connection to the database server at '%s' cannot be established
da: Der kan ikke etableres forbindelse til til databaseværten på '%s'

source: A connection to the database server at '%s' cannot be established, the server is not accepting new logins
da: Der kan ikke etableres forbindelse til til databaseværten på '%s', værten tillader ikke nye login

source: A connection to the database server at '%s' cannot be established, the maximum number of connections has been reached
da: Der kan ikke etableres forbindelse til til databaseværten på '%s', maksimum antal forbindelser er blevet nået

source: A connection to the database server at '%s' cannot be established, the client address is blocked
da: Der kan ikke etableres forbindelse til til databaseværten på '%s', der er blokeret for klientadressen

source: A server callback error occurred for the database server at '%s'
da: En værtstilbagekaldsfejl hændte for databaseværten '%s'

source: A call to the database server at '%s' failed, the client engine version does not match the server
da: Et kald til databaseværten '%s' fejlede, klientens maskineversion passer ikke med værtens

source: A connection to the database server at '%s' cannot be established, the login information provided is invalid
da: Der kan ikke etableres forbindelse til til databaseværten på '%s', brugernavn og adgangskode passer ikke

source: The user '%s' is not authorized to perform this operation with the database '%s' on the database server at '%s'
da: Brugeren '%s' er ikke autoriseret til at udføre denne handling med databasen '%s' på databaseværten '%s'

source: The user '%s' is not authorized to perform administration functions on the database server at '%s'
da: Brugeren '%s' er ikke autoriseret til at udføre adminstrative opgaver på databaseværten '%s'

source: The user name is either invalid or blank
da: Brugernavnet er enten ugyldigt eller tomt

source: The user '%s' does not exist on the database server at '%s'
da: Brugeren '%s' findes ikke på databaseværten '%s'

source: The user '%s' already exists on the database server at '%s'
da: Brugeren '%s' findes ellerede på databaseværten '%s'

source: The database name or directory is either invalid or blank
da: Databasenavnet eller directory er enten ugyldig eller ikke udfyldt

source: The database '%s' does not exist on the database server at '%s'
da: Databasen '%s' findes ikke på databaseværten '%s'

source: The database '%s' already exists on the database server at '%s'
da: Databasen '%s' findes allerede på databaseværten '%s'

source: The database user name is either invalid or blank
da: Database brugernavn er enten ugyldigt eller ikke udfyldt

source: The database user '%s' does not exist for the database '%s' on the database server at '%s'
da: Databasebrugeren '%s' findes ikke for databasen '%s' på databaseværten '%s'

source: The database user '%s' already exists for the database '%s' on the database server at '%s'
da: Databasebrugeren '%s' findes allerede for databasen '%s' på databaseværten '%s'

source: An invalid or unknown request was made to the database server at '%s'
da: En ugyldig eller ukendt forespørgsel blev foretaget for databaseværten '%s'

source: An error occurred during the import into the table '%s' - %s
da: Det skete en fejl under import til tabellen '%s' - %s

source: An error occurred during the export from the table '%s' - %s
da: Der skete en fejl under eksport fra tabellen '%s' - %s
