Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/delphi7.po
Languages: da, ru

source: Save %s attributes as
da: Gem %s attributter som

source: &Attribute set name:
da: &Attribut set navn

source: &Based on:
da: &Baseret på:

source: New Field
da: Nyt felt

source: Lookup definition
da: Opslagsdefinition

source: D&ataset:
da: D&atasæt:

source: &Key Fields:
da: &Nøglefelter:

source: Look&up Keys:
da: &Opslagsnøgler:

source: &Result Field:
da: &Resultatfelt:

source: Field properties
da: Feltegenskaber

source: C&omponent:
da: K&omponent

source: &Size:
da: &Størrelse:

source: Field type
da: Felttype

source: Fields
da: Felter

source: Aggregates
da: Aggregater

source: &Add fields...
da: &Tilføj felter...

source: &New field...
da: &Nyt felt...

source: Add all &fields
da: Tilføj alle &felter

source: Se&lect all
da: &Vælg alle

source: Field Link Designer
da: Feltlink designer

source: D&etail Fields
da: D&etaljefelter

source: &Master Fields
da: &Mesterfelter

source: A&vailable Indexes
da: Inde&kser til rådighed

source: &Joined Fields
da: &Forbundne felter

source: Index Files
da: Indeksfiler

source: dBASE Multiple Index (*.MDX)|*.mdx|dBase Index (*.NDX)|*.ndx|FoxPro Index (*.CDX)|*.cdx
da: dBASE flere indeks (*.MDX)|*.mdx|dBase indeks (*.NDX)|*.ndx|FoxPro indeks (*.CDX)|*.cdx

source: All (*.bmp;*.ico;*.emf;*.wmf)|*.bmp;*.ico;*.emf;*.wmf|Bitmaps (*.bmp)|*.bmp|Icons (*.ico)|*.ico|Enhanced Metafiles (*.emf)|*.emf|Metafiles (*.wmf)|*.wmf
da: Alle (*.bmp;*.ico;*.emf;*.wmf)|*.bmp;*.ico;*.emf;*.wmf|Billeder (*.bmp)|*.bmp|Ikoner (*.ico)|*.ico|Udvidede metafiler (*.emf)|*.emf|Metafiler (*.wmf)|*.wmf

source: &Tables:
da: &Tabeller:

source: Add T&able to SQL
da: Tilføj t&abel til SQL

source: &Fields:
da: &Felter:

source: Add F&ield to SQL
da: Tilføj f&elt til SQL

source: String List Editor
da: Tekstliste editor

source: &Code Editor...
da: &Kodeeditor...

source: Text files (*.TXT)|*.TXT|Config files (*.SYS;*.INI)|*.SYS;*.INI|Batch files (*.BAT)|*.BAT|All files (*.*)|*.*
da: Tekstfiler (*.TXT)|*.TXT|Konfigurationsfiler (*.SYS;*.INI)|*.SYS;*.INI|Batchfiler (*.BAT)|*.BAT|Alle filer (*.*)|*.*

source: Value List editor
da: Værdiliste editor

source: Window
da: Vindue

source: &Arrange
da: &Arranger

source: &Cascade
da: &Kaskade

source: Cascade
da: Kaskade

source: C&lose
da: &Luk

source: Close
da: Luk

source: &Minimize All
da: &Minimer alle

source: Minimize All
da: Minimer alt

source: Tile &Horizontally
da: Arranger &horisontalt

source: Tile Horizontal
da: Arranger horisontalt

source: &Tile Vertically
da: &Arranger vertikalt

source: Tile Vertical
da: Arranger vertikalt

source: Delete|Erases the selection
da: Slet|Sletter det valgte

source: &Undo
da: &Fortryd

source: Undo|Reverts the last action
da: Fortryd|Omgør den sidste handling

source: &Contents
da: &Indhold

source: Help Contents
da: Hjælp indholdsfortegnelse

source: &Help on Help
da: &Hjælp om hjælp

source: Help on help
da: Hjælp om hjælp

source: &Topic Search
da: &Emnesøgning

source: Topic Search
da: Emnesøgning

source: Exit|Quits the application
da: Afslut|Afslutter programmet

source: &Open...
da: &Åbn...

source: Open|Opens an existing file
da: Åbn|Åbner eksisterende fil

source: Print Set&up...
da: Indstil &udskrivning...

source: Print Setup
da: Indstil udskrivning

source: Save &As...
da: Gem &som...

source: Save As|Saves the active file with a new name
da: Gem som|Gemmer den aktive fil med et nyt navn

source: &Bold
da: &Fed

source: &Italic
da: &Kursiv

source: &Underline
da: &Understreg

source: Underline
da: Understreg

source: Search
da: Søg

source: Find|Finds the specified text
da: Find|Finder den specificerede tekst

source: Find &Next
da: Find &Næste

source: Find Next|Repeats the last find
da: Find næste|Gentager den sidste søgning

source: Replace|Replaces specific text with different text
da: Erstat|Erstatter specifik tekst med anden tekst

source: &Center
da: &Centrer

source: Center|Centers text between margins
da: Centrer|Centrerer tekst mellem marginer

source: Align &Left
da: Lige &venstre

source: Align Left|Aligns text at the left indent
da: Lige venstre|Justerer tekst med lige venstre kant

source: Align &Right
da: Lige &højre

source: Align Right|Aligns text at the right indent
da: Lige højre|Justerer tekst med lige højre kant

source: &Bullets
da: &Punkter

source: Bullets|Inserts a bullet on the current line
da: Punkter|Indsæt et punkt på linien

source: &Strikeout
da: &Streg ud

source: Strikeout
da: Udstregning

source: Select &Color...
da: Vælg f&arve:

source: Color Select
da: Farvevalg

source: Font Select
da: Vælg skrifttype

source: &Open Picture...
da: &Åbn billede...

source: Open Picture
da: Åbn billede

source: &Save Picture...
da: &Gem billede...

source: Save Picture
da: Gem billede

source: &Run...
da: &Kør...

source: Run|Runs an application
da: Kør|Kører et program

source: open
da: åbn

source: Previous|Go back to the previous tab
da: Forrige|Gå tilbage til det forrige faneblad

source: &Finish
da: &Færdig

source: Next|Go to the next tab
da: Næste|Gå til næste faneblad

source: F&ind First
da: F&ind første

source: Find First|Finds the first occurance of specified text
da: Find første|Finder den første optræden af en specificeret tekst

source: List
da: Liste

source: &Copy Selection
da: &Kopier udvalg

source: Copy Selection
da: Kopier det valgte

source: &Delete Selection
da: &Slet udvalg

source: Delete Selection
da: Slet det valgte

source: Clear Selection
da: Slet det valgte

source: &Move Selection
da: &Flyt det valgte

source: Move Selection
da: Flyt det valgte

source: &Browse URL
da: &Gennemse URL

source: Browse URL
da: Vis URL

source: &Download URL
da: &Hent URL

source: Download from URL
da: Hent fra URL

source: &Send Mail...
da: &Send post...

source: Send email
da: Send e-post

source: &Print...
da: &Udskriv...

source: Open with...
da: Åbn med...

source: Page Set&up...
da: &Sideopsætning

source: Customize
da: Juster

source: Toolbars
da: Værktøjsbjælker

source: Toolb&ars:
da: &Værktøjsbjælker:

source: (Checkmark toggles visibility)
da: (Afkrydsning skifter synlighed)

source: &Toolbar Options
da: &Værktøjsbjælke indstillinger

source: &Caption Options
da: &Overskriftsindstillinger

source: Apply caption options &to all toolbars
da: Anvend overskriftsindtillinger &på alle værktøjsbjælker

source: Actions
da: Handlinger

source: To add actions to your application simply drag and drop from either Categories or Actions onto an existing ActionBar.
da: Træk fra kategorierne eller handlinger til en eksisterende ActionBar for at tilføje handlinger til dit program.

source: Cate&gories:
da: Kate&gorier:

source: A&ctions:
da: &Handlinger:

source: Description
da: Beskrivelse

source: Personalized Menus and Toolbars
da: Personlige menuer og værktøjsbjælker

source: &Menu animations:
da: &Menuanimationer:

source: Drag to create Separators
da: Træk for at lave separatorer

source: &Reset...
da: &Nulstil...

source: Reset Usage Data
da: Nulstil brugsstatistik

source: Me&nu show recently used items first
da: Me&nu vis de sidste brugte filnavne først

source: Show f&ull menus after a short delay
da: Vis &fulde menuer efter et øjeblik

source: Show &tips on toolbars
da: Vis &tips på værktøjsbjælken

source: Show shortcut keys in tips
da: Vis genvejstaster i tips

source: Apply &to all toolbars
da: Anvend &med alle værktøjsbjælker

source: &Large icons
da: &Store ikoner

source: Interpreter
da: Fortolker

source: &Field
da: &Felt

source: Increment By
da: Tæl op med

source: &Apply Event
da: &Anvend hændelse

source: Restore Database Files
da: Genskab databasefiler

source: Connection
da: Forbindelse

source: &Protocol:
da: &Protokol:

source: &Local
da: &Lokalt

source: &Remote
da: &Fjern

source: Database Parameters
da: Databaseparametre

source: Pass&word:
da: &Adgangskode:

source: Se&ttings:
da: I&ndstillinger:

source: Lo&gin Prompt
da: Lo&gin vindue

source: &Active
da: &Aktiv

source: &Browse
da: &Gennemse

source: &Listen on Port:
da: &Lyt på port:

source: Many values of Port are associated by convention with a particular service such as ftp or http. Port is the ID of the connection on which the server listens for client requests.
da: Mange port-værdier er traditionelt forbundet med besteme tjenester som f.eks. ftp eller http. Portnummeret bruges til at angive, hvilken tjeneste, man vil have fat i.

source: Thread Caching
da: Trådcaching

source: &Thread Cache Size:
da: &Tråd cache størrelse:

source: Thread Cache Size is the maximum number of threads that can be reused for new client connections.
da: Thread cache størrelse er det højeste antal tråde, der kan genanvendes for nye klientforbindelser.

source: &Inactive Timeout:
da: &Inaktiv timeout:

source: Inactive Timeout specifes the number of minutes a client can be inactive before being disconnected. (0 indicates infinite)
da: Inaktiv Timeout specificerer, hvor mange minutter en klient kan være inaktiv før forbindelsen bliver afbrudt. (0 specificerer uendeligt)

source: Users
da: Brugere

source: IP Address
da: IP adresse

source: Last Activity
da: Sidste aktiviteter

source: &Properties
da: &Egenskaber

source: &Ports
da: &Porte

source: &Exit
da: &Afslut

source: &Connections
da: &Forbindelser

source: &Disconnect
da: &Afbryd forbindelsen

source: &Show Host Name
da: &Vis hostnavn

source: &Registered Objects Only
da: &Kun registrerede objekter

source: &Allow XML Packets
da: &Tillad XML pakker

source: Information
ru: Информация

source: Type
ru: Тип

source: %d MB
ru: %d МБ

source: Find
ru: Поиск

source: Sum
ru: Сумма

source: RCode NO Error
ru: RCode НЕТ ошибки

source: Timeout
ru: Таймаут

source: Version %s
ru: Версия %s

source: Copyright (c) 1993 - 2002 Kudzu (Chad Z. Hower) and the Indy Pit Crew
ru: Copyright (c) 1993 - 2002 Kudzu (Chad Z. Hower) и Indy Pit Crew

source: &Port
ru: &Порт

source: SSL status: "%s"
ru: Статус SSL: "%s"

source: "%s" is is working directory.
ru: "%s" - - рабочая папка.

source: Extensions supported: SIZE PASV REST End of extentions.
ru: Поддерживаются расширения: SIZE PASV REST Конец расширений.

source: Stop
ru: Стоп

source: Start
ru: Старт

source: Must enable multiref output for objects when serializing a graph of objects - (%s)
ru: Must allow multiref output for objects when serializing a graph of objects

source: <a href="%s">%s</a>&nbsp;&gt;&nbsp;<span class="Off">%s</span>
ru: <a class="NavBar" href="%s">%s</a>&nbsp;&gt;&nbsp;<span class="Off">%s</span>

source: Port Type
ru: Тип порта

source: S&QL Builder...
ru: Построитель &запросов...

source: %s%s%s Database
ru: %s%s%s База данных

source: Enhanced Metafiles
ru: Расширенные метафайлы

source: BkSp
ru: Backspace

source: Separator
ru: Разделитель

source: (Array)
ru: (Массив)

source: SQL Parse Error: %s
ru: Ошибка синтаксического разбора SQL: %s

source: Illegal type
ru: Недопустимый тип

source: Cubits
ru: Локти

source: Fathoms
ru: Морские сажени

source: Furlongs
ru: 1/8 мили

source: Paces
ru: Шаги

source: Rods
ru: Пруты (rods)

source: Chains
ru: Мерные цепи

source: Acres
ru: Акры

source: Centares
ru: Сантиары

source: Ares
ru: Ары

source: SquareRods
ru: Кв. пруты (rods)

source: AcreFeet
ru: Акрофуты

source: AcreInches
ru: Акродюймы

source: Cords
ru: Корды

source: CordFeet
ru: Кордфуты

source: FluidGallons
ru: Галлоны жидкие

source: FluidQuarts
ru: Кварты жидкие

source: FluidPints
ru: Пинты жидкие

source: FluidCups
ru: Кубки жидкие

source: FluidGills
ru: 1/4 пинты жидкие

source: DryGallons
ru: Галлоны сыпучие

source: DryQuarts
ru: Кварты сыпучие

source: DryPints
ru: Пинты сыпучие

source: DryBuckets
ru: Ведра

source: DryBushels
ru: Бушели

source: UKGallons
ru: Англ. галлоны

source: UKQuarts
ru: Англ. кварты

source: UKPints
ru: Англ. пинты

source: UKGill
ru: Англ. 1/4 пинты

source: UKOunces
ru: Англ. унции

source: UKBuckets
ru: Англ. ведра

source: UKBushels
ru: Англ. бушели

source: Drams
ru: Драхмы

source: Grains
ru: Граны

source: Tons
ru: Тонны

source: LongTons
ru: Длинные тонны

source: Ounces
ru: Унции

source: Celsius
ru: Цельсий

source: Kelvin
ru: Кельвин

source: Fahrenheit
ru: Фаренгейт

source: Reaumur
ru: Реомюр

source: Fortnights
ru: Две недели

source: Jan
ru: Янв

source: Feb
ru: Фев

source: Mar
ru: Мар

source: Apr
ru: Апр

source: Jun
ru: Июн

source: Jul
ru: Июл

source: Aug
ru: Авг

source: Sep
ru: Сен

source: Nov
ru: Ноя

source: Dec
ru: Дек

source: April
ru: Апрель

source: August
ru: Август

source: September
ru: Сентябрь

source: November
ru: Ноябрь

source: December
ru: Декабрь
