Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/delphi5.po
Languages: pt_br

source: row error
pt_br: Erro na linha

source: All Values
pt_br: Todos valores

source: Move to Row Area
pt_br: Vai para a área da linha

source: Move to Column Area
pt_br: Vai para a área da coluna

source: Open Dimension
pt_br: Abrir dimensão

source: Drilled In
pt_br: Perfurado dentro

source: The information requested could not be loaded.
pt_br: A informação solicitada não pode ser carregada.

source: No active summaries have been defined.
pt_br: Nenhum sumário ativo foi definido

source: Not enough room available to load a summary.
pt_br: Não há endereços disponíveis para carregar um sumário .

source: No available dimensions have been defined.
pt_br: Nenhuma dimensão disponível foi definida

source: Not enough space available to load a dimension.
pt_br: Não há espaço disponível para carregar a dimensão

source: [Error]
pt_br: [Erro]

source: Sum
pt_br: Soma

source: Inactive Dimensions
pt_br: Dimensões inativas

source: Display Data and Subtotals
pt_br: Exibindo os dados e os subtotais

source: Display Data Only
pt_br: Exibindo somente os dados

source: Display Subtotals Only
pt_br: Exibindo somente os subtotais

source: Drill in to this value
pt_br: Perfure dentro deste valor

source: Subtotals on/off
pt_br: Subtotais Lig/Desl

source: Show Detail Records..
pt_br: Exibir detalhes dos registros..

source: Unsupported data type : %s
pt_br: Tipo do dado %s não suportado

source: Row index out of range : %d
pt_br: Índice da linha fora do intervalo: %d

source: Column index out of range : %d
pt_br: Índice da coluna fora do intervalo: %d

source: Duplicate item in array
pt_br: Ítem no array duplicado

source: Array index out of range : %d
pt_br: Índice do array fora do intervalo: %d

source: The DecisionCube Capacity is low. Please deactivate dimensions or change the data set.
pt_br: A capacidade do DecisionCube está baixa. Por favor, desative as dimensões ou mude a série de dados

source: Query could not be run. Check that the query, SQL text, and Database are correct.
pt_br: Não é possível executar a Query. Verifique se a Query, SQL text, e o Database estão corretos.

source: Operation not allowed on sorted string list.
pt_br: Operação não suportada ao filtrar lista de strings.

source: String list does not allow duplicates.
pt_br: Não é permitida lista de Strings duplicadas

source: The maximum allowed summaries of %d has been exceeded.
pt_br: Foi excedido o maxímo de sumarios %d permitidos

source: General array error.
pt_br: Erro geral no array

source: Illegal Dimension Index
pt_br: Índice de dimensão ilegal

source: Initial Value is not legal for this type of Grouping
pt_br: Valor inicial não é legal para este tipo de agrupamento

source: Dimension Map is not the correct size
pt_br: Mapa da dimensão não está com a dimensão correta

source: Cannot perform this action on an active Dimension Map
pt_br: Não é possível prosseguir com esta ação em um mapa ativo da dimensão

source: Not Available
pt_br: Não disponível

source: Information required to do Maximum Cell limit is not current. Do you want to fetch it now?
pt_br: A informação necessária para fazer o limite máximo da pilha não é atual. Você quer atualizá-la agora?

source: Date grouping is not allowed for fields of this type
pt_br: Dados agrupados não são permitidos para campos deste tipo

source: Cannot build the Decision Cube with an empty data set
pt_br: Não é possível gerar o Decision Cube com a base de dados vazia

source: Data set property is not assigned
pt_br: Nenhum arquivo associado

source: No summaries are defined.
pt_br: Nenhum sumário foi definido

source: No dimension fields are defined.
pt_br: Campos de dimensões não foram definidos

source: The dimension types for this dataset cannot be determined automatically. You must map the fields to dimensions or summaries with the Decision Cube Editor
pt_br: Os tipos da dimensão para esta série de dados não podem ser determinados automaticamente. Você deve traçar os campos às dimensões ou os sumários com o editor do decision cube

source: All dimension fields must be grouped.
pt_br: Todos os campos da dimensão devem ser agrupados

source: The query may be incorrectly defined, or you may need to map its fields to active dimensions or summaries with the Decision Cube Editor
pt_br: A Query pode ser definida incorretamente, ou você pode precisar traçar seus campos para dimensões ativas ou resumos com o Editor do Decision Cube

source: The dataset may be incorrectly defined, or you may need to map its fields to active dimensions or summaries with the Decision Cube Editor
pt_br: Os arquivos podem ser definidos incorretamente, ou você pode precisar traçar seus campos para dimensões ativas ou resumos com o Editor do Decision Cube

source: Average is calculated using sum and count summaries for each field. The necessary summaries have been added.
pt_br: A média que usa soma e resumos de conta para cada campo é calculada. Os resumos necessários foram somados.

source: Average is calculated using a field sum and count(*). The necessary summaries have been added.
pt_br: Média que usa uma soma de campo e conta é calculada (*). Os resumos necessários foram somados.

source: Query is legal.
pt_br: A Query é legal.

source: is already in the query
pt_br: Já existe em uma query

source: is not an allowed summary type
pt_br: Não é um tipo de sumário permitido

source: is not an allowed dimension type
pt_br: Não é um tipo de dimensão permitida

source: Average summaries use Sum and Count
pt_br: Resumos comuns usam Soma e Conta

source: Do you still want to Exit?
pt_br: Você ainda quer Sair?

source: The query you have created is not legal.
pt_br: A query que você criou não é legal. Por favor corrija antes de continuar.

source: The query you have entered is not legal. Please correct it before continuing.
pt_br: A Query na qual você entrou não é legal. Por favor corrija antes de continuar

source: Could not remove the field
pt_br: Não é possível remover este campo

source: All Fields
pt_br: Todos Campos

source: Query Fields
pt_br: Campos da Query

source: &Edit Done
pt_br: &Edição final

source: &Edit Query
pt_br: &Editar Query

source: One or more fields of a type which cannot be tabulated were removed from the query.
pt_br: Foram removidos um ou mais campos de um tipo que não pode ser tabulado da Query

source: Decision Cube size excedes limits
pt_br: Tamanho do Decision Cube excedeu os limites

source: The maximum allowed dimensions of %d has been exceeded.
pt_br: Foi excedito o tamanho máximo das dimensões do %d permitidas.

source: Total cell count of %d exceeds the maximum of %d.
pt_br: Contagem total de células do %d excedeu o máximo do %d.

source: Field %s has an unsupported data type: %s
pt_br: Campo %s tem um tipo de dados não suportado: %s

source: Scanning data set values...
pt_br: Scaneando valores de dados indicados...

source: User canceled DecisionCube population.
pt_br: Usuário cancelou a população do DecisionCube

source: Grouping values ...
pt_br: Agrupando valores...

source: Creating Cube index for %s ...
pt_br: Criando índice de cubo para %s ...

source: Unable to create derived summary.
pt_br: Não é possível criar sumário derivado

source: True
pt_br: Verdadeiro

source: False
pt_br: Falso

source: The bin type does not match the fieldtype.
pt_br: Tipo de campo não confere com o tipo de caixa

source: Fatal error in cache: code: %d
pt_br: Ocorreu um erro fatal no cache: código: %d

source: String Data type not supported for summaries
pt_br: Tipo de dados não suportados no sumário

source: Dataset is too large
pt_br: Arquivo muito grande

source: Building data store...
pt_br: Gerando histórico de dados...

source: Sum of %s
pt_br: Soma de %s

source: Count of %s
pt_br: Contagem de %s

source: Maximum of %s
pt_br: Máximo de %s

source: Minimum of %s
pt_br: Mínimo de %s

source: Average of %s
pt_br: Média of %s

source: Variance of %s
pt_br: Variando de %s

source: Standard Deviation of %s
pt_br: Divergência de %s

source: Summary of %s
pt_br: Sumário de %s

source: Unsupported Data Type %d
pt_br: Tipo de dado %d não suportado

source: Other Values
pt_br: Outros valores

source: Query lacks a Select/From clause.
pt_br: Query falhando na clausula Select/From

source: No argument provided for an operator or summary
pt_br: Nenhum argumento providenciado para o operador ou resumo

source: An expression cannot be used for a grouping field
pt_br: Uma expressão não pode ser usada para um campo de agrupamento

source: Out of Bounds
pt_br: Fora dos limites

source: Only one data module per application
pt_br: Somente um Data Module por aplicação

source: No data modules registered
pt_br: Não há Data modules registrados

source: No dispatcher component found on data module
pt_br: Não há nenhum componente de "dispath" no Data Module

source: Maximum number of concurrent connections exceeded. Please try again later
pt_br: O número Máximo de conexões simultâneas foi exedido. Por favor tente novamente mais tarde

source: <html><title>Internal Server Error 500</title> <h1>Internal Server Error 500</h1><hr> Exception: %s<br> Message: %s<br></html>
pt_br: <html><title>Erro Interno do Servidor Nº 500</title> <h1>Erro Interno do Servidor Nº 500</h1><hr> Exceção: %s<br> Mensagem: %s<br></html>

source: <html><title>Document Moved 302</title> <body><h1>Object Moved</h1><hr> This Object may be found <a HREF="%s">here.</a><br> <br></body></html>
pt_br: <html><title>Documento Movido 302</title> <body><h1>Objeto Movido</h1><hr> Este objeto pode ser encontrado <a HREF="%s">here.</a><br> <br></body></html>

source: Data set field is blank
pt_br: Campo Dataset está vazio

source: Data set field not found: %s
pt_br: Campo Dataset não encontrado: %s

source: Field is not a dataset field: %s
pt_br: Campo não é um campo Dataset: %s

source: %s: missing XMLBroker
pt_br: %s: faltando XMLBroker

source: %0:s: Field "%1:s" not found
pt_br: Campo '%s' não encontrado

source: Submit
pt_br: Submiter

source: Apply Updates
pt_br: Atualizar Alterações

source: Invalid parent
pt_br: Autor inválido

source: Field %s ignored, only one status field allowed
pt_br: Campo %s ignorado, somente um campo de status alocado

source: Undo
pt_br: Desfazer

source: Post
pt_br: Salvar

source: Invalid Web component registration
pt_br: Registro de component Web inválido

source: Invalid Web component enumeration
pt_br: Enumeração de component Web inválido

source: Invalid Web component creation
pt_br: Component Web de criação inválido

source: ApplyUpdates error. Error count: %d.
pt_br: Erro do ApplyUpdates. Contador de Erro: %d.

source: Missing Delta Packet
pt_br: Faltando pacote Delta

source: XMLBroker: %s is not connected
pt_br: XMLBroker: %s não está conectado

source: DataSet: %s is not active
pt_br: %0:s: Dataset %1:s não está ativa

source: New Lookup Field
pt_br: Novo campo Lookup

source: Samples
pt_br: Exemplos

source: You must register events before queueing them
pt_br: Você precisa registrar os eventos antes de enfileiralos

source: Component is not connected to an open Database
pt_br: Componente não está conectado a um Database aberto

source: ''%s'' is not connected to an InterBase database
pt_br: ''%s'' não está conectado a um Database do InterBase

source: You cannot call CancelEvents from within an OnEventAlert handler
pt_br: Você não pode chamar o CancelEvents de dentro de um handler do OnEventAlert

source: Invalid blank event added to EventAlerter events list
pt_br: O evento em branco adicionado lista de eventos EventAlerter é inválido

source: You cannot call QueueEvents from within an OnEventAlert handler
pt_br: Você não pode chamar o QueueEvents de dentro de um handler do OnEventAlert

source: You cannot Register or Unregister events from within an OnEventAlert handler
pt_br: Você não pode registrar/desregistrar eventos de dentro de um handler do OnEventAlert

source: You can only register 15 events per EventAlerter
pt_br: Você só pode registrar 15 eventos por EventAlerter

source: Invalid Enum Value
pt_br: Valor Enum inválido

source: Missing Connection or ConnectionString
pt_br: Conexão or "String de Conexão" não encontrada

source: Filter property cannot be used for detail tables
pt_br: Propriedade Filter não pode ser usada para detalhes das tabelas

source: Dataset does not support bookmarks, which are required for multi-record data controls
pt_br: Dataset não suporta bookmarks, o qual são requeridos para controles de dados de multi-gravação

source: Missing %s property
pt_br: Propriedade %s não encontrada

source: Error creating object. Please verify that the Microsoft Data Access Components 2.1 (or later) have been properly installed
pt_br: Erro criando objeto. Por favor verifique que o Microsoft Data Access Components 2.1 (or superior) estão instalados corretamente

source: Events are not supported with server side TableDirect cursors
pt_br: Eventos não são suportados com servidor secundário de cursors TableDirect

source: Unsupported field type (%s) in field %s
pt_br: O Tipo de campo (%s) não é suportado no campo %s

source: No matching ADO data type for %s
pt_br: Não foram encontrados tipos de dados ADO para %s

source: A connection component is required for async ExecuteOptions
pt_br: Um componente de conexão é necessário para async ExecuteOptions

source: Cannot perform a requery after connection has changed
pt_br: Não foi possivel cumprir o requerimento depois que a conexão foi mudada

source: FilterOptions are not supported
pt_br: FilterOptions não é suportada

source: Cannot enable AutoSessionName property with more than one session on a form or data-module
pt_br: Não foi possível permitir a propriedade de AutoSessionName com mais de uma sessão em um formulário ou em um dado-módulo

source: Cannot add a session to the form or data-module while session '%s' has AutoSessionName enabled
pt_br: Não foi possível adicionar uma sessão ao formulário ou ao dado-módulo quando a sessão ' %s' ainda tiver AutoSessionName permitido

source: Cannot modify SessionName while AutoSessionName is enabled
pt_br: Não foi possível modificar a SessionName quando o AutoSessionName for permitido

source: Duplicate database name '%s'
pt_br: Nome da tabela '%s' duplicado

source: Duplicate session name '%s'
pt_br: Nome da seção '%s' duplicado

source: Invalid session name %s
pt_br: Nome da seção '%s' inválido

source: Database name missing
pt_br: O nome do Database esta faltando

source: Session name missing
pt_br: Nome da seção ausente

source: Cannot perform this operation on an open database
pt_br: Não é possível executar esta operação em um banco de dados aberto

source: Cannot perform this operation on a closed database
pt_br: Não é possível executar esta operação em um banco de dados fechado

source: Database handle owned by a different session
pt_br: Handle de banco de dados pertence a uma sessão diferente

source: Cannot perform this operation on an active session
pt_br: Não é possível executar esta operação em uma sessão ativa

source: Error creating cursor handle
pt_br: Erro ao criar handle do cursor

source: Cannot convert field '%s' to a floating point value
pt_br: Não é possível converter o campo '%s' para um valor de ponto flutuante

source: Cannot convert field '%s' to an integer value
pt_br: Não é possível converter o campo '%s' para um valor inteiro

source: Source and destination tables are incompatible
pt_br: Tabelas fonte e destino são imcompatíveis

source: Fields '%s' and '%s' are not assignment compatible
pt_br: Campos '%s' e '%s' não são compatíveis para atribuição

source: ReferenceTableName not specified for field '%s'
pt_br: Referencia do nome da tabela não especificado para o campo '%s'

source: Cannot use array of Field values with Expression Indices
pt_br: Não é possível usar um array de valores de campos em Expressões de Índice

source: Invalid batch move parameters
pt_br: Parâmetros inválidos para batch move

source: No SQL statement available
pt_br: Nenhuma declaração SQL disponível

source: No value for parameter '%s'
pt_br: Nenhum valor para o parâmetro '%s'

source: No parameter type for parameter '%s'
pt_br: Parâmetro sem tipo: '%s'

source: Cannot connect to database '%s'
pt_br: Não é possível conectar com o banco de dados '%s'

source: An error occurred while attempting to initialize the Borland Database Engine (error $%.4x)
pt_br: Um erro ocorreu durante a inicialização do Borland Database Engine (erro $%.4x)

source: Da&tabase Editor...
pt_br: Editor de Da&tabase...

source: '%s' cannot be opened
pt_br: '%s' não pode ser aberto

source: The MasterSource property of '%s' must be linked to a DataSource
pt_br: A propriedade MasterSource do '%s' deve estar associado a um DataSource

source: Unable to open the MasterSource Table
pt_br: Incapaz de abrir a tabela MasterSource

source: S&QL Builder...
pt_br: &Query Builder...

source: Database is currently connected. Disconnect and continue?
pt_br: O banco de dados está atualmente conectado. Desconectar e continuar ?

source: BDE error $%.4x
pt_br: Erro do BDE $%.4x

source: Unable to use duplicate DataSource and LookupSource
pt_br: Incapaz de usar DataSource e LookupSource duplicados

source: LookupSource must be connected to TTable component
pt_br: LookupSource deve estar conectado a um componente TTable

source: %s must be the lookup table's active index
pt_br: %s deve ser um índice ativo da tabela lookup

source: Must have a valid field type selected
pt_br: Deve haver um tipo de campo válido selecionado

source: Parameter '%s' truncated on output
pt_br: Parâmetro '%s' truncado na saida

source: (None)
pt_br: (Nenhum)

source: Index does not exist. Index: %s
pt_br: Índice não existe. Índice: %s

source: Missing TableName property
pt_br: Propriedade TableName faltando

source: Missing DataSetField property
pt_br: Propriedades dos campos do arquivo ausentes

source: E&xecute
pt_br: E&xecutar

source: Not in cached update mode
pt_br: Não está no modo cached update

source: Invalid alias name %s
pt_br: Nome inválido do alias %s

source: Cannot access field '%s' in a filter
pt_br: Não é possível acessar o campo '%s' em um filtro

source: &UpdateSQL Editor...
pt_br: Editor de &UpdateSQL ...

source: No dataset association
pt_br: Nenhum arquivo associado

source: Untitled Application
pt_br: Aplicação sem título

source: Cannot update, %s is not owned by %s
pt_br: Não é possível atualizar, %s não pertence a %s

source: Update failed
pt_br: Atualização falhou

source: Must select at least one key field and one update field
pt_br: Deve selecionar no mínimo um campo chave e um campo update

source: Update SQL statements not generated, exit anyway?
pt_br: SQL de atualização não foi gerada, sair de qualquer forma?

source: Unable to determine field names for %s
pt_br: Incapaz de determinar os nomes dos campos para %s

source: The transaction isolation level must be dirty read for local databases
pt_br: O nível de isolamento da transação deve ser dirty read para os banco de dados locais

source: Missing DataSet property
pt_br: Faltando propriedade do DataSet

source: No provider available
pt_br: Não há Provider disponível

source: Dataset is not a query
pt_br: Este arquivo não é uma query

source: Failed to clear tab control
pt_br: Falha ao limpar controle de aba

source: Failed to delete tab at index %d
pt_br: Falha ao deletar índice %d da aba

source: Failed to retrieve tab at index %d
pt_br: Falha ao recuperar a aba no índice %d

source: Failed to get object at index %d
pt_br: Falha ao inicializar objeto no índice %d

source: Failed to set tab "%s" at index %d
pt_br: Falha ao ajustar a aba " %s " no índice %d

source: Failed to set object at index %d
pt_br: Falha ao ajustar o objeto no índice %d

source: MultiLine must be True when TabPosition is tpLeft or tpRight
pt_br: MultiLine deve ser verdadeiro quando TabPosition é tpLeft ou tpRight

source: Invalid item level assignment
pt_br: Nível de ítem atribuído invalido

source: Invalid level (%d) for item "%s"
pt_br: Nível inválido (%d) para o item " %s "

source: Invalid index
pt_br: Índice inválido

source: Unable to insert an item
pt_br: Não é possível introduzir um ítem

source: Invalid owner
pt_br: Proprietário Invalido

source: Unable to create new column
pt_br: Não é possível criar nova coluna

source: Unable to create new item
pt_br: Não é possível criar novo item

source: RichEdit line insertion error
pt_br: Erro de introdução de linha RichEdit

source: Failed to Load Stream
pt_br: Falha ao carregar Stream

source: Failed to Save Stream
pt_br: Falha ao salvar Stream

source: StatusBar cannot have more than 64 panels
pt_br: Barra de status não pode ter mais de 64 paineis

source: Error assigning Hot-Key to %s. %s
pt_br: Erro ao atribuir Hot-Key à %s. %s

source: Hot-Key is invalid
pt_br: Hot-Key inválida

source: Window is invalid or a child window
pt_br: Janela inválida ou Janela filha

source: Hot-Key is assigned to another window
pt_br: Hot-Key está atribuida a outra janela

source: %s is already associated with %s
pt_br: %s já é associado com %s

source: %d is an invalid PageIndex value. PageIndex must be between 0 and %d
pt_br: %d é um valor de índice de página inválido. Índice de página deve ser entre 0 e %d

source: This control requires version 4.70 or greater of COMCTL32.DLL
pt_br: Este controle requer COMCTL32.DLL versão 4.70 ou superior

source: Date exceeds maximum of %s
pt_br: Data excede o valor máximo de %s

source: Date is less than minimum of %s
pt_br: Data é menor que o valor mínimo de %s

source: You must be in ShowCheckbox mode to set to this date
pt_br: Você deve estar em modo de ShowCheckbox para definir a data

source: Failed to set calendar date or time
pt_br: Falha ao ajustar a data ou a hora do calendário

source: Failed to set maximum selection range
pt_br: Falha ao ajustar a escala máxima de seleção

source: Failed to set calendar min/max range
pt_br: Falha ao ajustar a escala máxima do calendário

source: Date range can only be used in multiselect mode
pt_br: A escala da data somente pode ser usada no modo multiselect

source: Failed to set calendar selected range
pt_br: Falha ao ajustar a escala selecionada do calendário

source: Open
pt_br: Abrir

source: Cannot assign a %s to a %s
pt_br: Impossível fixar um %s para um %s

source: Cannot create file %s
pt_br: Impossível Criar arquivo %s

source: Cannot open file %s
pt_br: Impossível abrir arquivo %s

source: Stream read error
pt_br: Erro no canal de Leitura

source: Stream write error
pt_br: Erro no canal de Escrita

source: Out of memory while expanding memory stream
pt_br: Falta de memoria enquanto expandindo canal de memoria

source: Can't write to a read-only resource stream
pt_br: Não é possível gravar em um fluxo de recusos somente de leitura

source: WriteObject called twice for the same instance
pt_br: Objeto chamado duas vezes pela mesma instância

source: Class %s not found
pt_br: Classe %s não encontrada

source: Invalid stream format
pt_br: Imagem inválida

source: Resource %s not found
pt_br: Recursos %s não encontrado

source: Resource %s is of incorrect class
pt_br: Arquivo de recursos %s é de classe incorreta

source: List index out of bounds (%d)
pt_br: Indice listado está fora de faixa (%d)

source: List capacity out of bounds (%d)
pt_br: Capacidade listado está fora de faixa (%d)

source: List count out of bounds (%d)
pt_br: Contador listado está fora de faixa (%d)

source: Operation not allowed on sorted string list
pt_br: Operação não suportada ao filtrar lista de strings.

source: String list does not allow duplicates
pt_br: Não é permitida lista de Strings duplicadas

source: Tab index out of bounds
pt_br: Indexador de tabulação fora de faixa

source: Tab position incompatible with current tab style
pt_br: Posição da aba incompatível com Estilo da aba corrente
