Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/delphi7.po
Languages: da, ru

source: No databases are listed in transaction component
da: Ingen databaser er i transaktionskomponentens liste
ru: Нет баз данных в списке transaction компонента

source: Updating wrong database
da: Opdaterer forkert database
ru: Изменение неверной базы данных

source: Updating wrong transaction. Unique transaction expected in set
da: Opdaterer forkert transkation. Unik transkation blev forventet i sæt
ru: Изменение неверной транзакции. В наборе ожидается уникальная транзакция

source: Database not assigned
da: Database er ikke tilknyttet
ru: База данных не определена

source: Transaction not assigned
da: Transaktion ikke tildelt
ru: Транзакция не определена

source: XSQLDA index out of range
da: XSQLDA indeks er ugyldig
ru: Индекс XSQLDA вышел за границы

source: XSQLDA name does not exist (%s)
da: XSQLDA navnet findes ikke (%s)
ru: Имя XSQLDA не найдено (%s)

source: End of file
da: Slut på fil
ru: Конец файла

source: Beginning of file
da: Start på fil
ru: Начало файла

source: Invalid statement handle
da: Ugyldigt håndtag til statement
ru: Неверный дескриптор команды

source: IBSQL Open
da: IBSQL åben
ru: IBSQL открыт

source: IBSQL Closed
da: IBSQL lukket
ru: IBSQL закрыт

source: Dataset open
da: Datasæt åbent
ru: Набор данных (Dataset) открыт

source: Dataset closed
da: Datasæt lukket
ru: Набор данных (Dataset) закрыт

source: Unknown SQL Data type (%d)
da: Ukendt SQL datatype (%d)
ru: Неверный тип данных SQL (%d)

source: Invalid column index (index exceeds permitted range)
da: Ugyldig kolonneindeks (indeks overskrider tilladt område)
ru: Неверный индекс колонки (индекс превысил разрешенный диапазон)

source: Invalid parameter index (index exceeds permitted range)
da: Ugyldigt parameterindeks (indeks overskrider tilladt område)
ru: Неверный индекс параметра (индекс превысил разрешенный диапазон)

source: Invalid data conversion
da: Ugyldig datakonvertering
ru: Неверное преобразование данных

source: Column cannot be set to null (%s)
da: Kolonne kan ikke være sat til null (%s)
ru: Колонка не может быть установлена в NULL (%s)

source: Blob stream cannot be read
da: Blobstrøm kan ikke læses
ru: Не могу прочитать из Blob stream

source: Blob stream cannot be written
da: Blobstrøm kan ikke skrives
ru: Не могу записать в Blob stream

source: Empty query
da: Tom forespørgsel
ru: Пустой запрос

source: Cannot "open" a non-select statement. Use ExecQuery
da: Kan ikke "åbne" en forespørgsel, der ikke er af select typen. Brug i stedet ExecQuery
ru: Не могу выполнить Open для не SELECT команды. Используйте ExecQuery

source: No access to field "%s"
da: Kan ikke tilgå felt "%s"
ru: Не могу получить доступ к полю '%s' в фильтре

source: Field "%s" is read-only
da: Feltet "%s" er skrivebeskyttet
ru: Поле "%s" только для чтения

source: Field "%s" not found
da: Felt "%s" blev ikke fundet
ru: %0:s: Поле "%1:s" не найдено

source: Not in edit mode
da: Ikke i redigeringstilstand
ru: Набор данных (Dataset) не в режиме редактирования или вставки

source: Cannot insert into dataset. (No insert query)
da: Kan ikke indsætte i datasæt (Ikke nogen insert forespørgsel)
ru: Не могу добавить запись в набор данных (dataset). (Нет insert запроса)

source: Cannot post. (No update/insert query)
da: Kan ikke gemme. (Ingen update/insert forespørgsel)
ru: Не могу сохранить (post). (Нет update/insert запроса)

source: Cannot update. (No update query)
da: Kan ikke opdatere. (Ingen update forespørgsel)
ru: Не могу изменить (update). (Нет update запроса)

source: Cannot delete from dataset. (No delete query)
da: Kan ikke slette fra datasæt (Ingen delete forespørgsel)
ru: Не могу удалить из набора данных (dataset). (Нет delete запроса)

source: Cannot refresh row. (No refresh query)
da: Kan ikke genindlæse række. (Ingen refresh forespørgsel)
ru: Не могу обновить запись. (Нет refresh запроса)

source: Buffer not set
da: Buffer ikke sat
ru: Буфер не установлен

source: Circular references not permitted
da: Cirkulære referencer er ikke tilladt
ru: Циклические ссылки не разрешены

source: User abort
da: Brugerafbrydelse
ru: Прервано пользователем

source: Data set is uni-directional
da: Datasættet er envejs
ru: Однонаправленный набор данных (Data set)

source: Cannot create shared resource. (Windows error %d)
da: Kan ikke oprettet en delt resource. (Windows fejl %d)
ru: Не могу создать разделенный ресурс. (Ошибка Windows %d)

source: Windows API error. (Windows error %d [$%.8x])
da: Windows API fejl. (Windows fejl %d [$%.8x])
ru: Ошибка Windows API. (Ошибка Windows %d [$%.8x])

source: Column lists do not match
da: Kolonnelister passer ikke sammen
ru: Списки колонок не совпадают

source: Column types don't match. (From index: %d; To index: %d)
da: Kolonnetyper passer ikke sammen. (Fra indeks: %d; Til indeks: %d)
ru: Типы колонок не совпадают. (С индекса %d до %d)

source: Can't end a shared transaction unless it is forced and equal to the transaction's TimeoutAction
da: Kan ikke afslutte en delt transaktion, medmindre det er tvunget og lig med transaktionens TimeoutAction
ru: Не могу завершить общую (shared) транзакцию кроме случаев, когда она принудительно завершена and equal TimeoutAction транзакции

source: Unsupported Field Type
da: Felttype er ikke understøttet
ru: Тип поля '%s' не поддерживается

source: Circular DataLink Reference
da: Cirkulær DataLink reference
ru: Циклические связи данных не разрешены

source: Empty SQL Statement
da: Tom SQL kommando
ru: Нет доступных SQL команд

source: use Open for a Select Statement
da: benyt Open for en Select kommando
ru: используйте Open для Select команды

source: Required Param value not set
da: Krævet Param værdi er ikke sat
ru: Требуемое значение Param не установлено

source: No Stored Procedure Name assigned
da: Mangler navn på Stored Procedure
ru: Не определено имя хранимой процедуры

source: use ExecProc for Procedure; use TQuery for Select procedures
da: benyt ExecProc for procedurer; benyt TQuery for Select forespørgsler
ru: используйте ExecProc для процедур; используйте TQuery для Select процедур

source: Update Failed
da: Opdatering fejlede
ru: Изменение (update) не выполнено

source: CachedUpdates not enabled
da: CachedUpdates ikke slået til
ru: CachedUpdates не разрешены

source: Request is not live - cannot modify
da: Forespørgslen er ikke af typen LiveRequest - kan ikke ændre data
ru: Запрос открыт не для изменений (not live) - не могу изменять

source: No Provider
da: Ingen provider
ru: Нет доступных провайдеров

source: No Records Affected
da: Ingen poster blev berørt
ru: Ни одной записи не обработано

source: No Table Name assigned
da: Mangler tabelnavn
ru: Отсутствует свойство TableName

source: Cannot Create Primary Index; are created automatically
da: Kan ikke oprette primært indeks; oprettes automatisk
ru: Не могу создать Primary индекс; создан автоматически

source: Cannot Drop System Index
da: Kan ikke slette systemindeks
ru: Не могу удалить System индекс

source: Table Name Mismatch
da: Tabelnavn passer ikke
ru: Не совпадает имя таблицы

source: Index Field Missing
da: Indeksfeltet mangler
ru: Не могу получить доступ к индексному полю '%s'

source: Cannot Cancel events while processing
da: Kan ikke afbryde hændelser mens der arbejdes
ru: Не могу отменить события во время обработки

source: Invalid Event
da: Ugyldig hændelse
ru: Неверное пустое событие добавлено в список событий EventAlerter

source: Exceded Maximum Event limits
da: Overskredet maksimum antal hændelser
ru: Достигнут максимальный предел для событий

source: No Events Registered
da: Ingen hændelser registreret
ru: Вы должны зарегистрировать события перед их запросом

source: Invalid Queueing
da: Ugyldig i kø sætning
ru: Нельзя вызвать QueueEvents внутри OnEventAlert

source: Invalid Registration
da: Ugyldig registrering
ru: Нельзя вызвать Register или Unregister для событий внутри OnEventAlert

source: Invalid Batch Move
da: Ugyldig BatchMove
ru: Неверное пакетное перемещение (batch move)

source: SQL Dialect Invalid
da: SQL dialekt er ugyldig
ru: Неверный диалект SQL

source: SPB Constant Not supported
da: SPB konstant er ikke understøttet
ru: SPB константа не поддерживается

source: SPB Constant Unknown
da: SPB konstant er ukendt
ru: SPB константа неизвестна

source: Cannot perform operation -- service is not attached
da: Kan ikke udføre handling -- tjenesten er ikke tilsluttet
ru: Не могу выполнить операцию -- служба не подключена

source: Cannot perform operation -- service is attached
da: Kan ikke udføre handlingen -- tjenesten er tilsluttet
ru: Не могу выполнить операцию -- служба подключена

source: Server Name Missing
da: Værtsnavnet mangler
ru: Имя сервера не указано

source: Query Parameters missing or incorrect
da: Forespørgselsparameterne mangler eller er ukorrekte
ru: Параметры запроса не указаны или неверные

source: start Parameters missing or incorrect
da: Startparametre mangler eller er ukorrekte
ru: Start параметры не указаны или неверные

source: Unexpected Output buffer value
da: Uventet uddata buffer værdi
ru: Неожидаемые значения буфера вывода

source: Generic ServiceStart not applicable: Use Specific Procedures to set configuration params
da: Generisk ServiceStart er ikke anvendelig: Brug specifikke procedurer for at sætte konfigurationsparametre
ru: Generic ServiceStart не применим: используйте Specific Procedures для установки параметров конфигурации

source: SQL Monitor Instance is already present
da: SQL Monitor instans findes allerede
ru: SQL Monitor уже запущен

source: Cannot print value
da: Kan ikke udskrive værdi
ru: Не могу напечатать значение

source: EOF in comment detected
da: EOF i kommentar blev fundet
ru: Обнаружен EOF в комментарии

source: EOF in string detected
da: EOF i string blev fundet
ru: Обнаружен EOF в строке

source: Parameter name expected
da: Parameternavn forventet
ru: Имя параметра ожидается

source: Successful execution
da: Udførsel lykkedes
ru: Успешное выполнение

source: No Install Options selected
da: Ingen installationsindstillinger blev valgt
ru: Не выбраны Install Options

source: DestinationDirectory is not set
da: DestinationDirectory er ikke sat
ru: DestinationDirectory не установлена

source: SourceDirectory is not set
da: SourceDirectory are ikke sat
ru: SourceDirectory не установлена

source: Uninstall File Name is not set
da: Afinstallationsfilnavn er ikke sat
ru: Uninstall File Name не установлено

source: %s component requires Client to function properly
da: %s komponenten kræver at klienten virker ordentligt
ru: Компоненту %s требуется Клиент для правильной работы

source: %s component requires Server to function properly
da: %s komponenten kræver at vært virker ordentligt
ru: Компоненту %s требуется Сервер для правильной работы

source: Invalid option specified
da: Ugyldigt valg
ru: Определена неверная опция

source: Unexpected onError return value
da: Uventet onError returværdi
ru: onError возвратил неожиданное значение

source: Unexpected onStatus return value
da: Uventet onStatus returværdi
ru: onStatus возвратил неожиданное значение

source: Edit SQL
da: Rediger SQL
ru: Изменить SQL

source: DPB Constant (%s) is unknown
da: DPB Constant (%s) er ukendt
ru: DPB константа (%s) не известна

source: TPB Constant (%s) is unknown
da: TPB Constant (%s) er ukendt
ru: TPB константа (%s) не известна

source: Unknown Error - Can't retrieve plan
da: Ukendt fejl - Kan ikke fremskaffe plan
ru: Неизвестная ошибка - Не могу получить план

source: Size Mismatch - Field %s size is too small for data
da: Størrelse passer ikke - Felt %s størrelse er for lille til data
ru: Неверный размер для поля '%s', ожидается: %d, установлено: %d

source: Events already registered
da: Hændelser er allerede registreret
ru: События уже зарегистрированы

source: Trying to store a string of length %d into a field that can only contain %d
da: Forsøger at gemme en tekst med længden %d i et felt som kun kan klare %d
ru: Попытка сохранить строку длиной %d в поле, которое может содержать только %d

source: &Service Editor ...
da: &Tjeneste redigeringsværktøj
ru: &Редактор сервиса ...

source: Successful Connection
da: Forbindelse blev opnået
ru: Успешное соединение

source: Provider not exported: %s
da: Provider ikke eksporteret: %s
ru: Провайдер не экспортирован: %s

source: Missing data provider or data packet
da: Mangler dataprovider eller datapakke
ru: Потерян провайдер данных или пакет данных

source: Must apply updates before refreshing data
da: Skal udføre opdateringer før data kan genindlæses
ru: Необходимо применить изменения перед обновлением данных

source: Invalid provider. Provider was freed by the application server
da: Ugyldig provider. Provider blev frigjort af applikationsværten
ru: Неверный провайдер. Провайдер был освобожден сервером приложений

source: Cannot connect, %s must contain a valid ServerName or ServerGUID
da: Kan ikke forbinde, %s skal indeholde et gyldigt værtsnavn eller ServerGUID
ru: Не могу подключиться, %s должен содержать правильное ServerName или ServerGUID

source: Cannot connect, %s must contain a valid repository id
da: Kan ikke forbinde, %s skal indeholde et gyldigt repository id
ru: Не могу соединиться, %s должен содержать правильное repository id

source: Grouping level exceeds current index field count
da: Grupperingsniveauet overskrider indeks feltantallet
ru: Уровень группировки превысил текущее количество полей индекса

source: Grouping level not defined
da: Grupperingsniveau er ikke defineret
ru: Уровень группировки не определен

source: Circular provider references not allowed
da: Cirkulære provider referencer er ikke tilladt
ru: Циклические ссылки провайдеров не разрешаются

source: Error loading MIDAS.DLL
da: Fejl ved indlæsning af MIDAS.DLL
ru: Ошибка загрузки MIDAS.DLL

source: No fields defined. Cannot create dataset
da: Ingen felter defineret. Kan ikke oprette datasæt
ru: Поля не определены. Не могу создать набор данных (dataset)

source: CloneConnection invalid: distinct ClientDataSet descendents
da: CloneConnection ugyldig: forskellige nedarvninger fra ClientDataSet
ru: Неверное CloneConnection: различные потомки ClientDataSet

source: Open MyBase table
da: Åbn MyBase tabel
ru: Открыть таблицу MyBase

source: Connection not allowed to TConnectionBroker
da: Forbindelse til TConnectionBroker er ikke tilladt
ru: Соединение с TConnectionBroker не допустимо

source: Error reading from socket
da: Fejl ved læsning fra socket
ru: Ошибка чтения из socket

source: Provider name "%s" was not recognized by the server
da: Providernavn "%s" blev ikke genkendt af værten
ru: Имя провайдера "%s" не распознано сервером

source: Unsupported variant type: %s
da: Varianttypen %s er ikke understøttet
ru: Неподдерживаемый вариантный тип: %s

source: Invalid action received: %d
da: Ugyldig aktion modtaget: %d
ru: Запрошено неверное действие

source: ParentConnection is not assigned
da: ParentConnection er ikke tildelt
ru: ParentConnection не присвоено

source: ChildName cannot be blank
da: ChildName kan ikke være tom
ru: ChildName не может быть пустым

source: Invalid response
da: Ugyldigt svar
ru: Неверный ответ

source: Update affected more than 1 record.
da: Opdateringen berørte mere end 1 post.
ru: Изменение (Update) затрагивает более 1 записи.

source: Value cannot be stored in an optional parameter
da: Værdi kan ikke gemmes i en valgfri parameter
ru: Значение не может быть сохранено в необязательный параметр

source: Record or field constraint failed.
da: Post eller felt begrænsning fejlede
ru: Условие на запись или поле (constraint) не выполнилось.

source: Field
da: Felt

source: Cannot apply updates to a ReadOnly provider
da: Kan ikke opdatere til en skrivebeskyttet provider
ru: Не могу применить изменения для ReadOnly провайдера

source: Unable to find record. No key specified
da: Ude af stand til at finde post. Ingen nøgle angivet
ru: Не могу найти запись. Не определен ключ

source: Field name cannot be longer then %d characters. Try setting ObjectView to True on the dataset
da: Feltnavn kan ikke være længere end %d tegn. Prøv at slå ObjectView til på datasættet
ru: Имя поля не может быть длиннее чем %d символов. Попытайтесь установить ObjectView в True в dataset

source: Cannot resolve to dataset when using nested datasets or references
da: Kan ikke resolve til datasættet når der bruges nestede datasæt eller referencer
ru: Не могу определить набор данных, когда используются вложенные наборы данных или ссылки

source: Preparation of record constraint failed with error "%s"
da: Forberedelse af post begrænsning fejlede med meddelelsen "%s"
ru: Подготовка record constraint не выполнилась с ошибкой "%s"

source: Preparation of field constraint failed with error "%s"
da: Forberedelse af feltbegræsning fejlede med meddelelse "%s"
ru: Подготовка field constraint не выполнилась с ошибкой "%s"

source: Preparation of default expression failed with error "%s"
da: Foreberedelse af standardudtrykket fejlede med meddelelsen "%s"
ru: Подготовка default expression не выполнилась с ошибкой "%s"

source: Array elements of type %s are not supported
da: Array elementer af typen %s er ikke understøttet
ru: Массив элементов типа %s не поддерживается

source: Unable to resolve records. Table name not found.
da: Ude af stand til at resolve poster. Tabelnavn kunne ikke findes.
ru: Отсутствует свойство TableName

source: Modifications are not allowed
da: Modifikationer er ikke tilladt
ru: Изменения не допустимы

source: Deletes are not allowed
da: Sletninger er ikke tilladt
ru: Удаления не допустимы

source: Inserts are not allowed
da: Indsættelser er ikke tilladt
ru: Добавления (inserts) не допустимы

source: CommandText changes are not allowed
da: CommandText må ikke modificeres
ru: Изменения CommandText не допустимы

source: Operation not allowed with aggregates active
da: Handling er ikke tilladt med aktive aggregater
ru: Операция не допустима с активными aggregates

source: No server available
da: Ingen vært til rådighed
ru: Нет доступного сервера

source: Requires Connection before opening
da: Kræver forbindelse får den åbnes
ru: Требуется Connection перед открытием

source: Circular reference to Connection not allowed
da: Cirkulær reference til forbindelse er ikke tilladt
ru: Циклические ссылки на Connection не допустимы

source: Expected return value not received
da: Forventet returværdi blev ikke modtaget
ru: Ожидаемое возвращаемое значение не получено

source: WinSock 2 must be installed to use the socket connection
da: WinSock 2 skal være installeret for at bruge socketforbindelsen
ru: Должен быть установлен WinSock 2 для использования socket соединения

source: URL required
da: URL krævet
ru: Требуется URL

source: URL must be in the form "http://server.company.com/scripts/httpsrvr.dll"
da: URL skal være i formen "http://server.company.com/scripts/httpsrvr.dll"
ru: Неверный url '%s' - поддерживает только 'http' и 'https' схемы

source: Server is busy
da: Værten har travlt
ru: Сервер занят

source: Object not available: %s
da: Objekt er ikke til rådighed: %s
ru: Объект не доступен: %s

source: Cannot open detail table with master closed
da: Kan ikke åbne detaljetabel når mestertabellen er lukket
ru: Не могу открыть detail таблицу, если master закрыта

source: '%s' is not a valid property value
da: '%s' er ikke en tilladt egenskabsværdi
ru: '%s' - недопустимое значение свойства

source: OLE control activation failed
da: OLE kontrol aktivering mislykkedes
ru: Ошибка активации элемента управления OLE

source: Could not obtain OLE control window handle
da: Kunne ikke få fat i håndtag til OLE kontrol vindue
ru: Не могу получить дескриптор окна элемента управления OLE

source: OLE error %.8x
da: OLE fejl %.8x
ru: Ошибка OLE %.8x

source: Variant does not reference an OLE object
da: Variant referer ikke til et OLE objekt
ru: Вариант не ссылается automation объектом

source: Variant does not reference an automation object
da: Variant refererer ikke til et automation objekt
ru: Вариант не ссылается automation объектом

source: Method '%s' not supported by OLE object
da: Metode '%s' er ikke understøttet af OLE objekt
ru: Метод '%s' не поддерживается automation объектом

source: Link Properties
da: Sammenkædningsegenskaber
ru: Свойства соединения

source: Cannot link to an invalid source.
da: Kan ikke tilkoble en ugyldig kilde.
ru: Не могу подключиться к неверному источнику.

source: Break link operation is not supported.
da: Break link handling er ikke understøttet
ru: Операция сброса соединения не поддерживается.

source: Linked %s
da: Tilkoblede %s
ru: Подключен %s

source: Operation not allowed on an empty OLE container
da: Handling er ikke tilladt på en tom OLE container
ru: Операция не разрешена на пустом OLE контейнере

source: Invalid object verb
da: Ugyldigt objekt udsagnsord

source: %s Properties
da: %s egenskaber
ru: %s Свойства

source: Invalid stream format
da: Ugyldigt strømformat
ru: Неверный формат потока

source: License information for %s is invalid
da: Licensinformation for %s er ugyldig
ru: Неверная информация о лицензии для %s

source: License information for %s not found. You cannot use this control in design mode
da: Licensinformation for %s blev ikke fundet. Du kan ikke bruge denne kontrol i designtilstand
ru: Информация о лицензии для %s не найдена. Вы не можете использовать этот элемент управления в режиме разработки

source: Unable to retrieve a pointer to a running object registered with OLE for %s/%s
da: Ude af stand til at hente peger til et kørende objekt registreret med OLE for %s/%s
ru: Не могу получить ссылку на работающий объект, зарегистрированный в OLE, для %s/%s

source: The Socket Server can only be run as a service on NT 3.51 and prior
da: Socketværten kan kun køres som en tjeneste på NT 3.51 og tidligere
ru: Socket Server может работать только как служба на NT 3.51 или ранее

source: Cannot exit when there are active connections. Kill connections?
da: Kan ikke afslutte så længe der er aktive forbindelser. Afbryd forbindelserne?
ru: Не могу выйти, пока есть активные соединения

source: Cannot change settings when there are active connections. Kill connections?
da: Kan ikke ændre indstillingerne sålænge der er aktive forbindelser. Afbryd forbindelserne?
ru: Не могу изменить установки, когда есть активные соединения. Прервать соединения?

source: Disconnecting clients can cause application errors. Continue?
da: Afbrydelse af forbindelserne kan medføre programfejl. Fortsæt?
ru: Отсоединение клиентов может вызвать ошибки приложений. Продолжить?

source: Error opening port %d with error: %s
da: Fejl ved åbning af port %d: %s
ru: Ошибка открытия порта %d с ошибкой: %s

source: (Not Shown)
da: (Ikke vist)
ru: (Невидим)

source: %d current connections
da: %d samtidige forbindelser
ru: %d текущих соединений

source: The Socket Server is already running
da: Socketværten kører allerede
ru: Socket Server уже работает

source: This change will not take affect until the Socket Server is restarted
da: Denne ændring vil ikke blive effektueret før socketværten genstartes
ru: Это изменение не вступит в силу пока Socket Server не будет перезагружен

source: Cannot change connection on Active Monitor
da: Kan ikke ændre forbindelsen på ActiveMonitor
ru: Не могу изменить соединение в Active Monitor

source: Missing SQLConnection property
da: Mangler SQLConnection egenskab
ru: Не указано Connection или ConnectionString

source: Cannot perform this operation on an open connection
da: Kan ikke udføre denne handling på en åben forbindelse
ru: Не могу выполнить операцию -- БД открыта

source: Cannot perform this operation on a closed connection
da: Kan ikke udføre denne handling på en lukket forbindelse
ru: Не могу выполнить операцию -- БД не открыта

source: SQLConnection property required for this operation
da: SQLConnection egenskab er påkrævet for denne handling
ru: Свойство SQLConnection требуется для этой операции
