Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/delphi7.po
Languages: da, ru

source: Invalid action enumeration
da: Ugyldig aktionsnummerering
ru: Неверный перечень действий (action)

source: Invalid action creation
da: Ugyldig aktionsoprettelse
ru: Неверное создание действия (action)

source: Docked control must have a name
da: Dokket kontrol skal have et navn
ru: Докированный элемент должен иметь имя

source: Error removing control from dock tree
da: Fejl ved fjernelse af kontrol fra dokningstræet
ru: Ошибка удаления элемента из dock tree

source: - Dock zone not found
da: - Dokzone blev ikke fundet
ru: - область докирования не найдена

source: - Dock zone has no control
da: - Dokzonen har ingen kontrol
ru: - область докирования не имеет элементов управления

source: List does not allow duplicates ($0%x)
da: Listen tillader ikke dubletter ($0%x)
ru: Список не допускает дубликатов ($0%x)

source: No default browser is specified
da: Ingen standard netlæser (browser) er specificeret
ru: Не определен браузер по умолчанию

source: Custom...
da: Brugervalgt...
ru: Выбрать...

source: Multiselect mode must be on for this feature
da: Multiselect tilstanden skal være slået til for denne facilitet
ru: Режим множественного выбора должен быть включен для этой возможности

source: Key
da: Nøgle
ru: Параметр

source: A key with the name of "%s" already exists
da: En nøgle med navnet "%s" findes allerede
ru: Параметр с именем "%s" уже создан

source: Key "%s" not found
da: Nøglen "%s" blev ikke fundet
ru: Параметр "%s" не найден

source: goColMoving is not a supported option
da: goColMoving er ikke en understøttet valgmulighed
ru: goColMoving - неподдерживаемая опция

source: Key may not contain equals sign ("=")
da: Nøgle må ikke indeholde lighedstegn ("=")
ru: Параметр не может содержать знак "равно" ("=")

source: Error sending mail
da: Fejl ved afsendelse af post
ru: Ошибка отправки почты

source: Cannot assign a subitem to an actionbar when one of it's parent's is already assigned to an actionbar
da: Kan ikke knytte et underelement til en actionbar, hvis en af forældrene allerede er tilknyttet en actionbar
ru: Не могу присвоить подпункт к actionbar когда один из его предков уже присвоен actionbar

source: Item %s has subitems, delete anyway?
da: Element %s har underelementer. Slet alligevel?
ru: Пункт %s имеет подпункты, все равно удалить?

source: You are not allowed to delete this item
da: Du har ikke lov til at slette dette element
ru: Вам не разрешено удалять этот пункт

source: Item %s is not allowed to be moved
da: Det er ikke tilladt for element %s at blive flyttet
ru: Пункт %s нельзя перемещать

source: More Buttons
da: Flere knapper
ru: Больше кнопок

source: Error downloading URL: %s
da: Fejl ved nedhentning af URL: %s
ru: Ошибка загрузки URL: %s

source: Unable to load %s
da: Ude af stand til at indlæse %s
ru: Не могу загрузить %s

source: (All Actions)
da: (Alle handlinger)
ru: (Все действия)

source: (No Category)
da: (Ingen kategori)
ru: (Нет категории)

source: Expand
da: Udvid

source: Error setting path: "%s"
da: Kunne ikke gemme stien: "%s"
ru: Ошибка установки пути: "%s"

source: Attempting to put items into a virtual style listbox
da: Forsøger at putte elementer ind i en virtuel stil listboks
ru: Попытка поместить пункты в виртуальный listbox

source: Error loading previously saved settings file: %sWould you like to delete it?
da: Fejl ved indlæsning af fil med indstillinger, som er blevet gemt tidligere: %s Ønsker du at slette filen?
ru: Ошибка загрузки ранее сохраненного файла настроек: %sВы хотите удалить его?

source: Reset all usage data?
da: Nulstil brugsdata?
ru: Reset все используемые данные?

source: Run
da: Kør
ru: Выполнить

source: (No Name)
da: (Intet navn)
ru: (Нет имени)

source: ActionManager must first be assigned
da: ActionManager skal først tilknyttes
ru: ActionManager должен быть присвоен первым

source: &Add or Remove Buttons
da: &Tilføj eller fjern knapper
ru: &Добавить или удалить кнопки

source: Reset Toolbar
da: Nulstil værktøjsbjælke

source: &Customize
da: &Indstil
ru: &Настроить

source: Circular references not allowed
da: Cirkulære referencer er ikke tilladt
ru: Циклические ссылки не поддерживаются

source: %s does not allow hiding
da: %s tillader ikke usynliggørelse
ru: %s не позволяет скрыть (hiding)

source: Error setting %s.Count
da: Fejl ved indstilling af %s.Count
ru: Ошибка установки %s.Count

source: Listbox (%s) style must be virtual in order to set Count
da: Listboks (%s) stil skal være virtuel for at kunne sætte Count
ru: Listbox (%s) Style должен быть Virtual для установки такого Count

source: Unable to save settings
da: Ude af stand til at gemme indstillinger
ru: Не могу сохранить установки

source: Would you like to reset to the default Priority Schedule?
da: Ønsker du at nulstille til standard prioritetsskemaet?
ru: Вы хотите восстановить Priority Schedule по умолчанию?

source: No OnGetItem event handler assigned
da: Ingen OnGetItem hændelseshåndterer tilknyttet
ru: Не определен обработчик события OnGetItem

source: Invalid Colormap this ActionBand requires ColorMaps of type TCustomActionBarColorMapEx
da: Ugyldigt farvekort - dette ActionBand kræver farvkort af typen TCustomActionBarColorMapEx
ru: Неверный Colormap этот ActionBand требует ColorMaps типа TCustomActionBarColorMapEx

source: A style named %s has already been registered
da: En stil ved navn %s er allerede blevet registreret
ru: Стиль с именем %s уже зарегистрирован

source: Standard Style
da: Standardstil
ru: Стандартный стиль

source: XP Style
da: XP stil
ru: Стиль XP

source: No ActionBand style unit present in the uses clause.Your application must include either XPStyleActnCtrls, StdStyleActnCtrls or a third party ActionBand style unit in its uses clause.
da: Ingen ActionBand stil unit er tilstede i uses delen. Dit program skal inkludere enten XPStyleActnCtrls, StdStyleCtnCtrls eller en tredjeparts ActionBand stil unit i uses delen.
ru: Нет модуля со стилем ActionBand в предложении uses.Ваше приложение должно включать либо XPStyleActnCtrls, StdStyleActnCtrls, или модуль со стилем ActionBand третьей фирмы в своем предложении uses.

source: Invalid class reference for TAppletApplication
da: Ugyldig klassereference for TAppletApplication
ru: Неверная ссылка класса для TAppletApplication

source: Invalid field size
da: Ugyldig feltstørrelse
ru: Неверный размер поля

source: Invalid FieldKind
da: Ugyldig FieldKind
ru: Неверный FieldKind

source: Invalid field registration
da: Ugyldig feltregistrering
ru: Неверная регистрация поля

source: Field '%s' is of an unknown type
da: Felt '%s' er af ukendt type
ru: Тип поля '%s' неизвестен

source: Field name missing
da: Feltnavnet mangler
ru: Отсутствует имя поля

source: Duplicate field name '%s'
da: Dubleret feltnavn '%s'
ru: Дубликат имени поля '%s'

source: Field '%s' not found
da: Felt '%s' ikke fundet
ru: %0:s: Поле "%1:s" не найдено

source: Cannot access field '%s' as type %s
da: Kan ikke få adgang til felt '%s' som type %s
ru: Не могу получить доступ к полю '%s' как типа %s

source: Invalid value for field '%s'
da: Ugyldig værdi for felt '%s'
ru: Неверное значение для поля '%s'

source: %g is not a valid value for field '%s'. The allowed range is %g to %g
da: %g er ikke en gyldig værdi for felt '%s'. Det tilladte område er %g til %g
ru: %g - неверное значение для поля '%s'. Разрешенный диапазон - от %g до %g

source: %s is not a valid value for field '%s'. The allowed range is %s to %s
da: %s er ikke en gyldig værdi for felt '%s'. Det tilladte område er %s til %s
ru: %s - неверное значение для поля '%s'. Разрешенный диапазон - от %s до %s

source: '%s' is not a valid integer value for field '%s'
da: '%s' er ikke en gyldig heltalsværdi for felt '%s'
ru: '%s' - неверное целое значение для поля '%s'

source: '%s' is not a valid boolean value for field '%s'
da: '%s' er ikke en gyldig boolean værdi for felt '%s'
ru: '%s' - неверное логическое значение для поля '%s'

source: '%s' is not a valid floating point value for field '%s'
da: '%s' er ikke en gyldig kommatalsværdi for felt '%s'
ru: '%s' - неверное дробное значение для поля '%s'

source: Type mismatch for field '%s', expecting: %s actual: %s
da: Typerne passer ikke for felt '%s'. Forventer %s, men det var %s
ru: Тип поля '%s' не соответствует ожидаемому

source: Size mismatch for field '%s', expecting: %d actual: %d
da: Størrelserne passer ikke for felt '%s', forventer %d men det var %d
ru: Неверный размер для поля '%s', ожидается: %d, установлено: %d

source: Invalid variant type or size for field '%s'
da: Ugyldig varianttype eller størrelse for felt '%s'
ru: Неверный вариантный тип или размер

source: Value of field '%s' is out of range
da: Værdi fra felt '%s' er uden for gyldigt område
ru: Значение поля '%s' вышло за границы

source: Field '%s' must have a value
da: Felt '%s' skal have en værdi
ru: Поле '%s' должно иметь значение

source: Field '%s' has no dataset
da: Felt '%s' har ikke noget datasæt
ru: Поле '%s' не имеет набора данных (dataset)

source: Field '%s' cannot be a calculated or lookup field
da: Felt '%s' kan ikke være et beregnet felt eller opslagsfelt
ru: Поле '%s' не может быть вычисляемым или поисковым полем

source: Field '%s' cannot be modified
da: Felt '%s' kan ikke modificeres
ru: Поле "%s" только для чтения

source: Field index out of range
da: Feltindeks er uden for gyldigt talområde
ru: Индекс поля вышел за границы

source: No index currently active
da: Intet indeks er aktivt lige nu
ru: Нет активного индекса

source: Field '%s' is not indexed and cannot be modified
da: Felt '%s' er ikke indekseret og kan ikke modificeres
ru: Поле '%s' не индексировано и не может быть изменено

source: Cannot access index field '%s'
da: Kan ikke få adgang til indeksfeltet '%s'
ru: Не могу получить доступ к индексному полю '%s'

source: Duplicate index name '%s'
da: Dubleret indeksnavn '%s'
ru: Дубликат имени индекса '%s'

source: No index for fields '%s'
da: Intet indeks for felt '%s'
ru: Таблица '%s' не имеет индекса для полей '%s'

source: Index '%s' not found
da: Indeks '%s' kan ikke findes
ru: Индекс '%s' не найден

source: Duplicate name '%s' in %s
da: Dubleret navn '%s' i %s
ru: Компонент с именем %s уже существует

source: Circular datalinks are not allowed
da: Cirkulære datareferencer er ikke tilladt
ru: Циклические связи данных не разрешены

source: Lookup information for field '%s' is incomplete
da: Opslagsoplysningerne for felt '%s' er ikke komplette
ru: Информация поиска (lookup) для поля '%s' - неполная

source: New Lookup Field
da: Nyt opslagsfelt
ru: Новое поисковое (lookup) поле

source: DataSource cannot be changed
da: DataSource kan ikke ændres
ru: DataSource не может быть изменен

source: Nested datasets cannot have a MasterSource
da: Nestede datasæt kan ikke have en MasterSource
ru: Вложенные таблицы не могут иметь MasterSource

source: Cannot perform this operation on an open dataset
da: Kan ikke udføre denne handling på et åbent datasæt
ru: Набор данных (Dataset) открыт

source: Dataset not in edit or insert mode
da: Datasæt er ikke i redigerings- eller indsætningstilstand
ru: Набор данных (Dataset) не в режиме редактирования или вставки

source: Cannot perform this operation on a closed dataset
da: Kan ikke udføre denne handling på et lukket datasæt
ru: Набор данных (Dataset) закрыт

source: Cannot perform this operation on an empty dataset
da: Kan ikke udføre denne hadnling på et tomt datasæt
ru: Не могу выполнить эту операцию для пустого набора данных (dataset)

source: Cannot modify a read-only dataset
da: Kan ikke modificere et skrivebeskyttet datasæt
ru: Не могу изменять набор данных "только для чтения" (read-only dataset)

source: Nested dataset must inherit from %s
da: Nestede datasæt skal nedarve fra %s
ru: Вложенный набор данных должен наследоваться от %s

source: Filter expression incorrectly terminated
da: Filterudtryk er afsluttet ukorrekt
ru: Выражение фильтра некорректно завершено

source: Unterminated field name
da: Uafsluttet feltnavn
ru: Незавершенное имя поля

source: Unterminated string constant
da: Uafsluttet tekst værdi
ru: Незавершенная строковая константа

source: Invalid filter expression character: '%s'
da: Ugyldigt tegn i filterudtryk: '%s'
ru: Неверный символ в выражении фильтра: '%s'

source: '(' expected but %s found
da: '(' blev forventet men %s blev fundet
ru: '(' ожидается, но обнаружено %s

source: ')' expected but %s found
da: ')' blev forventet, men %s blev fundet
ru: ')' ожидается, но обнаружено %s

source: ')' or ',' expected but %s found
da: ')' eller ',' blev forventet, men %s fundet
ru: ')' или ',' ожидается, но обнаружено %s

source: Expression expected but %s found
da: Udtryk blev forventet men %s blev fundet
ru: Ожидается выражение, но обнаружено %s

source: Field '%s' cannot be used in a filter expression
da: Felt '%s' kan ikke bruges i et filterudtryk
ru: Поле '%s' не может использоваться в выражении фильтра

source: NULL only allowed with '=' and '<>'
da: NULL er kun tilladt med '=' eller '<>'
ru: NULL разрешено только с '=' и '<>'

source: Constant out of range
da: Talværdi er uden for gyldigt område
ru: Константа вышла за границы

source: Field '%s' is not of type Boolean
da: Felt '%s' er ikke af typen Boolean
ru: Поле '%s' - не логического типа

source: Incorrectly formed filter expression
da: Ukorrekt udformet filterudtryk
ru: Некорректно сформированное выражение фильтра

source: nothing
da: ingenting
ru: пусто

source: Type mismatch in expression
da: Typefejl i udtryk
ru: Несовпадение типов в выражении

source: Operation cannot mix aggregate value with record-varying value
da: Handling kan ikke blande aggregatværdier med post-varierende værdier
ru: В операция нельзя смешивать агрегатные значения со значениями полей

source: Arithmetic in filter expressions not supported
da: Aritmetik er ikke understøttet i filterudtryk
ru: Арифметика в выражении фильтра не поддерживается

source: Expression is not an aggregate expression
da: Udtryk er ikke et aggregatudtryk
ru: Выражение не является агрегатным

source: Constant is not correct type %s
da: Værdi er ikke af korrekt type %s
ru: Константа неверного типа %s

source: Aggregate expressions not allowed in filters
da: Aggregatudtryk er ikke tilladt i filtre
ru: Агрегатные выражения не поддерживаются в фильтрах

source: IN predicate list may not be empty
da: IN predikatlisten er muligvis ikke tom
ru: Список IN команды не может быть пустым

source: Invalid use of keyword
da: Ugyldigt brug af nøgleord
ru: Неверное использование ключевого слова

source: Parameter '%s' not found
da: Parameteren '%s' blev ikke fundet
ru: Параметр '%s' не найден

source: Unable to load bind parameters
da: Ude af stand til at indlæse bind parametre
ru: Невозможно загрузить параметры привязки

source: Parameter '%s', cannot save data larger than %d bytes
da: Parameter '%s', kan ikke gemme data større end %d byte
ru: Параметр '%s', не могу сохранить данные длиннее %d байт

source: Field '%s' is of an unsupported type
da: Felt '%s' er af en ikke understøttet type
ru: Тип поля '%s' не поддерживается

source: Property may not be modified while aggregate is active
da: Egenskab må ikke modificeres mens et aggregat er aktivt
ru: Свойство не может быть изменено, пока aggregate активно

source: SQL not supported: %s
da: SQL er ikke understøttet: %s
ru: SQL не поддерживается: %s

source: Execute not supported: %s
da: Udførsel er ikke understøttet: %s
ru: Выполнение не поддерживается: %s

source: Field '%s' is not the correct type of calculated field to be used in an aggregate, use an internalcalc
da: Felt '%s' er ikke den korrekte type af beregnet felt til at blive brugt i et aggregat, brug en internalcalc
ru: Используется поле '%s' неверного типа вычисляемого поля в aggregate, используйте internalcalc

source: Record not found or changed by another user
da: Post ikke fundet eller ændret af en anden bruger
ru: Запись изменена другим пользователем

source: Operation not allowed on a unidirectional dataset
da: Handling er ikke tilladt på et envejs datasæt
ru: Однонаправленный набор данных (Data set)

source: Unassigned variant value
da: Variantværdi er ikke tildelt
ru: Unassigned значение варианта

source: Record not found
da: Post ikke fundet
ru: Запись не найдена

source: FileName property cannot be blank
da: FileName egenskaben kan ikke være tom
ru: Свойство FileName не может быть пустым

source: Fieldname %s exceeds %d chars
da: Feltnavnet %s overskrider %d tegn
ru: Имя поля %s превысило %d символов

source: BCD overflow
da: BCD overløb
ru: (Переполнение)

source: %s is not a valid BCD value
da: %s er ikke en gyldig BCD værdi
ru: %s - неверное BCD значение

source: Invalid format type for BCD
da: Ugyldig formattype for BCD
ru: Неверный тип формата для BCD

source: Could not parse SQL TimeStamp string
da: Kunne ikke forstå tekst i SQL som skulle angive et tidspunkt
ru: Не могу разобрать SQL TimeStamp строку

source: Invalid SQL date/time values
da: Ugyldige dato/tidsværdier i SQL
ru: Неверные значения SQL даты/времени

source: Skip
da: Overspring
ru: Пропустить

source: Merge
da: Flet
ru: Объединить

source: Correct
da: Korrekt

source: Refresh
da: Genindlæs
ru: Обновить

source: Modified
da: Modificeret
ru: Изменено

source: Inserted
da: Indsat
ru: Вставлено

source: Deleted
da: Slettest
ru: Удалено

source: Update Error - %s
da: Opdateringsfejl - %s
ru: Ошибка изменения - %s

source: <Unchanged>
da: <Uændret>
ru: <Не изменено>

source: (Binary)
da: (Binært)
ru: (Двоичный)

source: Original Value
da: Oprindelig værdi
ru: Исходное значение

source: Conflicting Value
da: Konfliktende værdi
ru: Конфликтующее значение

source: Value
da: Værdi
ru: Значение

source: <No Records>
da: <Ingen poster>
ru: <Нет записей>

source: New
da: Ny
ru: Нов.

source: Black
da: Sort

source: Green
da: Grøn

source: Olive
da: Oliven

source: Navy
da: Marineblå

source: Purple
da: Lilla

source: Teal
da: Opal

source: Gray
da: Grå

source: Silver
da: Sølv

source: Red
da: Rød

source: Yellow
da: Gul

source: Blue
da: Blå

source: Aqua
da: Vand

source: White
da: Hvid

source: Money Green
da: Dollargrøn

source: Sky Blue
da: Himmelblå

source: Cream
da: Flødefarvet

source: Medium Gray
da: Mellemgrå

source: Active Border
da: Aktiv kant

source: Active Caption
da: Aktiv betegnelse

source: Application Workspace
da: Programarbejdsområde

source: Background
da: Baggrund

source: Button Face
da: Knapflade

source: Button Highlight
da: Knapoplysning

source: Button Shadow
da: Knapskygge

source: Button Text
da: Knaptekst

source: Caption Text
da: Betegnelse tekst

source: Gradient Active Caption
da: Gradient aktiv betegnelse

source: Gradient Inactive Caption
da: Gradient inaktiv betegnelse

source: Gray Text
da: Grå tekst

source: Highlight Background
da: Oplysning baggrund

source: Highlight Text
da: Oplysning tekst

source: Inactive Border
da: Inaktiv kant

source: Inactive Caption
da: Inaktiv betegnelse

source: Inactive Caption Text
da: Inaktiv betegnelse tekst

source: Info Background
da: Info baggrund

source: Info Text
da: Info tekst

source: Menu Background
da: Menu baggrund

source: Menu Text
da: Menu tekst

source: None
da: Ingen

source: Scroll Bar
da: Rullebjælke

source: 3D Dark Shadow
da: 3D mørk skygge

source: 3D Light
da: 3D lys

source: Window Background
da: Vindue baggrund

source: Window Frame
da: Vinduesramme

source: Window Text
da: Vinduestekst

source: Could not find server in ObjectManager list
da: Kunne ikke finde vært i ObjectManager liste
ru: Не найден

source: Backup Database files
da: Sikkerhedskopier databasefiler
ru: Файлы резервных копий БД

source: Size(Bytes)
da: Størrelse(Bytes)
ru: Размер(байт)

source: Filename(s)
da: Filnavn(e)
ru: Имя файла(ов)

source: Pages
da: Sider
ru: Страницы

source: Database Files|*.gdb
da: Databasefiler|*.gdb
ru: Файлы баз данных|*.gdb

source: &Transaction Editor...
da: &Transaktionsredigeringsværktøj...
ru: Редактор &транзакций...

source: Database Files (*.gdb)|*.gdb|All files (*.*)|*.*
da: Database Filer (*.gdb)|*.gdb|Alle filer (*.*)|*.*
ru: Файлы БД (*.gdb)|*.gdb|Все файлы (*.*)|*.*

source: Transaction is currently Active. Rollback and continue?
da: Transaktion er aktiv lige nu. Skal der foretages en rollback og fortsættes?
ru: Транзакция активна. Откатить ее и продолжить?

source: &Dataset Editor...
da: &Datasætredigeringsværktøj...
ru: &Редактор набора данных...

source: %s, Default
da: %s, Standard
ru: %s, По умолчанию

source: InterBase library gds32.dll not found in the path. Please install InterBase to use this functionality
da: InterBase biblioteket gds32.dll blev ikke fundet i stien. Installer venligst InterBase eller Firebird for at bruge denne funktionalitet
ru: Библиотека InterBase gds32.dll не найдена. Пожалуйста, установите InterBase для использования этой возможности

source: InterBase library gds.so.0 not found in the path. Please install InterBase to use this functionality
da: Interbase bibliotek gds.so.0 blev ikke fundet i stien. Installer venligst Interbase eller Firebird for at bruge denne funktionalitet
ru: Библиотека InterBase gds32.dll не найдена. Пожалуйста, установите InterBase для использования этой возможности

source: InterBase Install DLL ibinstall.dll not found in the path. Please install InterBase 6 to use this functionality
da: InterBase installation DLL ibinstall.dll blev ikke fundet i stien. Installer venligst InterBase 6 for at bruge denne funktionalitet
ru: Библиотека установки InterBase ibinstall.dll не найдена. Пожалуйста, установите InterBase 6 для использования этой возможности

source: %s is an InterBase 6 function. Please upgrade to InterBase 6 to use this functonality
da: %s er en Interbase 6 funktion. Opgrader venligst til Interbase 6 for at bruge denne funktionalitet
ru: %s - это функция InterBase6. Пожалуйста, обновите до InterBase6 для использования этой возможности

source: Unsupported feature
da: Denne fascilitet er ikke understøttet
ru: Неподдерживаемая возможность

source: Not permitted
da: Ikke tilladt
ru: Не допустимо

source: Temporary file access error
da: Fejl ved tilgang til midlertidige filer
ru: Ошибка доступа к временному файлу

source: Database connection timed out
da: Tidsudløb for databaseforbindelse
ru: Истекло время соединения к базе данных

source: Cannot set database
da: Kan ikke sætte database
ru: Не могу установить базу данных

source: Cannot set transaction
da: Kan ikke sætte transaktion
ru: Не могу стартовать транзакцию

source: Operation cancelled at user's request
da: Handling blev afbrudt fordi brugeren ønskede det
ru: Операция прервана по запросу пользователя

source: DPB Constant (isc_dpb_%s) is unsupported
da: DPB Constant (isc_dpb_%s) er ikke understøttet
ru: DPB константа (isc_dpb_%s) не поддерживается

source: DPB Constant (%d) is unknown
da: DPB konstant (%d) er ukendt
ru: DPB константа (%d) неизвестна

source: TPB Constant (isc_tpb_%s) is unsupported
da: TPB Constant (isc_tpb_%s) er ikke understøttet
ru: TPB константа (isc_tpb_%s) не поддерживается

source: TPB Constant (%d) is unknown
da: TPB Constant (%d) er ukendt
ru: TPB константа (%d) неизвестна

source: Cannot perform operation -- DB is not open
da: Kan ikke udføre handling - databasen er ikke åben
ru: Не могу выполнить операцию -- БД не открыта

source: Cannot perform operation -- DB is currently open
da: Kan ikke udføre handling - databasen er åben
ru: Не могу выполнить операцию -- БД открыта

source: Database name is missing
da: Databasenavnet mangler
ru: Не указано имя базы данных

source: Transaction is not active
da: Transaktion er ikke aktiv
ru: Транзакция не активна

source: Transaction is active
da: Transkation er aktiv
ru: Транзакция активна

source: Timeout values cannot be negative
da: Tidsudløbsværdier kan ikke være negative
ru: Значения задержек не могут быть отрицательными
