Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/delphi7.po
Languages: da, ru

source: Invalid parent class: %s
da: Ugyldig forælderklasse: %s
ru: Неверный родительский класс: %s

source: Field %s ignored, only one status field allowed
da: Felt %s ignoreret, kun et statusfelt er tilladt
ru: Поле %s проигнорировано, допускается только одно статус поле

source: Post
da: Send

source: <TABLE BORDER=1 CELLPADDING=4> <TR><TD><P ALIGN=CENTER>Design-time Warnings<P> %s </TD></TD> </TABLE>
da: <TABLE BORDER=1 CELLPADDING=4> <TR><TD><P ALIGN=CENTER>Design-tidspunkt advarsler<P> %s </TD></TD> </TABLE>

source: Invalid Web component creation
da: Ugyldig webkomponent oprettelse
ru: Неверное создание Web компонента

source: ApplyUpdates error. Error count: %d.
da: ApplyUpdates fejl. Fejlantal: %d.
ru: Ошибка ApplyUpdates. Номер ошибки: %d.

source: Missing Delta Packet
da: Mangler Delta pakken
ru: Не указан Delta Packet

source: XMLBroker: %s is not connected
da: XMLBroker: %s er ikke forbundet
ru: XMLBroker: %s не подключен

source: DataSet: %s is not active
da: Datasæt: %s er ikke aktiv
ru: %0:s: Dataset %1:s не активен

source: Error decoding URL style (%%XX) encoded string at position %d
da: Fejl ved dekodning af URL type (%%XX) kodet tekst ved position %d
ru: Ошибка расшифровки стиля URL (%%XX), закодированного строкой, в позиции %d

source: Invalid URL encoded character (%s) at position %d
da: Ugyldigt URL kodet tegn (%s) ved position %d
ru: Неверный закодированный символ URL (%s) в позиции %d

source: Invalid HTML encoded character (%s) at position %d
da: Ugyldigt HTML kodet tegn (%s) ved position %d
ru: Неверный закодированный символ HTML (%s) в позиции %d

source: Duplicate action name
da: Dubleret handlingsnavn
ru: Дубликат имени action

source: Web Module Factory already registered
da: Web Module Factory allerede registreret
ru: Web Module Factory уже зарегистрирована

source: Web App Module Factory already registered.
da: Web App Module Factory allerede registreret.
ru: Web App Module Factory уже зарегистрирована.

source: Only one WebDispatcher per form/data module
da: Kun en WebDispatcher per formular/datamodul
ru: Только один WebDispatcher на формы/модуля данных

source: Enabled
da: Slået til

source: Producer
da: Producent

source: Resource %s not found
da: Resource %s ikke fundet
ru: Ресурс %s не найден

source: Too many table columns
da: For mange tabelkolonner
ru: Таблица (Grid) не может содержать более 256 колонок

source: Field Name
da: Feltnavn
ru: Имя поля

source: Field Type
da: Felttype

source: Invalid Web component registration
da: Ugyldig webkomponent registrering
ru: Неверная регистрация Web компонента

source: Invalid Web component enumeration
da: Ugyldig webkomponent optælling
ru: Неверная нумерация Web компонента

source: Operation not supported. %s component does not support IGetWebComponentList
da: Handling er ikke understøttet. %s komponent understøtter ikke IGetWebComponentList
ru: Операция не поддерживается. Компонент %s не поддерживает IGetWebComponentList

source: Variable %s is not a container
da: Variablen %s er ikke en container
ru: Переменная %s - не контейнер

source: <html><body><h1>Internal Application Error</h1> <p>%0:s <p><hr width="100%%"><i>%1:s</i></body></html>
da: <html><body><h1>Intern programfejl</h1> <p>%0:s <p><hr width="100%%"><i>%1:s</i></body></html>
ru: <h1>Внутренняя ошибка приложения</h1> <p>%0:s <p><hr width="100%%"><i>%1:s</i>

source: Action does not provide response
da: Handling giver ikke noget svar
ru: Action не обеспечивает ответ

source: Action can't respone to unknown HTTP method
da: Handling can ikke svare på en ukendt HTTP metode
ru: Action не может ответить неизвестному HTTP методу

source: Action can't redirect to blank URL
da: Handling kan ikke viderestille til en tom URL
ru: Action не может нереадресовать на пустой URL

source: PortName
da: Portnavn
ru: </head><body><h1>Запрещено (403)</h1><P>Доступ запрещен</P>

source: address
da: adresse

source: Add
da: Tilføj

source: Remove
da: Fjern

source: Items Editor...
da: Elementredigeringsværktøj...

source: Samples
da: Eksempler

source: You must register events before queueing them
da: Du skal registrere hændelser før de kan sættes i kø
ru: Вы должны зарегистрировать события перед их запросом

source: Component is not connected to an open Database
da: Komponent er ikke forbundet til en åben database
ru: Компонент не подключен к открытой Database

source: ''%s'' is not connected to an InterBase database
da: ''%s'' er ikke forbundet til en InterBase database
ru: ''%s'' не подключен к базе данных InterBase

source: You cannot call CancelEvents from within an OnEventAlert handler
da: Du kan ikke kalde CancelEvents inde fra en OnEventAlert håndtering
ru: Не могу отменить события во время обработки

source: Invalid blank event added to EventAlerter events list
da: Ugyldig tom hændelse tilføjet til EventAlerter hændelseslisten
ru: Неверное пустое событие добавлено в список событий EventAlerter

source: You cannot call QueueEvents from within an OnEventAlert handler
da: Du kan ikke kalde QueueEvents inde fra en OnEventAlert håndtering
ru: Нельзя вызвать QueueEvents внутри OnEventAlert

source: You cannot Register or Unregister events from within an OnEventAlert handler
da: Du kan ikke bruge Register eller Unregister inde fra en OnEventAlert håndtering
ru: Нельзя вызвать Register или Unregister для событий внутри OnEventAlert

source: You can only register 15 events per EventAlerter
da: Du kan kun registrere 15 hændelser per EventAlerter
ru: Достигнут максимальный предел для событий

source: You must have Interbase installed to use this component
da: Du skal have Interbase installeret for at bruge denne komponent

source: Failed to lookup isc_que_events
da: Fejl ved opslag af isc_que_events

source: Failed to lookup isc_interprete
da: Fejl ved opslag af isc_interprete

source: Failed to lookup isc_free
da: Fejl ved opslag af isc_free

source: Failed to lookup isc_event_block
da: Fejl ved opslag af isc_event_block

source: Failed to lookup isc_event_counts
da: Fejl ved opslag af isc_event_counts

source: Failed to lookup isc_cancel_events
da: Fejl ved opslag af isc_cancel_events

source: Class not registered
da: Klassen er ikke registreret
ru: Класс не зарегистрирован

source: Interface %s not registered
da: Interfacet %s er ikke registreret
ru: Интерфейс %s не зарегистрирован

source: Unsupported SOAP encodingStyle %s
da: SOAP encodingStyle %s er ikke understøttet
ru: Неподдерживаемый SOAP encodingStyle %s

source: Invalid SOAP request
da: Ugyldig SOAP forespørgsel
ru: Неверный SOAP запрос

source: Invalid SOAP response
da: Ugyldigt SOAP svar
ru: Неверный SOAP ответ

source: Multiple body elements not supported
da: Flere kropselementer er ikke understøttet
ru: Не поддерживаются многочисленные элементы тела

source: Unsupported calling convention: %s
da: Kaldekonventionen %s er ikke understøttet
ru: Неподдерживаемое соглашение о вызовах: %s

source: Remote Method Call: unsupported calling convention %s for method %s on interface %s
da: Remote Method Call: Kaldekonventionen %s er ikke understøttet for metoden %s på interfacet %s
ru: Удаленный вызов метода: неподдерживаемое соглашение о вызовах %s для метода %s через интерфейс %s

source: No invokable class registered that implements interface %s of (soap action/path) %s
da: Der er ikke nogen fremkaldbar klasse registreret, som implementerer interfacet %s af (soap action/path) %s
ru: Нет зарегистрированного вызываемого класса для обеспечения интерфейса %s (soap action/path) %s

source: No interface registered for soap action '%s'
da: Ingen interface registreret for soap action '%s'
ru: Нет зарегистрированного интерфейса для soap action '%s'

source: No interface registered for URL '%s'
da: Intet interface registreret for URL '%s'
ru: Нет зарегистрированного интерфейса для URL '%s'

source: Remotable Type %s not registered
da: Remotable typen %s er ikke registreret
ru: Remotable Type %s не зарегистрирован

source: Type mismatch in parameter %s
da: Typefejl i parameteren %s
ru: Несовпадение типов в параметре %s

source: No method named '%s' is supported by interface '%s'
da: Ingen metode ved navn '%s' forfindes i interface '%s'
ru: Нет метода c именем '%s', поддерживаемого интерфейсом '%s'

source: Interface not registered, UUID = %s
da: Interface er ikke registreret, UUID = %s
ru: Интерфейс не зарегистрирован, UUID = %s

source: Interface has no RTTI, UUID = %s
da: Interface har ingen RTTI, UUID = %s
ru: Интерфейс не имеет RTTI, UUID = %s

source: No WSDL document associated with WSDLView
da: Intet WSDL dokument er associeret med WSDLView
ru: Нет WSDL документа, связанного с WSDLView

source: Invalid WSDL document '%s' - Please verify the location and content! Error: %s
da: Ugyldigt WSDL dokument '%s' - Kontroller venligst sted og indhold! Fejl: %s
ru: Неверный WSDL документ '%s' - Пожалуйста, проверьте размещение и содержание! Ошибка: %s

source: Empty document
da: Tomt dokument
ru: Пустой документ

source: No WSDL or URL property was set in the THTTPRIO component. You must set the WSDL or URL property before invoking the Web Service
da: Ingen WSDL eller URL egenskaber var sat i THTTPRIO komponenten. Du skal sætte WSDL eller URL egenskaberne før du kan starte webtjenesten
ru: Не установлены свойства WSDL или URL в компоненте THTTPRIO. Вы должны установить свойство WSDL или URL перед вызовом Web Service

source: Unable to retrieve the URL endpoint for Service/Port '%s'/'%s' from WSDL '%s'
da: Ude af stand til at hente URL slutpunktet for Service/Port '%s'/'%s' fra WSDL '%s'
ru: Не могу возвратить URL endpoint для Service/Port '%s'/'%s' из WSDL '%s'

source: Datatype of TypeKind: %s not supported as argument for remote invocation
da: Datatypen/Typekind: %s ikke understøttet som argument til en remote invocation
ru: Тип данных TypeKind: %s не поддерживается как аргумент для удаленного вызова

source: No matching Kylix type was found for type: URI = %s, Name = %s on Node %s
da: Ingen matchende Kylix type blev fundet for type: URI = %s, Name = %s på Node %s
ru: Cоответствующий Kylix тип не найден для типа: URI = %s, Name = %s on Node %s

source: Unknown SOAPAction %s
da: Ukendt SOAPAction %s
ru: Неизвестное SOAPAction %s

source: Classes that represent scalar types must descend from TRemotableXS, %s does not
da: Klasser, som repræsenterer skalare typer skal nedarves fra TRemotableXS, %s gør ikke det
ru: Классы, которые представляют скалярные типы, должны порождаться из TRemotable, а %s - нет

source: Conversion from class %s to SOAP is not supported - SOAP classes must derive from TRemotable
da: Konvertering fra klasse %s til SOAP er ikke understøttet - SOAP klasser skal nedarve fra TRemotable
ru: Преобразование из класса %s в SOAP не поддерживается

source: Internal error: data type kind %s not expected in this context
da: Intern fejl: datatype/datakind %s blev ikke forventet i denne kontekst
ru: Внутренняя ошибка: тип данных вида %s не ожидается в этом контексте

source: Received content of invalid Content-Type setting: %s - SOAP expects "text/xml"
da: Modtog indhold med ugyldig Content-Type indstilling: %s - SOAP forventer "text/xml"
ru: Получено неверное значение настройки Content-Type: %s - SOAP ожидает "text/xml"

source: Array Node: %s has too many elements
da: Array knudepunkt: %s har for mange elementer
ru: Узел массива: %s имеет слишком много элементов

source: DocumentElement %s:%s expected, %s:%s found
da: DocumentElement %s:%s forventet, men %s:%s fundet
ru: DocumentElement %s:%s ожидается, %s:%s найден

source: Too many parameters in method %s
da: For mange parametre i metode %s
ru: Слишком много параметров в методе %s

source: Array type expected. Node %s
da: Array type blev forventet. Knudepunkt %s
ru: Тип Массив ожидается. Узел %s

source: Class %s does not implement interface GUID %s
da: Klasse %s implementerer ikke interface GUID %s
ru: Класс %s не обеспечивает интерфейс GUID %s

source: Element of Array type %s has no RTTI
da: Element af arraytype %s har ingen RTTI
ru: Элемент массива типа %s не имеет RTTI

source: Invalid SOAP Response
da: Ugyldigt SOAP svar
ru: Неверный ответ

source: Invalid SOAP array specification
da: Ugyldig SOAP array specifikation
ru: Неверный спецификация массива SOAP

source: Cannot find node referenced by ID %s
da: Kan ikke finde knudepunkt, som blev referet til af ID %s
ru: Не могу найти узел по ссылке ID %s

source: Option not set to allow Native type to be set to NULL
da: Indstillingen til at tillade Native typen at være sat til nul, er ikke sat
ru: Опция не установлена для разрешения типу Native быть установленным в NULL

source: Only one FaultCode element allowed
da: Kun en FaultCode element er tilladt
ru: Допускается только один элемент FaultCode

source: Only one FaultString element allowed
da: Kun et FaultString element er tilladt
ru: Допускается только один элемент FaultString

source: Missing FaultString or FaultCode element
da: Mangler FaultString eller FaultCode element
ru: Отсутствует элемент FaultString или FaultCode

source: Invokable Class %s implements no interfaces
da: Den kørbare klasse %s implementerer ingen interfaces
ru: Invokable класс %s не обеспечивает интерфейсов

source: Type cannot be cast as Variant
da: Type kan ikke konverteres til Variant
ru: Тип не может быть приведен как Variant

source: varDate type not supported
da: varDate typen er ikke understøttet
ru: Тип varDate не поддерживается

source: varDispatch type not supported
da: varDispatch typen er ikke understøttet
ru: Тип varDispatch не поддерживается

source: varError type not supported
da: varError typen er ikke understøttet
ru: Тип varError не поддерживается

source: varVariant type not supported
da: varVariant typen er ikke understøttet
ru: Тип varVariant не поддерживается

source: Error Processing Header (%s)%s
da: Fejl ved håndtering af hovedsektion (%s)%s
ru: Ошибка выполнения заголовка %s

source: SOAP Response Packet: result element expected, received "%s"
da: SOAP Svarpakke: forventede result element, men modtog "%s"
ru: Ответный пакет SOAP: ожидается результирующий элемент, получено "%s"

source: Invalid Pointer
da: Ugyldig pointer
ru: Неверная операция с указателем

source: No Native to Message converter set
da: Ingen Native til Message konverterer er sat
ru: Не установлен конвертер из Native в Message

source: No Message processing node set
da: Intet meddelelseshåndteringsknudepunkt er sat
ru: Не установлен Message processing node

source: Soap header %s with attribute 'mustUnderstand' set to true was not handled
da: SOAP hovedsektionen %s med attributtet 'mustUnderstand' sat til sand blev ikke håndteret
ru: Заголовок Soap %s с атрибутом 'mustUnderstand' set to true was not handled

source: Interface %s has no RTTI
da: Interface %s har ingen RTTI
ru: Интерфейс %s не имеет RTTI

source: Parameter %s on Method %s of Interface %s has no RTTI
da: Parameter %s på metode %s fra interfacet %s har ingen RTTI
ru: Параметр %s метода %s интерфейса %s не имеет RTTI

source: Invalid date string: %s
da: Ugyldig dato: %s
ru: Неверная строка даты: %s

source: Invalid time string: %s
da: Ugyldigt tidspunkt: %s
ru: Неверная строка времени: %s

source: Invalid hour: %d
da: Ugyldigt timetal: %d
ru: Неверный час: %d

source: Invalid minute: %d
da: Ugyldigt minuttal: %d
ru: Неверная минута: %d

source: Invalid second: %d
da: Ugyldigt sekundtal: %d
ru: Неверная секунда: %d

source: Invalid second: %f
da: Ugyldigt sekundtal: %f
ru: Неверная секунда: %f

source: Invalid millisecond: %d
da: Ugyldigt millisekundtal: %d
ru: Неверная миллисекунда: %d

source: Invalid fractional second: %f
da: Ugyldig sekundbrøk: %f
ru: Неверная дробная секунда: %f

source: Invalid hour offset: %d
da: Ugyldig timetalsforskydning: %d
ru: Неверный сдвиг часа: %d

source: Invalid day: %d
da: Ugyldig dag: %d
ru: Неверный день: %d

source: Invalid month: %d
da: Ugyldig måned: %d
ru: Неверный месяц: %d

source: Invalid duration string: %s
da: Ugyldig varighedsangivelse: %s
ru: Неверная строка длительности: %s

source: Millisecond Values must be between 000 - 999
da: Millisekundværdier skal være mellem 000 og 999
ru: Значения миллисекунд должны быть между 000 - 999

source: Year portion of date too large for conversion
da: Årsdelen af dato er for stor til at blive konverteret
ru: Год даты слишком большой для преобразования

source: Hour Offset portion of time invalid
da: Timetalsforskydningen af tidspunktet er ugyldigt
ru: Сдвиг часа времени - неверный

source: Invalid decimal string: ''%s''
da: Ugyldigt tal ved indlæsning: "%s"
ru: Неверная decimal строка: ''%s''

source: Cannot convert empty string to TBcd value
da: Kan ikke konvertere tom tekst til TBcd værdi
ru: Не могу преобразовать пустую строку в TBcd значение

source: Cannot convert scientific notation to TBcd value
da: Kan ikke konvertere videnskabeligt noterede tal til TBcd værdi
ru: Не могу преобразовать научную запись числа в TBcd значение

source: Cannot convert NAN to TBcd value
da: Kan ikke konvertere NAN (Not a Number, Ikke et tal) til TBcd værdi
ru: Не могу преобразовать NAN в TBcd значение

source: Invalid Bcd Precision (%d) or Scale (%d)
da: Ugyldig Bcd præcision (%d) eller skalering (%d)
ru: Неверная Bcd точность (%d) или Scale (%d)

source: Cannot convert to TBcd: string has more than 64 digits: %s
da: Kan ikke konvertere til TBcd: tekst har mere end 64 cifre: %s
ru: Не могу преобразовать в TBcd: строка имеет больше чем 64 цифр: %s

source: %s is not a valid hex string
da: %s er ikke et gyldigt hexadecimalt tal
ru: %s - неверная шестнадцатиричная строка

source: Invalid HTTP Request: Length is 0
da: Ugyldig HTTP forespørgsel: Længden er 0
ru: Неверный HTTP запрос: длина равна 0

source: Invalid HTTP Response: Length is 0
da: Ugyldigt HTTP svar: Længden er 0
ru: Неверный HTTP ответ: длина равна 0

source: ByteBool, WordBool and LongBool cannot be exposed by WebServices. Please use 'Boolean'
da: ByteBool, WordBool og LongBool kan ikke offentliggøres med WebServices. Benyt venligst 'Boolean'
ru: ByteBool, WordBool и LongBool не могут быть exposed by WebServices. Пожалуйста, используйте 'Boolean'

source: WideString index out of bounds
da: WideString indeks overskrider rammerne
ru: Индекс WideString вышел за границы

source: Lists all the PortTypes published by this Service
da: Vis alle porttyper, som er publiceret af denne tjeneste

source: No service available for URL %s
da: Ingen tjeneste til rådighed for URL %s
ru: Нет доступного сервиса для URL %s

source: No interface is registered to handle URL %s
da: Ingen interface er registreret til at håndtere URL %s
ru: Нет зарегистрированного интерфейса для управления URL %s

source: No Class is regisgtered to implement interface %s
da: Ingen klasse er registreret som implementation af interface %s
ru: Нет зарегистрированного класса для обеспечения интерфейса %s

source: No URL was specified for 'GET'
da: Ingen URL var specificeret for 'GET'
ru: Нет URL, определенного для 'GET'

source: Invalid url '%s' - only supports 'http' and 'https' schemes
da: Ugyldig url '%s' - understøtter kun 'http' og 'https' former
ru: Неверный url '%s' - поддерживает только 'http' и 'https' схемы

source: No class registered for invokable interface %s
da: Ingen klasse registreret for kørbart interface %s
ru: Нет зарегистрированного класса для вызываемого интерфейса %s

source: No Dispatcher set
da: Ingen dispatcher er sat
ru: Нет установленного диспетчера

source: Method has no RTTI
da: Metode har ingen RTTI
ru: Метод не имеет RTTI

source: Unsuppported variant type %d
da: Varianttypen %d er ikke understøttet
ru: Неподдерживаемый вариантный тип

source: Invalid or Unknown Time Zone
da: Ugyldig eller ukendt tidszone
ru: Неверный или неизвестный часовой пояс

source: Unknown Error
da: Ukendt fejl
ru: Неизвестная ошибка

source: Error:
da: Fejl:
ru: Ошибка:

source: &nbsp;&nbsp;<span class="Tip">Link to WS-Inspection document of Services <a href="%s">here</a></span>
da: &nbsp;&nbsp;<span class="Tip">Reference til WS-inspektion dokumention om Services <a href="%s">her</a></span>
ru: &nbsp;&nbsp;<span class="Tip">Ссылка на WS-Inspection документ of Services <a href="%s">here</a></span>

source: Registered Types
da: Kun registrerede typer
ru: Зарегистрированные типы

source: WebService Listing
da: WebService listning

source: Documentation
da: Dokumentation
ru: Документация

source: </head><body><h1>Error Encountered</h1><P>Interface %s not found</P></body></html>
da: </head><body><h1>Fejl fundet</h1><P>Interface %s findes ikke</P></body></html>

source: </head><body><h1>Forbidden (403)</h1><P>Access Forbidden</P></body></html>
da: </head><body><h1>Forbudt (403)</h1><P>Adgang forbudt</P></body></html>

source: WSDL Ports for PortType
da: WSDL porte for PortType
ru: WSDL порты для PortType

source: TAggregateStream Error: no internal streams
da: TAggregateStream fejl: Ingen interne strømme
ru: Ошибка TAggregateStream: нет внутренних потоков

source: method not supported
da: metode er ikke understøttet
ru: метод не поддерживается

source: Method not permitted in TSoapDataList
da: Metode er ikke tilladt i TSoapDataList
ru: Метод неразрешен в TSoapDataList

source: Content-Length header not found
da: Content-Length hovedsektion blev ikke fundet
ru: Заголовок Content-Length не найден

source: Insufficient data for Content-Length
da: Mangler data til Content-Length
ru: Неполные данные для Content-Length

source: Error reading from Mime Request Stream
da: Fejl ved læsning fra Mime forespørgselsstrøm
ru: Ошибка чтения из Mime Request Stream

source: No access to temporary file
da: Ingen adgang til midlertidig fil
ru: Нет доступа к временному файлу

source: No access to temporary file: check TMPDIR setting
da: Ingen adgang til midlertidig fil: kontroller TMPDIR indstilling
ru: Нет доступа к временному файлу

source: No URL property set - please specify the URL of the Service you wish to connect to
da: Ingen URL egenskab angivet - angiv venligst URL for den tjeneste, som du vil forbinde dig til
ru: Не установлено свойство URL - пожалуйста, укажите URL Сервиса, к которому Вы хотите подключиться

source: Interface (%s) is not registered - please include the unit that registers this interface to your project
da: Interface (%s) er ikke registreret - inkluder venligst den unit, som registrerer dette interface, i dit projekt
ru: Интерфейс (%s) не зарегестрирован - пожалуйста, включите в Ваш проект модуль, который регистрирует этот интерфейс

source: Interface (%s) canno be remoted - please verify the interface declaration - specially the methods calling convention!
da: Interface (%s) kan ikke remotes - kontroller venligst interfacedeklarationen, især metodekaldekonventionen
ru: Интерфейс (%s) не может быть удаленным - пожалуйста, проверьте объявление интерфейса - особенно соглашение о вызовах методов!

source: Unable to load WSDL File/Location: %s. Error [%s]
da: Ude af stand til at indlæse WSDL fil/sted: %s. Fejl [%s]
ru: Не могу загрузить WSDL Файл/Размещение: %s. Ошибка [%s]

source: Html files (*.htm *.html)|*.htm;*.html
da: Html filer (*.htm *.html)|*.htm;*.html

source: Html files (*.htm;*.html)|*.htm;*.html
da: Html filer (*.htm;*.html)|*.htm;*.html

source: line
da: linje
ru: строка

source: lines
da: linjer
ru: строк

source: Invalid graphic format
da: Ugyldigt grafikformat
ru: Формат '%s' - неверный или несовместимый с аргументом

source: Unable to locate form/component, '%s'
da: Ude af stand til at finde formular/komponent, '%s'
ru: Не могу найти форму/компонент, '%s'

source: Unable to locate property '%s' on component '%s'
da: Ude af stand til at finde egenskab '%s' på komponent '%s'
ru: Не могу найти свойство '%s' у компонента '%s'

source: Property '%s' has not been initialized on component '%s'
da: Egenskab '%s' er ikke blevet initialiseret på komponent '%s'
ru: Свойство '%s' не проинициализировано у компонента '%s'

source: Load Picture
da: Indlæs billede
ru: Загрузить картинку
