Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/delphi7.po
Languages: da, ru

source: Invalid DOMString size
da: Ugyldig DOMString størrelse
ru: Неверный размер DOMString

source: Cannot insert child node
da: Kan ikke indsætte barneknudepunkt
ru: Не могу вставить дочерний узел

source: Node is owned by a different document
da: Knudepunkt er ejet af et andet dokument
ru: Узлом владеет другой документ

source: Invalid character in name
da: Ugyldigt tegn i navn
ru: Неверный символ в имени

source: No data allowed
da: Data er ikke tilladt her

source: No modification allowed (readonly data)
da: Ændringer er ikke tilladt (skrivebeskyttede data)
ru: Изменения не допустимы (данные только для чтения)

source: Node not found
da: Knudepunkt blev ikke fundet
ru: Узел не найден

source: Not supported
da: Ikke understøttet
ru: Не поддерживается

source: Attribute already associated with another element
da: Attributer allerede tilknyttet et andet element
ru: Атрибут уже связан с другим элементом

source: Invalid state
da: Ugyldig tilstand
ru: Неверное состояние

source: Invalid syntax
da: Ugyldig syntaks
ru: Неверный синтаксис

source: Invalid modification
da: Ugyldig modifikatio

source: Invalid namespace request
da: Ugyldig namespace forespørgsel
ru: Неверный запрос namespace

source: Invalid access
da: Ugyldig adgang

source: TransformNode most be called using a document node (not a document element) for the source and the stylesheet.
da: TransformNode skal kaldes ved hjælp af et dokument knudepunkt (ikke et dokument element) for kilden og stylesheetet.
ru: TransformNode должен быть вызван, используя узел документа (не элемент документа) для источника и stylesheet.

source: Error creating file "%s"
da: Fejl ved oprettelse af fil "%s"
ru: Ошибка создания файла "%s"

source: Unhandled Xerces DOM error (no message available): %d
da: Uhåndteret Xerces DOM fejl (ingen meddelelse til rådighed): %d
ru: Unhandled Xerces DOM ошибка (сообщение не доступно): %d

source: DOM Error:
da: DOM fejl:
ru: Ошибка DOM:

source: Error loading library "%s": "%s"
da: Fejl ved indlæsning af bibliotek "%s": "%s"
ru: Ошибка загрузки библиотеки "%s": "%s"

source: No active document
da: Intet aktivt dokument
ru: Нет активного документа

source: Node "%s" not found
da: Knudepunktet "%s" blev ikke fundet
ru: Узел "%s" не найден

source: IDOMNode required
da: IDOMNode krævet
ru: IDOMNode требуется

source: Attributes are not supported on this node type
da: Attributter er ikke understøttet på denne knudepunktstype
ru: Атрибуты не поддерживаются на этом типе узла

source: Invalid node type
da: Ugyldig knudepunktstype
ru: Неверный тип узла

source: Mismatched paramaters to RegisterChildNodes
da: Parametrene til RegisterChildNodes passer ikke
ru: Несовпадающие параметры к RegisterChildNodes

source: Element does not contain a single text node
da: Element indeholder ikke et enkelt tekstknudepunkt
ru: Элемент не содержит единственный текстовый узел

source: DOM Implementation does not support IDOMParseOptions
da: DOM implementation udnerstøtter ikke IDOMParseOptions
ru: Реализация DOM не поддерживает IDOMParseOptions

source: Invalid operation on a hosted node
da: Ugyldig handling på et hostet knudepunkt
ru: Неверная операция на hosted узле

source: ItemTag property is not initialized
da: ItemTag egenskab er ikke initialiseret
ru: Свойство ItemTag не инициализировано

source: Node is readonly
da: Knudepunkt er skrivebeskyttet
ru: Узел только для чтения

source: Unsupported character encoding "%s", try using LoadFromFile
da: Tegnsætkodningen "%s" er ikke understøttet, prøv at bruge LoadFromFile
ru: Кодирование неподдерживаемого символа "%s", повторите с использованием LoadFromFile

source: Refresh is only supported if the FileName or XML properties are set
da: Genindlæs er kun understøttet hvis FileName eller XML egenskaber er sat
ru: Refresh поддерживается только, если установлены свойства FileName или XML

source: FileName cannot be blank
da: FileName kan ikke være tomt
ru: FileName не может быть пустым

source: Line
da: Linje

source: Invalid or unsupported XML Schema document
da: Ugyldigt eller ikke understøttet XMl skema dokument
ru: Неверный или неподдерживаемый документ XML Schema

source: Local type declarations cannot have a name. Element: %s
da: Lokal typedeklaration kan ikke have et navn. Element: %s
ru: Объявления локального типа не могут иметь имя. Элемент: %s

source: Unknown datatype "%s"
da: Ukendt datatype "%s"
ru: Неизвестный тип данных "%s"

source: Invalid %s value: "%s"
da: Ugyldig %s værdi: "%s"
ru: Неверное %s значение: "%s"

source: Invalid group declaration in "%s"
da: Igyldig gruppedeklaration i "%s"
ru: Неверное group объявление в "%s"

source: Missing Type name
da: Mangler typenavn
ru: Потеряно имя типа

source: Invalid complex type derivation: %s
da: Ugyldig komplex type afledning: %s
ru: Неверное решение комплексного типа: %s

source: Name not allowed on a ref item
da: Navn ikke tilladt på et referenceelement
ru: Имя не допускается на ref item

source: Global scheam items may not contain a ref
da: Globale skemaelementer må ikke indeholde referencer
ru: Пункты глобальной схемы не могут содержать ref

source: %s cannot be set on a ref item
da: %s kan ikke være sat på et referenceelement
ru: %s не может быть установлено на ref item

source: Set the GroupRef property for the cmGroupRef content model
da: Sæt GroupRef egenskaben for cmGroupRef indholdsmodellen
ru: Установить свойство GroupRef для cmGroupRef content model

source: ContentModel not set
da: ContentModel er ikke angivet
ru: ContentModel не установлена

source: Facets and Enumeration not allowed on this kind of datatype "%s"
da: Facetter og optælling er ikke tilladt på denne art datatype "%s"
ru: Facets и Enumeration не допустимы на этом типе данных "%s"

source: Invalid built-in type name "%s"
da: Ugyldigt indbygget typenavn "%s"
ru: Неверное имя встроенного типа "%s"

source: Built-in Type
da: Indbygget type
ru: Встроенный тип

source: XMLData to XML Schema Translator (.xml -> .xsd)
da: XMLData til XML skema oversætter (.xml -> .xsd)
ru: Транслятор XMLData в XML Schema (.xml -> .xsd)

source: 1999 XML Schema Translator (.xsd <-> .xsd)
da: 1999 XML skema oversætter (.xsd <-> .xsd)
ru: Транслятор 1999 XML Schema (.xsd <-> .xsd)

source: DTD to XML Schema Translator (.dtd <-> .xsd)
da: DTD til XML skema oversætter (.dtd <-> .xsd)
ru: Транслятор DTD в XML Schema (.dtd <-> .xsd)

source: XDR to XML Schema Translator (.xdr <-> .xsd)
da: XDR til XML skema oversætter (.xdr <-> .xsd)
ru: Транслятор XDR в XML Schema (.xdr <-> .xsd)

source: Error creating system registry entry
da: Fejl ved oprettelse af element i registreringsdatabasen
ru: Ошибка создания ключа (entry) системного реестра

source: Object factory for class %s missing
da: Objektfabrikken for %s klassen mangler
ru: Object factory для класса %s потеряна

source: Type information missing for class %s
da: Typeinformation mangler for klassen %s
ru: Информация о типе потеряна для класса %s

source: Incorrect type information for class %s
da: Typeinformationen for klasse %s er forkert
ru: Неверная информация о типе для класса %s

source: Dispatch interface missing from class %s
da: Dispatch interfacet mangler for klassen %s
ru: Dispatch interface потерян для класса %s

source: Method '%s' not supported by automation object
da: Metoden '%s' er ikke understøttet af automationsobjektet
ru: Метод '%s' не поддерживается automation объектом

source: Dispatch methods do not support more than 64 parameters
da: Dispatch metoderne understøtter ikke mere end 64 parametre
ru: Dispatch методы не поддерживают более 64 параметров

source: DCOM not installed
da: DCOM er ikke installeret
ru: DCOM не установлен

source: DAX Error
da: DAX fejl
ru: Ошибка DAX

source: COM Server Warning
da: COM vært advarsel
ru: Предупреждение COM Сервера

source: There are still active COM objects in this application. One or more clients may have references to these objects, so manually closing
da: Der er stadigvæk aktive COM objekter i dette program. En eller flere klienter kan have reference til disse objekter, så en manuel lukning
ru: В приложении имеются активные COM объекты. Один или более клиентов могут ссылаться на эти объекты, таким образом, закрытие

source: this application may cause those client application(s) to fail. Are you sure you want to close this application?
da: kan medføre at disse klientprogrammer fejler. 'Er du sikker på, at du ønsker at lukke dette program?
ru: приложения может вызвать сбой клиентских приложений. Вы уверены, что хотите закрыть это приложение?

source: Unable to find a Table of Contents
da: Ude af stand til at finde indholdsfortegnelsen
ru: Содержание не найдено.

source: No help found for %s
da: Ingen hjælp fundet for %s
ru: Не найдено справки для "%s"

source: No context-sensitive help installed
da: Ingen kontekst-sensitiv hjælp er installeret
ru: Контекстно-зависимая Справка не установлена.

source: No topic-based help system installed
da: Ingen emne-baseret hjælpesystem er installeret
ru: Справка на основе тем (topic) не установлена.

source: Method %s of class %s not found
da: Metode %s af klassen %s blev ikke fundet
ru: Метод %s не найден

source: Type mismatch in parameter %d for method %s
da: Typen passer ikke i parameteren %d for metoden %s

source: Invalid DispID for parameter %d in method %s
da: Ugyldig DispID for parameteren %d i metoden %s

source: Parameter %d required for method %s
da: Parameter %d krævet for metode %s

source: Method definition for %s has over %d parameters
da: Metodedefinitionen for %s har over %d parametre

source: Too many parameters for method %s
da: For mange parametre for metoden %s
ru: Dispatch методы не поддерживают более 64 параметров

source: Ancestor for '%s' not found
da: Forfaderen for '%s' blev ikke fundet
ru: Предок для '%s' не найден

source: Cannot assign a %s to a %s
da: Kan ikke tildele en %s til en %s
ru: Не могу значение %s присвоить %s

source: List is locked during an active ForEach
da: Listen er låst mens der er en aktiv ForEach
ru: Список заблокирован при активном ForEach

source: ''%s'' expected
da: Forventede ''%s''
ru: Ожидается ''%s''

source: CheckSynchronize called from thread $%x, which is NOT the main thread
da: CheckSynchronize blev kaldet fra tråden $%x, som IKKE er hovedtråden
ru: CheckSynchronize вызван из потока (thread) $%x, который НЕ является основным потоком

source: Class %s not found
da: Klassen %s blev ikke fundet
ru: Класс %s не найден

source: Delimiter and QuoteChar properties cannot have the same value
da: Delimiter og QuoteChar egenskaberne kan ikke have den samme værdi
ru: Свойства Delimiter и QuoteChar не могут иметь одно и то же значение

source: A class named %s already exists
da: En klasse ved navn %s findes allerede
ru: Класс с именем %s уже существует

source: A component named %s already exists
da: En komponent ved navn %s findes allerede
ru: Компонент с именем %s уже существует

source: String list does not allow duplicates
da: tekstlisten tillader ikke dubletter
ru: Список строк не допускает дубликатов

source: Cannot create file "%s". %s
da: Kan ikke oprette fil "%s". %s
ru: Не могу создать файл "%s". %s

source: Cannot open file %s
da: Kan ikke oprette fil %s
ru: Не могу открыть файл %s

source: Cannot open file "%s". %s
da: Kan ikke åbne fil "%s". %s
ru: Не могу открыть файл "%s". %s

source: Identifier expected
da: Forventede et navn (identifier)
ru: Ожидается идентификатор

source: Invalid binary value
da: Ugyldig binær værdi
ru: Неверное двоичное значение

source: Invalid file name - %s
da: Ugyldigt filnavn - %s
ru: Неверное имя файла - %s

source: '%s' is an invalid mask at (%d)
da: '%s' er en ugyldig maske ved (%d)
ru: '%s' - неверная маска в позиции %d

source: ''%s'' is not a valid component name
da: ''%s'' er ikke et gyldigt komponentnavn
ru: ''%s'' недопустимо в качестве имени компонента

source: Invalid property value
da: Ugyldigt egenskabsværdi
ru: Неверное значение свойства

source: Invalid property element: %s
da: Ugyldigt egenskabselement: %s
ru: Неверный элемент свойства: %s

source: Invalid property path
da: Ugyldigt egenskabssti
ru: Неверный путь к свойству

source: Invalid property type: %s
da: Ugyldigt egenskabstype: %s
ru: Неверный тип свойства: %s

source: Invalid string constant
da: Ugyldig tekstværdi
ru: Неверная строковая константа

source: Item not found ($0%x)
da: Element blev ikke fundet ($0%x)
ru: Пункт не найден ($0%x)

source: List capacity out of bounds (%d)
da: Listekapaciteten er for stor (%d)
ru: Размер списка вышел за границы (%d)

source: List count out of bounds (%d)
da: Listeantallet er ude for gyldigt talområde (%d)
ru: Счетчик списка вышел за границы (%d)

source: List index out of bounds (%d)
da: Listeindeks er uden for gyldigt talområde (%d)
ru: Индекс списка вышел за границы (%d)

source: Out of memory while expanding memory stream
da: Hukommelsesmangel opstod ved udpakning af hukommelsesstrøm
ru: Не хватает памяти при расширении memory stream

source: %s has not been registered as a COM class
da: %s er ikke blevet registreret som en COM klasse
ru: %s не зарегистрирован как COM класс

source: Number expected
da: Forventede et tal
ru: Ожидается число

source: %s on line %d
da: %s på linje %d
ru: %s в строке %d

source: Component name '%s' exceeds 64 character limit
da: Komponentnavnet '%s' er over 64 tegn langt
ru: Имя компонента '%s' превысило предел в 64 символов

source: Error reading %s%s%s: %s
da: Fejl ved læsning af %s%s%s: %s
ru: Ошибка чтения %s%s%s: %s

source: Stream read error
da: Strømlæsningsfejl
ru: Ошибка чтения потока

source: Property is read-only
da: Egenskaben er skrivebeskyttet
ru: Свойство только для чтения

source: Failed to create key %s
da: Oprettelse af nøgle %s fejlede
ru: Ошибка создания ключа %s

source: Failed to get data for '%s'
da: Datahenting for '%s' fejlede
ru: Ошибка чтения значения для '%s'

source: Invalid component registration
da: Ugyldig komponentregistrering
ru: Неверная регистрация компонента

source: Failed to set data for '%s'
da: Fejlede ved skrivning til registreringsdatabasen for '%s'
ru: Ошибка записи значения для '%s'

source: %s.Seek not implemented
da: %s.Seek er ikke implementeret
ru: %s.Seek не выполнено

source: Operation not allowed on sorted list
da: Handling er ikke tilladt på en sorteret liste
ru: Операция недопустима для отсортированного списка строк

source: String expected
da: Forventede tekst
ru: Ожидается строка

source: %s expected
da: Forventede %s
ru: Ожидается %s

source: %s not in a class registration group
da: %s er ikke i en klasseregistreringsgruppe
ru: %s нет в группе регистрации класса

source: Property %s does not exist
da: Egenskaben %s findes ikke
ru: Свойство не существует

source: Stream write error
da: Strømskrivningsfejl
ru: Ошибка записи потока

source: Error setting stream size
da: Fejl ved sætning af strømstørrelse
ru: Ошибка установки размера потока (stream size)

source: Thread creation error: %s
da: Trådoprettelsesfejl: %s
ru: Ошибка создания потока (thread): %s

source: Thread Error: %s (%d)
da: Trådfejl: %s (%d)
ru: Ошибка потока (thread): %s (%d)

source: (%d, %d) is not a valid DateDay pair
da: (%d, %d) er ikke et gyldigt DatoDag par
ru: (%d, %d) - неверная пара DateDay

source: (%d, %d, %d) is not a valid DateWeek triplet
da: (%d, %d, %d) er ikke en gyldig DatoUge triplet
ru: (%d, %d, %d) - неверное сочетание DateWeek

source: (%d, %d, %d, %d) is not a valid DateMonthWeek quad
da: (%d, %d, %d, %d) er ikke en gyldig DatoMåneduge firling
ru: (%d, %d, %d, %d) - неверное сочетание DateMonthWeek

source: (%d, %d, %d, %d) is not a valid DayOfWeekInMonth quad
da: (%d, %d, %d, %d) er ikke en gyldig DayOfWeekInMonth firling
ru: (%d, %d, %d, %d) - неверное сочетание DayOfWeekInMonth

source: %f Julian cannot be represented as a DateTime
da: %f Julian kan ikke repræsenteres som en DateTime
ru: %f Julian не может быть представлена как DateTime

source: Incompatible conversion types [%s, %s]
da: Inkompatible konverteringstyper [%s, %s]
ru: Несовместимые типы преобразования [%s, %s]

source: Incompatible conversion types [%s, %s, %s]
da: Inkompatible konverteringstyper [%s, %s, %s]
ru: Несовместимые типы преобразования [%s, %s, %s]

source: Incompatible conversion types [%s - %s, %s - %s]
da: Inkompatible konverteringstyper [%s - %s, %s - %s]
ru: Несовместимые типы преобразования [%s - %s, %s - %s]

source: Unknown conversion type %s
da: Ukendt konverteringstype %s
ru: Неизвестный тип преобразования %s

source: Conversion type (%s) already registered in %s
da: Konverteringstype (%s) er allerede registreret i %s
ru: Тип преобразования (%s) уже зарегистрирован

source: Unknown conversion family %s
da: Ukendt konverteringsfamilie %s
ru: Неизвестное семейство преобразования %s

source: Conversion family (%s) already registered
da: Konverteringsfamilie (%s) er allerede registreret
ru: Семейство преобразования (%s) уже зарегистрировано

source: Illegal family
da: Illegal familie
ru: Недопустимое семейство

source: %s has a factor of zero
da: %s har en faktor nul
ru: %s имеет нулевой множитель

source: Could not parse %s
da: Kunne ikke tyde %s
ru: Не могу разобрать %s

source: TStrings descendant %s failed to call inherited constructor
da: TStrings nedarvning %s fejlede da den kaldte den nedarvede constructor
ru: Потомок TStrings %s вызвал ошибку при вызове inherited constructor

source: Windows socket error: %s (%d), on API '%s'
da: Windows socket fejl: %s (%d), på API '%s'
ru: Ошибка Windows socket: %s (%d), при вызове '%s'

source: Asynchronous socket error %d
da: Asynkron socketfejl %d
ru: Ошибка asynchronous socket %d

source: No address specified
da: Ingen adresse angivet
ru: Не определен адрес

source: Can't listen on an open socket
da: Kan ikke lytte til en åben socket
ru: Не могу прослушивать открытый socket

source: Can't create new socket
da: Kan ikke oprette ny socket
ru: Не могу создать новый socket

source: Socket already open
da: Socket er allerede åben
ru: Socket уже открыт

source: Can't change value while socket is active
da: Kan ikke ændre værdi mens socket er aktiv
ru: Не могу изменить значение пока socket активен

source: Socket must be in blocking mode
da: Socket skal være i blokerende tilstand
ru: Socket должен быть в режиме блокировки

source: %s error %d, %s
da: %s fejl %d, %s
ru: %s ошибка %d, %s

source: Read
da: Læsning

source: Write
da: Skriv

source: Could not parse imaginary portion
da: Kunne ikke tyde den imaginære del
ru: Не могу распознать мнимую часть

source: Could not parse required '%s' symbol
da: Kunne ikke tyde '%s' symbolet
ru: Не могу распознать требуемый '%s' символ

source: Could not parse required '+' (or '-') symbol
da: Kunne ikke tyde det krævede '+' (eller '-') symbol
ru: Не могу распознать требуемый '+' (или '-') символ

source: Could not parse real portion
da: Kan ikke tyde reel del
ru: Не могу распознать действительную часть

source: Unexpected end of string [%s]
da: Uventet afslutning på tekst [%s]
ru: Неожиданный конец строки [%s]

source: Unexpected characters
da: Uventede tegn
ru: Неожиданные символы

source: No Help Manager installed.
da: Ingen hjælpemanger er installeret.
ru: Менеджер Справки не установлен.

source: No topic-based Help installed.
da: Ingen emne-baseret hjælp er installeret.
ru: Справка на основе тем (topic) не установлена.

source: No context-sensitive Help installed.
da: Ingen kontekst-sensitiv hjælp er installeret.
ru: Контекстно-зависимая Справка не установлена.

source: No help found for "%s"
da: Ingen hjælp fundet for "%s"
ru: Не найдено справки для "%s"

source: No Table of Contents found.
da: Ingen indholdsfortegnelse fundet.
ru: Содержание не найдено.

source: Distance
da: Afstand
ru: Расстояние

source: Micromicrons
da: Mikromicron
ru: Микромикроны

source: Angstroms
da: Ångstrøm
ru: Ангстремы

source: Millimicrons
da: Millimicron
ru: Миллимикроны

source: Microns
da: Micron
ru: Микроны

source: Millimeters
da: Millimeter
ru: Миллиметры

source: Centimeters
da: Centimeter
ru: Сантиметры

source: Decimeters
da: Decimeter
ru: Дециметры

source: Meters
da: Meter
ru: Метры

source: Decameters
da: Dekameter
ru: Декаметры

source: Hectometers
da: Hektometer
ru: Гектометры

source: Kilometers
da: Kilometer
ru: Километры

source: Megameters
da: Megameter
ru: Мегаметры

source: Gigameters
da: Gigameter
ru: Гигаметры

source: Inches
da: Tommer
ru: Дюймы

source: Feet
da: Fod
ru: Футы

source: Yards
da: Yard
ru: Ярды

source: Miles
da: Mil
ru: Мили

source: NauticalMiles
da: Nautiske mil
ru: Морские мили

source: AstronomicalUnits
da: Astronomiske Enheder
ru: Астрономические единицы

source: LightYears
da: Lysår
ru: Световые годы

source: Parsecs
da: Parsec
ru: Парсеки

source: Hands
da: Hænder
ru: Руки

source: Links
da: Referencer
ru: Звенья землемерной цепи

source: Picas
da: Pica
ru: Пики (picas)

source: Points
da: Punkt
ru: Точки

source: Area
da: Areal
ru: Площадь

source: SquareMillimeters
da: Kvadratmillimeter
ru: Кв. миллиметры

source: SquareCentimeters
da: Kvadratcentimeter
ru: Кв. сантиметры

source: SquareDecimeters
da: Kvadratdecimeter
ru: Кв. дециметры

source: SquareMeters
da: Kvadratmeter
ru: Кв. метры

source: SquareDecameters
da: Kvadratdekameter
ru: Кв. декаметры

source: SquareHectometers
da: Kvadrathektometer
ru: Кв. гектометры

source: SquareKilometers
da: Kvadratkilometer
ru: Кв. километры

source: SquareInches
da: Kvadrattommer
ru: Кв. дюймы

source: SquareFeet
da: Kvadratfod
ru: Кв. футы

source: SquareYards
da: Kvadratyard
ru: Кв. ярды

source: SquareMiles
da: Kvadratmil
ru: Кв. мили

source: Hectares
da: Hektar
ru: Гектары

source: CubicMillimeters
da: Kubikmillimeter
ru: Куб. миллиметры

source: CubicCentimeters
da: Kubikcentimeter
ru: Куб. сантиметры

source: CubicDecimeters
da: Kubikdecimeter
ru: Куб. дециметры

source: CubicMeters
da: Kubikmeter
ru: Куб. метры

source: CubicDecameters
da: Kubikdekameter
ru: Куб. декаметры

source: CubicHectometers
da: Kubikhektometer
ru: Куб. гектометры

source: CubicKilometers
da: Kubikkilometer
ru: Куб. километры

source: CubicInches
da: Kubiktommer
ru: Куб. дюймы

source: CubicFeet
da: Kubikfod
ru: Куб. футы

source: CubicYards
da: Kubikyard
ru: Куб. ярды

source: CubicMiles
da: Kubikmil
ru: Куб. мили

source: MilliLiters
da: Milliliter
ru: Миллилитры

source: CentiLiters
da: Centiliter
ru: Сантилитры

source: DeciLiters
da: Deciliter
ru: Децилитры

source: Liters
da: Liter
ru: Литры

source: DecaLiters
da: Dekaliter
ru: Декалитры

source: HectoLiters
da: Hektoliter
ru: Гектолитры

source: KiloLiters
da: Kiloliter
ru: Килолитры

source: FluidOunces
da: Fl. ounces
ru: Унции жидкие

source: FluidTablespoons
da: Spsk.
ru: Столовые ложки

source: FluidTeaspoons
da: Tsk.
ru: Чайные ложки

source: Mass
da: Masse
ru: Масса

source: Nanograms
da: Nanogram
ru: Нанограммы

source: Micrograms
da: Mikrogram
ru: Микрограммы

source: Milligrams
da: Milligram
ru: Миллиграммы

source: Centigrams
da: Centigram
ru: Сантиграммы

source: Decigrams
da: Decigram
ru: Дециграммы

source: Grams
da: Gram
ru: Граммы

source: Decagrams
da: Dekagram
ru: Декаграммы

source: Hectograms
da: Hektogram
ru: Гектограммы

source: Kilograms
da: Kilogram
ru: Килограммы

source: MetricTons
da: Metriske tons
ru: Метр. тонны

source: Pounds
da: Pund
ru: Фунты

source: Stones
da: Sten
ru: Стоуны

source: Temperature
da: Temperatur
ru: Температура

source: MilliSeconds
da: Millisekunder
ru: Миллисекунды

source: Seconds
da: Sekunder
ru: Секунды

source: Minutes
da: Minutter
ru: Минуты

source: Hours
da: Timer
ru: Часы

source: Days
da: Dage
ru: Дни

source: Weeks
da: Uger
ru: Недели

source: Months
da: Måneder
ru: Месяца

source: Years
da: År
ru: Годы

source: Decades
da: Årtier
ru: Декады

source: Centuries
da: Århundreder
ru: Века

source: Millennia
da: Årtusinde
ru: Тысячелетия

source: DateTime
da: DatoKlokkeslet
ru: ДатаВремя

source: JulianDate
da: JulianskDato
ru: Юлианская дата
