Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/delphi7.po
Languages: da, ru

source: Save Picture As
da: Gem billede som
ru: Сохранить картинку как

source: About...
da: Om programmet...
ru: О...

source: No property pages are available for this control
da: Ingen egenskabssider til rådighed for denne kontrol
ru: Нет доступных страниц свойств для этого элемента управления

source: An About Box is not available for this control
da: Der er ikke noget "Om..." vindue for denne kontrol
ru: About Box не доступен для этого элемента управления

source: (Unassigned)
da: (Ikke tildelt)

source: Unknown Type
da: Ukendt type
ru: Неизвестный тип

source: Cannot create a method for an unnamed component
da: Kan ikke oprette en metode for en unavngivet komponent
ru: Не могу создать имя метода по умолчанию для безымянного компонента

source: Editing %s%s%s
da: Redigerer %s%s%s
ru: Изменение %s%s%s

source: Selection contains a component introduced in an ancestor form which cannot be deleted
da: Det valgte indeholder en komponent, som var introduceret i en forfader form, og som derfor ikke kan slettes
ru: Выбор содержит компонент, который применяется в форме-предке, которая не удалена

source: New components cannot be added to frame instances.
da: Nye komponenter kan ikke tilføjes til rammeinstanser.
ru: Новые компоненты не могут добавляться в образцы фреймов.

source: All Files (*)|*
da: Alle filer (*)|*
ru: Все файлы (*)

source: All Files (*.*)|*.*
da: Alle filer (*.*)|*.*
ru: Все файлы (*)

source: Class %s is not applicable to this module
da: Klasse %s er ikke anvendeligt med dette modul

source: (Not available)
da: (Ikke til rådighed)
ru: Недопустимо

source: Edit
da: Rediger

source: Delete
da: Slet

source: Control
da: Kontrol

source: Bring to Front
da: Hent frem foran

source: Send to Back
da: Flyt om bagerst

source: Drag, Drop and Docking
da: Træk, slip og dokning

source: Drag and Drop
da: Træk og slip
ru: Drag, Drop and Docking

source: Help and Hints
da: Hjælp og tips

source: Legacy
da: Arv

source: Linkage
da: Sammenkædning

source: Locale
da: Sprogvalg

source: Localizable
da: Oversættelig

source: Miscellaneous
da: Diverse

source: Visual
da: Visuel

source: Input
da: Inddata

source: Add item
da: Tilføj element

source: <Components[%d]>
da: <Komponenter[%d]>

source: %s ActionManager property has not been assigned
da: %s ActionManager egenskab er ikke blevet sat

source: Invalid Enum Value
da: Ugyldig optællingsværdi
ru: Неверное Enum значение

source: Missing Connection or ConnectionString
da: Mangler forbindelse eller forbindelsestekst
ru: Не указано Connection или ConnectionString

source: Filter property cannot be used for detail tables
da: Filteregenskab kan ikke bruges med detaljetabeller
ru: Свойство Filter не может использоваться для detail таблиц

source: Dataset does not support bookmarks, which are required for multi-record data controls
da: Datasæt understøtter ikke bogmærker, og disse er krævet for multi-post datakontroller
ru: Набор данных (Dataset) не поддерживает закладки (bookmarks), которые требуются для элементов, работающих с данными нескольких записей

source: Missing %s property
da: Mangler %s egenskab
ru: Не указано свойство %s

source: CommandText does not return a result set
da: CommandText returnerer ikke et resultatsæt
ru: CommandText не возвращает результат

source: Error creating object. Please verify that the Microsoft Data Access Components 2.1 (or later) have been properly installed
da: Fejl ved oprettelse af objekt. Kontroller venligst at Microsoft Data Access Components 2.1 (eller senere) er blevet installeret korrekt
ru: Ошибка создания объекта. Пожалуйста, проверьте, что Microsoft Data Access Components 2.1 (или выше) правильно установлены

source: Events are not supported with server side TableDirect cursors
da: Hændelser er ikke understøttet når der bruges værtsbaserede TableDirect cursors
ru: События не поддерживаются с TableDirect курсорами на серверной стороне

source: Unsupported field type (%s) in field %s
da: Felttype %s i felt %s er ikke understøttet
ru: Неподдерживаемый тип поля (%s) в поле %s

source: No matching ADO data type for %s
da: Ingen passende ADO datatype til %s
ru: Нет совпадающего типа данных ADO для %s

source: A connection component is required for async ExecuteOptions
da: En forbindelseskomponent er påkrævet for async ExecuteOptions
ru: Соединяющий компонент требуется для асинх. ExecuteOptions

source: Cannot perform a requery after connection has changed
da: Kan ikke udføre en genforespørgsel efter at forbindelsen er ændret
ru: Не могу выполнить запрос после изменения соединения

source: FilterOptions are not supported
da: FilterOptions er ikke understøttet
ru: FilterOptions не поддерживается

source: Recordset is not open
da: Recordset er ikke åben
ru: Recordset не открыт

source: Value
da: Værdi
ru: Значение

source: Cannot enable AutoSessionName property with more than one session on a form or data-module
da: Kan ikke slå AutoSessionName egenskabet til når der er mere end en session på en formular eller et datamodul
ru: Не могу включить свойство AutoSessionName при более чем одной сессии в форме или модуле данных

source: Cannot add a session to the form or data-module while session '%s' has AutoSessionName enabled
da: Kan ikke tilføje en session til formularen eller datamodulet mens sessionen '%s' har AutoSessionName slået til
ru: Не могу добавить сессию в форму или модуль данных, пока сессия '%s' имеет установленный AutoSession

source: Cannot modify SessionName while AutoSessionName is enabled
da: Kan ikke modificere Sessionname når AutoSessionName er slået til
ru: Не могу изменить SessionName, пока AutoSessionName включено

source: Duplicate database name '%s'
da: Dubleret databasenavn '%s'
ru: Дубликат имени базы данных '%s'

source: Duplicate session name '%s'
da: Dubleret sessionsnavn '%s'
ru: Дубликат имени сессии '%s'

source: Invalid session name %s
da: Ugyldigt sessionsnavn %s
ru: Неверное имя сессии %s

source: Database name missing
da: Databasenavnet mangler
ru: Не указано имя базы данных

source: Session name missing
da: Sessionsnavn mangler
ru: Отсутствует имя сессии

source: Cannot perform this operation on an open database
da: Kan ikke udføre denne handling på en åben database
ru: Не могу выполнить операцию -- БД открыта

source: Cannot perform this operation on a closed database
da: Kan ikke udføre denne handling på en lukket database
ru: Не могу выполнить операцию -- БД не открыта

source: Database handle owned by a different session
da: Databasehåndtaget er ejet af en anden session
ru: Дескриптором базы данных владеет другая сессия

source: Cannot perform this operation on an active session
da: Kan ikke udføre denne handling på en aktiv session
ru: Не могу выполнить эту операцию для активной сессии

source: Error creating cursor handle
da: Fejl ved oprettelse af cursorhåndtag
ru: Ошибка создания курсора

source: Cannot convert field '%s' to a floating point value
da: Kan ikke konvertere felt '%s' til en kommatalsværdi
ru: Не могу преобразовать поле '%s' в дробное значение

source: Cannot convert field '%s' to an integer value
da: Kan ikke konvertere felt '%s' til en heltalsværdi
ru: Не могу преобразовать поле '%s' в целое значение

source: Source and destination tables are incompatible
da: Kilde og destinationstabellerne er ikke kompatible
ru: Таблицы-источник и приемник несовместимы

source: Fields '%s' and '%s' are not assignment compatible
da: Felterne '%s' og '%s' er ikke kompatible mht. assign
ru: Поля '%s' и '%s' не совместимы для присваивания

source: ReferenceTableName not specified for field '%s'
da: ReferenceTableName er ikke specificeret for felt '%s'
ru: ReferenceTableName не определено для '%s'

source: Cannot use array of Field values with Expression Indices
da: Kan ikke bruge array of Felt værdier med udtryksindekser
ru: Не могу использовать массив значений полей с индексами-выражениями

source: Invalid batch move parameters
da: Ugyldige parametre til batch move
ru: Неверное пакетное перемещение (batch move)

source: No SQL statement available
da: Mangler SQL kommando
ru: Нет доступных SQL команд

source: No value for parameter '%s'
da: Ingen værdi for parameter '%s'
ru: Нет значения для параметра '%s'

source: No parameter type for parameter '%s'
da: Ingen parameter type for parameter '%s'
ru: Не задан тип параметра '%s'

source: Cannot connect to database '%s'
da: Kan ikke forbinde til database '%s'
ru: Не могу подключиться к базе данных '%s'

source: An error occurred while attempting to initialize the Borland Database Engine (error $%.4x)
da: En fejl optrådte under forsøget på at starte Borland Database Engine (fejl $%.4x)
ru: Ошибка инициализации Borland Database Engine (ошибка $%.4x)

source: Da&tabase Editor...
da: Database redigeringsværktøj
ru: Редактор &БД...

source: E&xplore
da: &Udforsk

source: '%s' cannot be opened
da: '%s' kan ikke åbnes
ru: Таблица '%s' не может быть открыта

source: The MasterSource property of '%s' must be linked to a DataSource
da: MasterSource egenskaben for '%s' skal være kædet sammen med en DataSource
ru: Свойство MasterSource '%s' должно быть связано с DataSource

source: Unable to open the MasterSource Table
da: Ude af stand til at åbne MasterSource tabellen
ru: Невозможно открыть таблицу из MasterSource

source: Define &Parameters...
da: Definer &parametre...
ru: &Определить параметры...

source: Database is currently connected. Disconnect and continue?
da: Databasen er opkoblet - ønsker du at afbryde og fortsætte?
ru: База данных сейчас подсоединена. Отсоединиться и продолжить?

source: BDE error $%.4x
da: BDE fejl $%.4x
ru: Ошибка BDE $%.4x

source: Unable to use duplicate DataSource and LookupSource
da: Ude af stand til at bruge dubleret DataSource og LookupSource
ru: Невозможно использовать дублированные DataSource и LookupSource

source: LookupSource must be connected to TTable component
da: LookupSource skal være forbundet til en TTable komponent
ru: LookupSource должен соединяться с компонентом TTable

source: %s must be the lookup table's active index
da: %s skal være det aktive indeks for opslagstabellen
ru: %s должно быть lookup table's активным индексом

source: Must have a valid field type selected
da: Skal have en gyldig felttype valgt
ru: Необходимо выбрать правильный тип поля

source: Parameter '%s' truncated on output
da: Parameter '%s' blev klippet ved visning
ru: Параметр '%s' усечен при выводе

source: Result
da: Resultat

source: %s%s%s Parameters
da: %s%s%s parametre
ru: %s%s%s Параметры

source: %s%s%s Index Files
da: %s%s%s indeksfiles
ru: %s%s%s Индексные файлы

source: Index does not exist. Index: %s
da: Indeks %s findes ikke.
ru: Индекс не существует. Индекс: %s

source: Missing TableName property
da: Mangler TableName egenskaben
ru: Отсутствует свойство TableName

source: Missing DataSetField property
da: Mangler DataSetField egenskaben
ru: Отсутствует свойство DataSetField

source: E&xecute
da: &Udfør
ru: &Выполнить

source: Not in cached update mode
da: Ikke i cached update tilstand
ru: Не в режиме cached update

source: Invalid alias name %s
da: Ugyldigt aliasnavn %s
ru: Неверное имя псевдонима (alias) %s

source: Cannot access field '%s' in a filter
da: Kan ikke få adgang til felt '%s' i et filter
ru: Не могу получить доступ к полю '%s' в фильтре

source: &UpdateSQL Editor...
da: &UpdateSQL redigeringsværktøj...
ru: &Редактор UpdateSQL...

source: No dataset association
da: Ingen datasæt association
ru: Свойство Data set не определено

source: Untitled Application
da: Program uden titel
ru: (Без имени)

source: Cannot update, %s is not owned by %s
da: Kan ikke odpatere, %s er ejet af %s
ru: Изменение неверной базы данных

source: Update failed
da: Opdatering fejlede
ru: Изменение (update) не выполнено

source: Must select at least one key field and one update field
da: Der skal vælges mindst et nøglefelt og et opdateringsfelt
ru: Необходимо выбрать хотя бы одно ключевое и одно изменяемое поле

source: Update SQL statements not generated, exit anyway?
da: Update SQL kommandoerne er ikke lavet endnu, afslut alligevel?
ru: Команда Update SQL не сгенерирована, выйти?

source: Unable to determine field names for %s
da: Ude af stand til at afgøre feltnavne for %s
ru: Не могу определить имена полей для %s

source: The transaction isolation level must be dirty read for local databases
da: Transaktionsisoleringsniveauet skal være dirty read for lokale databaser
ru: Уровень изоляции транзакции должен быть dirty read для локальных БД

source: Missing DataSet property
da: Mangler DataSet egenskaben
ru: Отсутствует свойство DataSet

source: No provider available
da: Ingen provider til rådighed
ru: Нет доступных провайдеров

source: Dataset is not a query
da: Dataset er ikke en forespørgsel
ru: Набор данных (Dataset) не является запросом

source: Failed to clear tab control
da: Kan ikke rydde fanebladskontrollen
ru: Не удалось очистить tab control

source: Failed to retrieve tab at index %d
da: Fejl ved hentning af tab ved indeks %d
ru: Не удалось восстановить страницу (tab) с индексом %d

source: Failed to get object at index %d
da: Fejl ved henting af objekt ved indeks %d
ru: Не удалось получить объект с индексом %d

source: Failed to set tab "%s" at index %d
da: Fejl ved sætning af tab "%s" ved indeks %d
ru: Не удалось установить страницу (tab) "%s" с индексом %d

source: Failed to set object at index %d
da: Fejl ved sætning af objekt ved indeks %d
ru: Не удалось установить объект с индексом %d

source: Invalid index
da: Ugyldigt indeks
ru: Неверный индекс

source: Unable to insert an item
da: Ude af stand til at indsætte et element
ru: Невозможно вставить элемент

source: Invalid owner
da: Ugyldig ejer
ru: Неверный владелец

source: Unable to create new column
da: Ude af stand til at oprette ny kolonne
ru: Невозможно создать новый столбец

source: Unable to create new item
da: Ude af stand til at oprette nyt element
ru: Невозможно создать новый элемент

source: RichEdit line insertion error
da: RichEdit linie indsætningsfejl
ru: Ошибка вставки строки в RichEdit

source: Failed to Load Stream
da: Fejl ved indlæsning af strøm
ru: Сбой при Load Stream

source: Failed to Save Stream
da: Fejl ved gemning af strøm
ru: Сбой при Save Stream

source: StatusBar cannot have more than 64 panels
da: StatusBar kan ikke have mere end 64 paneler
ru: StatusBar не может иметь более 64 панелей

source: Error assigning Hot-Key to %s. %s
da: Fejl ved tildeling af Hot-Key til %s. %s
ru: Ошибка назначения Hot-Key на %s. %s

source: Hot-Key is invalid
da: Hot-Key er ugyldig
ru: Неверный Hot-Key

source: Window is invalid or a child window
da: Vindue er ugyldigt eller et barnevindue
ru: Неверное или дочернее окно

source: Hot-Key is assigned to another window
da: Hot-Key er tildelt et andet vindue
ru: Hot-Key назначен на другое окно

source: %s is already associated with %s
da: %s er allerede associeret med %s
ru: %s уже связан с %s

source: This control requires version 4.70 or greater of COMCTL32.DLL
da: Denne kontrol kræver version 4.70 eller senere af COMCTL32.DLL
ru: Этот компонент требует COMCTL32.DLL версии 4.70 или выше

source: Date exceeds maximum of %s
da: Dato overskrider maksimum på %s
ru: Дата превысила максимум %s

source: Date is less than minimum of %s
da: Dato er mindre end minimum på %s
ru: Дата меньше, чем минимум %s

source: You must be in ShowCheckbox mode to set to this date
da: Du skal være i ShowCheckbox tilstand for at sætte denne dato
ru: Требуется режим ShowCheckbox для установки этой даты

source: Failed to set calendar date or time
da: Mislykket at sætte kalenderdato eller tidspunkt
ru: Ошибка при установке даты или времени в календаре

source: Failed to set maximum selection range
da: Fejl ved sætning af maksimum for udvalgsområde
ru: Ошибка при установке максимального диапазона выбора

source: Failed to set calendar min/max range
da: Fejl ved sætning af kalender min/maks område
ru: Ошибка при установке мин/макс диапазона календаря

source: Date range can only be used in multiselect mode
da: Datoområde kan kun sættes i multiselect tilstand
ru: Диапазон дат может использоваться только в режиме мультивыбора

source: Failed to set calendar selected range
da: Fejl ved sætning af kaldender udvalgsområde
ru: Ошибка при установке выбранного диапазона календаря

source: Can't write to a read-only resource stream
da: Kan ikke skrive til en skrivebeskyttet resource strøm
ru: Не могу записывать в поток ресурсов "только для чтения"

source: Metafile is not valid
da: Metafil er ikke gyldig
ru: Метафайл имеет неверный формат

source: Invalid image
da: Ugyldigt billede
ru: Неверный формат потока

source: Invalid operation on TOleGraphic
da: Ugyldig handling på TOleGraphic
ru: Неверная операция с TOleGraphic

source: Image dimensions do not match image list dimensions
da: Billedestørrelsen passer ikke med billedlistestørrelserne
ru: Размеры изображения не совпадают с размерами в image list

source: Invalid ImageList
da: Ugyldig ImageList
ru: Неверный ImageList

source: Failed to read ImageList data from stream
da: Fejl ved læsning af ImageList data fra strøm
ru: Ошибка чтения данных ImageList из потока

source: Failed to write ImageList data to stream
da: Fejl ved skrivning af ImageList data til strøm
ru: Ошибка записи данных ImageList в поток

source: Error creating window device context
da: Fejl ved oprettelse af vindue Device Context
ru: Ошибка создания контекста окна (window device context)

source: Client of TDrag not initialized
da: Klient for TDrag er ikke initialiseret
ru: Клиент TDrag не инициализирован

source: Error creating window class
da: Fejl ved oprettelse af vindueklasse
ru: Ошибка создания оконного класса

source: Error creating window
da: Fejl ved oprettelse af vindue
ru: Ошибка создания окна

source: Cannot focus a disabled or invisible window
da: Kan ikke fokusere et vindue, der er slået fra eller usynligt
ru: Не могу передать фокус ввода отключенному или невидимому окну

source: Control '%s' has no parent window
da: Kontrollen '%s' har intet forældervindue
ru: Элемент управления '%s' не имеет родительского окна

source: Printer is not currently printing
da: Printeren skriver ikke ud lige nu
ru: Принтер не находится сейчас в состоянии печати

source: Printing in progress
da: Udskriver
ru: Идет печать...

source: Cannot have more than one MDI form per application
da: Kan ikke have mere end en MDI formular per program
ru: Нельзя иметь более одной основной MDI формы в программе

source: Could not load CARDS.DLL
da: Kunne ikke indlæse CARDS.DLL
ru: Не могу загрузить CARDS.DLL

source: Duplicate CardId found
da: CardId dublet fundet
ru: Найден дубликат CardId

source: An error returned from DDE ($0%x)
da: Fejl returneret af DDE ($0%x)
ru: Возвращена ошибка DDE ($0%x)

source: DDE Error - conversation not established ($0%x)
da: DDE fejl - konversation blev ikke etableret ($0%x)
ru: Ошибка DDE - диалог не установлен ($0%x)

source: Error occurred when DDE ran out of memory ($0%x)
da: Fejl skete da DDE løb tør for hukommelse ($0%x)
ru: Ошибка - не хватает памяти для DDE ($0%x)

source: Unable to connect DDE conversation
da: Ude af stand til at etablere DDE konversation
ru: Не могу присоединить DDE диалог (conversation)

source: Cannot load older version of TShape
da: Kan ikke indlæse en ældre version af TShape
ru: Не могу загрузить старую версию TShape

source: Metafiles
da: Metafiler
ru: Метафайлы

source: Grid too large for operation
da: Gitteret er for stor til denne handling
ru: Таблица (Grid) слишком большая для работы

source: Too many rows or columns deleted
da: Slettet for mange rækker eller kolonner
ru: Удаляется слишком много строк или столбцов

source: Grid index out of range
da: Gitterindeks er uden for gyldigt område
ru: Индекс Grid вышел за границы

source: Fixed column count must be less than column count
da: FixedColumnCount skal være mindre end ColumnCount
ru: Число фиксированных столбцов должно быть меньше общего числа столбцов

source: Fixed row count must be less than row count
da: FixedRowCount skal være mindre end RowCount
ru: Число фиксированных строк должно быть меньше общего числа строк

source: Cannot insert or delete rows from grid
da: Kan ikke indsætte eller slette rækker i gitteret
ru: Не могу вставить или удалить строки из таблицы (grid)

source: Outline index not found
da: Outline indeks ikke fundet
ru: Индекс Outline не найден

source: Parent must be expanded
da: Forælder skal være klappet ud
ru: Родительский узел должен быть раскрыт

source: Invalid input value
da: Ugyldig inddataværdi
ru: Введено неверное значение

source: Invalid input value. Use escape key to abandon changes
da: Ugyldig inddata værdi. Brug escape tasten for at afbryde ændringer
ru: Введено неверное значение. Нажмите Esc для отмены изменений

source: Invalid outline index
da: Ugyldigt outline indeks
ru: Неверный индекс outline

source: Incorrect level assignment
da: Ukorrekt niveau tildeling
ru: Неверное определение уровня

source: Invalid selection
da: Ugyldig markering
ru: Неверный выбор

source: File load error
da: Filindlæsningsfejl
ru: Ошибка загрузки файла

source: Line too long
da: Linje for lang
ru: Строка слишком длинная

source: Maximum outline depth exceeded
da: Maksimum outline dybde overskredet
ru: Достигнута максимальная глубина outline

source: Invalid argument to date encode
da: Ugyldigt argument til dateencode
ru: Неверный аргумент для формирования даты

source: All files (*.*)|*.*
da: Alle filer (*.*)|*.*
ru: Все файлы (*.*)|*.*

source: : [ - no volume label - ]
da: : [ - ingen indholdsetiket - ]
ru: : [ - нет метки тома - ]

source: Color
da: Farve

source: Unable to write to %s
da: ude af stand til at skrive til %s
ru: Не могу записать в %s

source: Bits index out of range
da: Bitindeks ude for gyldigt talområde
ru: Индекс Bits вышел за границы

source: Invalid data type for '%s'
da: Ugyldig datatype for '%s'
ru: Неверный тип данных для '%s'

source: Unknown RichEdit conversion file extension (.%s)
da: Ukendt filendelse til RichEdit konvertering (.%s)
ru: Неизвестное расширение файла для конвертирования RichEdit (.%s)

source: Cannot open AVI
da: Kan ikke åbne AVI
ru: Не могу открыть AVI

source: No MCI device open
da: Ingen MCI enhed er åben
ru: Нет открытых устройств MCI

source: All files (*.*)|*.*|Wave files (*.wav)|*.wav|Midi files (*.mid)|*.mid|Video for Windows (*.avi)|*.avi
da: Alle filer (*.*)|*.*|Wave filer (*.wav)|*.wav|Midi filer (*.mid)|*.mid|Video for Windows (*.avi)|*.avi
ru: Все файлы (*.*)|*.*|Аудио файлы (*.wav)|*.wav|Midi файлы (*.mid)|*.mid|Видео для Windows (*.avi)|*.avi

source: Other
da: Andre

source: Unknown error code
da: Ukendt fejlkode
ru: Неизвестный код ошибки

source: Service failed on %s: %s
da: Tjeneste fejlede på %s: %s
ru: Сбой службы на %s: %s

source: execute
da: udfør
ru: &Выполнить

source: continue
da: fortsæt

source: interrogate
da: Udspørg

source: shutdown
da: luk ned

source: Service failed in custom message(%d): %s
da: Tjeneste fejlede i en speciel meddelelse (%d): %s
ru: Сбой службы в custom message(%d): %s

source: Service installed successfully
da: Det lykkedes at installere tjenesten
ru: Служба установлена успешно

source: Service "%s" failed to install with error: "%s"
da: Det lykkedes ikke at installere tjenesten "%s". Fejlen var: "%s"
ru: Сбой при установке службы "%s", ошибка: "%s"

source: Service uninstalled successfully
da: Det lykkedes at afinstallere tjenesten
ru: Служба снята успешно

source: Service "%s" failed to uninstall with error: "%s"
da: Det lykkedes ikke at afinstallere tjenesten "%s". Fejlmeddelelsen var: "%s"
ru: Сбой при снятии службы "%s", ошибка: "%s"

source: Invalid action registration
da: Ugyldig aktionsregistrering
ru: Неверная регистрация действия (action)

source: Invalid action unregistration
da: Ugyldig aktionsafregistrering
ru: Неверная отмена регистрации действия (action)
