Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/delphi7.po
Languages: da, ru

source: ModifiedJulianDate
da: ModificeretJulianskDato
ru: Измененая Юлианская дата

source: ''%s'' is not a valid date
da: ''%s'' er ikke en gyldig dato
ru: ''%s'' - неверная дата

source: ''%s'' is not a valid date and time
da: ''%s'' er ikke et gyldig dato og tidspunkt
ru: ''%s'' - неверные дата и время

source: ''%s'' is not a valid integer value
da: ''%s'' er ikke en gyldig heltalsværdi
ru: ''%s'' - неверное целое число

source: ''%s'' is not a valid time
da: ''%s'' er ikke et gyldigt klokkeslet
ru: ''%s'' - неверное время

source: Invalid argument to time encode
da: Ugyldigt argument til TimeEncode
ru: Неверный аргумент для формирования времени

source: ZLib error: target buffer may be too small
da: ZLib fejl: destinationsbuffer er måske for lille
ru: Ошибка ZLib: буфер приемника может быть слишком малым

source: Invalid stream operation
da: Ugyldig strømhandling
ru: Неверная операция с потоком

source: <unknown>
da: <ukendt>
ru: (Неизвестен)

source: '%s' is not a valid integer value
da: '%s' er ikke en gyldig heltalsværdi
ru: ''%s'' - неверное целое число

source: '%s' is not a valid floating point value
da: '%s' er ikke en gyldig kommatalsværdi
ru: '%s' - неверное дробное значение

source: '%s' is not a valid currency value
da: '%s' er ikke en gyldig valutaværdi
ru: '%s' - неверное денежное значение

source: '%s' is not a valid date
da: '%s' er ikke en gyldig dato
ru: ''%s'' - неверная дата

source: '%s' is not a valid time
da: '%s' er ikke et gyldigt klokkeslet
ru: ''%s'' - неверное время

source: '%s' is not a valid date and time
da: '%s' er ikke en gyldig dato og klokkeslet
ru: ''%s'' - неверные дата и время

source: '%g' is not a valid date and time
da: '%g' er ikke et gyldigt dato og klokkeslet
ru: '%g' - неверная дата и время

source: '%d.%d' is not a valid timestamp
da: '%d.%d' er ikke et gyldigt tidspunkt
ru: '%d.%d' - неверная дата и время (timestamp)

source: '%s' is not a valid GUID value
da: '%s' er ikke en gyldig GUID værdi
ru: '%s' - неверное значение GUID

source: '%s' is not a valid boolean value
da: '%s' er ikke en gyldig boolean værdi
ru: '%s' - неверное логическое значение

source: Out of memory
da: Ikke mere hukommelse
ru: Не хватает памяти

source: I/O error %d
da: I/O fejl %d
ru: Ошибка ввода/вывода %d

source: File not found
da: Filen blev ikke fundet
ru: Файл не найден

source: Invalid filename
da: Ugyldigt filnavn
ru: Неверное имя файла - %s

source: Too many open files
da: For mange åbne filer
ru: Слишком много открытых файлов

source: File access denied
da: Filadgang nægtet
ru: В доступе к файлу отказано

source: Read beyond end of file
da: Læsning forsøgt efter slutning på fil
ru: Чтение за окончанием файла

source: Disk full
da: Disken er fuld
ru: Диск полный

source: Invalid numeric input
da: Ugyldig numerisk inddata
ru: Неверный ввод числа

source: Division by zero
da: Division med nul
ru: Деление на ноль

source: Range check error
da: Heltalsoverløb
ru: Ошибка выхода за границы (Range check error)

source: Integer overflow
da: Heltalsoverløb
ru: Переполнение целого

source: Invalid floating point operation
da: Ugyldig kommatalsoperation
ru: Неверная операция с дробными числами

source: Floating point division by zero
da: Kommatalsberegning forsøgte at dividere med nul
ru: Нецелочисленное деление на ноль

source: Floating point overflow
da: Kommatalsoverløb
ru: Нецелочисленное переполнение

source: Floating point underflow
da: Kommatalsunderløb
ru: Нецелочисленная потеря (underflow)

source: Invalid pointer operation
da: Ugyldig handling med pointer
ru: Неверная операция с указателем

source: Invalid class typecast
da: Ugyldig klasse typekonvertering
ru: Неверное приведение класса

source: Access violation at address %p. %s of address %p
da: Vildfaren pointer på adresse %p. %s af adresse %p
ru: Нарушение доступа по адресу %p. %s по адресу %p

source: Access violation at address %p, accessing address %p
da: Vildfaren pointer på adresse %p, forsøg på at tilgå adresse %p
ru: Нарушение доступа по адресу %p, обращение к адресу %p

source: Access violation
da: Vildfaren pointer
ru: Нарушение доступа

source: Stack overflow
da: Stakoverløb
ru: Переполнение стека

source: Control-C hit
da: Control-C blev trykket
ru: Нажатие Control-C

source: Quit key hit
da: Afsluttasten blev trykket
ru: Нажатие кнопки Выход

source: Privileged instruction
da: Priviligeret CPU instruktion
ru: Привилегированная инструкция

source: Operation aborted
da: Handling blev afbrudt
ru: Операция прервана

source: Exception %s in module %s at %p. %s%s
da: Undtagelse %s i modul %s ved %p. %s%s
ru: Исключительная ситуация %s в модуле %s по адресу %p. %s%s

source: Application Error
da: Programfejl
ru: Ошибка приложения

source: sigaction call failed
da: sigaction kald fejlede

source: Format '%s' invalid or incompatible with argument
da: Formatet '%s' er ugyldigt eller inkompatibelt med argumentet
ru: Формат '%s' - неверный или несовместимый с аргументом

source: No argument for format '%s'
da: Intet argument for formatet '%s'
ru: Нет аргумента для формата '%s'

source: Variant method calls not supported
da: Variantmetodekald er ikke understøttet
ru: Вызовы вариантных методов не поддерживаются

source: Format result longer than 4096 characters
da: Formatresultat er længere end 4096 tegn
ru: Результат форматирования длиннее, чем 4096 символов

source: Format string too long
da: Formattekst er for lang
ru: Строка формата слишком длинная

source: Error creating variant or safe array
da: Fejl ved oprettelse af variant eller sikkert array
ru: Ошибка создания вариантного массива

source: Variant or safe array index out of bounds
da: Variant eller sikkert array indeks er ude for gyldigt område
ru: Индекс вариантного массива вышел за границы

source: Variant or safe array is locked
da: Variant eller safe array er låst
ru: Вариантный или safe массив заблокирован

source: Unexpected variant or safe array error: %s%.8x
da: Uventet variant eller safe array fejl: %s%.8x
ru: Неожиданная ошибка вариантного или safe массива: %s%.8x

source: Invalid variant type conversion
da: Ugyldig varianttype konvertering
ru: Неверное преобразование вариантного типа

source: Invalid variant operation
da: Ugyldig variant handling
ru: Неверная операция с вариантом

source: Invalid NULL variant operation
da: Ugyldig NULL variant handling
ru: Неверная операция с NULL

source: Invalid variant operation (%s%.8x) %s
da: Ugyldig variant handling (%s%.8x) %s
ru: Неверная операция с вариантом (%s%.8x) %s

source: Range check error for variant of type (%s)
da: Kontrol for gyldigt talområde fejlede for variant af type (%s)
ru: Ошибка выхода за границы (range check) для варианта типа (%s)

source: Range check error while converting variant of type (%s) into type (%s)
da: Kontrol for gyldigt talområde fejlede under konvertering af variant af type (%s) til type (%s)
ru: Ошибка выхода за границы (range check) при конвертировании варианта типа (%s) в тип (%s)

source: Custom variant type (%s%.4x) is out of range
da: Special variant type (%s%.4x) er uden for gyldigt område
ru: Произвольный вариантный тип (%s%.4x) вышел за границы

source: Custom variant type (%s%.4x) already used by %s
da: Speciel varianttype (%s%.4x) er allerede benyttet af %s
ru: Произвольный вариантный тип (%s%.4x) уже используется %s

source: Custom variant type (%s%.4x) is not usable
da: Speciel varianttype (%s%.4x) er ikke brugbar
ru: Произвольный вариантный тип (%s%.4x) является непригодным

source: Too many custom variant types have been registered
da: For mange specielle varianttype er blevet registreret
ru: Зарегистрировано cлишком много произвольных вариантных типов

source: Variant is not an array
da: Variant er ikke et array
ru: Вариант не является массивом

source: Unknown custom variant type ($%.4x)
da: Ukendt speciel varianttype ($%.4x)
ru: Неизвестный произвольный вариантный тип ($%.4x)

source: Custom variant type ($%.4x) is out of range
da: Speciel variant type ($%.4x) er uden for gyldigt område
ru: Произвольный вариантный тип ($%.4x) вышел за границы

source: Custom variant type ($%.4x) already used by %s
da: Specielt variant type ($%.4x) er allerede anvendt af %s
ru: Произвольный вариантный тип ($%.4x) уже используется %s

source: Custom variant type ($%.4x) is not usable
da: Speciel varianttype ($%.4x) er ikke brugbar
ru: Произвольный вариантный тип ($%.4x) является непригодным

source: Invalid variant operation ($%.8x)
da: Ugyldig varianthandling ($%.8x)
ru: Неверная операция с вариантом ($%.8x)

source: Could not convert variant of type (%s) into type (%s)
da: Kunne ikke konvertere variant af type (%s) til type (%s)
ru: Не могу преобразовать вариант типа (%s) в тип (%s)

source: Overflow while converting variant of type (%s) into type (%s)
da: Overløb ved konvertering af variant af type (%s) til type (%s)
ru: Переполнение при преобразовании варианта типа (%s) в тип (%s)

source: Variant overflow
da: Variant overløb
ru: Переполнение варианта

source: Invalid argument
da: Ugyldigt argument
ru: Неверный аргумент

source: Invalid variant type
da: Ugyldig varianttype
ru: Неверный тип варианта

source: Operation not supported
da: Handling er ikke understøttet
ru: Операция не поддерживается

source: Variant operation ran out memory
da: Varianthandling løb tør for hukommelse
ru: Операции с вариантом не хватило памяти

source: Unexpected variant error
da: Uventet variantfejl
ru: Неожиданная ошибка варианта

source: Recursion while doing a VarDataClear
da: Rekursion mens VarDataClear udføres
ru: Рекурсия во время выполнения VarDataClear

source: Recursion while doing a VarDataCopy
da: Rekursion mens VarDataCopy udføres
ru: Рекурсия во время выполнения VarDataCopy

source: Recursion while doing a VarDataCopyNoInd
da: Rekursion mens VarDataCopyNoInd udføres
ru: Рекурсия во время выполнения VarDataCopyNoInd

source: Recursion while doing a VarDataInit
da: Rekursion mens VarDataInit udføres
ru: Рекурсия во время выполнения VarDataInit

source: Recursion while doing a VarDataCastTo
da: Rekursion mens VarDataCastTo udføres
ru: Рекурсия во время выполнения VarDataCastTo

source: Variant is empty
da: Variant er tom
ru: Вариант - пустой

source: Cannot convert from the specified type
da: Kan ikke konvertere fra den specificerede type
ru: Не могу преобразовать из указанного типа

source: Cannot convert to the specified type
da: Kan ikke konvertere til den specificerede type
ru: Не могу преобразовать в указанный тип

source: External exception %x
da: Ekstern undtagelse %x
ru: Внешняя исключительная ситуация %x

source: Assertion failed
da: Antagelse fejlede

source: Interface not supported
da: Interface er ikke understøttet
ru: Интерфейс не поддерживается

source: Exception in safecall method
da: Undtagelse i en safecall metode
ru: Исключительная ситуация в safecall методе

source: %s (%s, line %d)
da: %s (%s, linje %d)
ru: %s (%s, строка %d)

source: Abstract Error
da: Fejl i abstrakt mekanismen
ru: Абстрактная ошибка

source: Access violation at address %p in module '%s'. %s of address %p
da: Vildfaren pointer ved adresse %p i modul '%s'. %s af adresse %p
ru: Нарушение доступа по адресу %p в модуле '%s'. %s по адресу %p

source: Cannot access package information for package '%s'
da: Kan ikke få adgang til pakkeinformation for pakken '%s'
ru: Не могу получить информацию пакета для пакета '%s'

source: Can't load package %s. %s
da: Kan ikke indlæse pakken %s. %s
ru: Не могу загрузить пакет %s. %s

source: Invalid package file '%s'
da: Ugyldig pakkefil '%s'
ru: Неверный файл пакета '%s'

source: Invalid package handle
da: Ugyldigt pakkehåndtag
ru: Неверный дескриптор пакета

source: Cannot load package '%s.' It contains unit '%s,'which is also contained in package '%s'
da: Kan ikke indlæse pakke '%s.' Det indeholder unit '%s', som også er indeholdt i pakke '%s'
ru: Не могу загрузить пакет '%s'. Он включает модуль '%s', который также содержится в пакете '%s'

source: System Error. Code: %d. %s
da: Systemfejl. kode: %d. %s
ru: Системная ошибка. Код: %d. %s

source: A call to an OS function failed
da: Et kald til en operativsystemsfunktion fejlede
ru: Ошибка при вызове функции ОС

source: Win32 Error. Code: %d. %s
da: Win32 fejl. Kode: %d. %s
ru: Ошибка Win32. Код: %d. %s

source: A Win32 API function failed
da: En Win32 API funktion fejlede
ru: Ошибка функции Win32 API

source: Application is not licensed to use this feature
da: Programmet er ikke licensieret til at bruge denne facilitet
ru: Приложение не имеет лицензии на использование этой возможности

source: May
da: Maj
ru: Май

source: Oct
da: Okt
ru: Окт

source: January
da: Januar
ru: Январь

source: February
da: Februar
ru: Февраль

source: March
da: Marts
ru: Март

source: June
da: Juni
ru: Июнь

source: July
da: Juli
ru: Июль

source: October
da: Oktober
ru: Октябрь

source: Sun
da: Søn
ru: Вск

source: Mon
da: Man
ru: Пон

source: Tue
da: Tir
ru: Втр

source: Wed
da: Ons
ru: Срд

source: Thu
da: Tor
ru: Чет

source: Fri
da: Fre
ru: Пят

source: Sat
da: Lør
ru: Суб

source: Sunday
da: Søn
ru: Воскресенье

source: Monday
da: Mandag
ru: Понедельник

source: Tuesday
da: Tirsdag
ru: Вторник

source: Wednesday
da: Onsdag
ru: Среда

source: Thursday
da: Torsdag
ru: Четверг

source: Friday
da: Fredag
ru: Пятница

source: Saturday
da: Lørdag
ru: Суббота

source: Unable to create directory
da: Ude af stand til at oprette filmappe
ru: Не могу создать папку

source: Codeset conversion failure
da: Tegnsætkonverteringsfejl
ru: Ошибка преобразования codeset

source: &User Name:
da: &Brugernavn

source: &Password:
da: &Adgangskode:

source: Enter password
da: Indtast adgangskode

source: Re&move all
da: &Fjern alle

source: File Name:
da: Filnavn:

source: File Type:
da: Filtype:

source: &Open
da: &Åbn

source: Change view
da: Skift visning

source: New &Directory
da: Ny &filmappe

source: &Up one directory
da: &Et filmappeniveau op

source: &Back
da: &Tilbage

source: &Forward
da: &Frem

source: Ho&me
da: &Hjem

source: &Reload
da: &Genindlæs

source: &Look in:
da: &Se i:

source: Open as &read-only
da: Åbn &skrivebeskyttet

source: Auto Preview
da: Automatisk visning

source: Up one directory
da: Et filmappeniveau op

source: Back
da: Tilbage

source: Forward
da: Frem

source: Home directory
da: Hjemmemappe

source: Reload
da: Genindlæs

source: Large &Icons
da: Store &ikoner

source: Large icon view
da: Vis store ikoner

source: &Small Icons
da: &Små ikoner

source: Small Icon view
da: Vis med små ikoner

source: &List
da: &Liste

source: List view
da: Listevisning

source: &Detail
da: &Detaljer

source: Detaul view
da: Standardvisning

source: Create new directory
da: Opret ny filmappe

source: &Rename
da: &Omdøb

source: Show &Hidden Files
da: Vis &skjulte filer

source: &Items
da: &Liste

source: &New Item
da: &Ny

source: &Delete
da: &Slet

source: Item Properties
da: Elementegenskaber

source: &Caption:
da: &Overskrift:

source: I&mage Index:
da: &Billedeindeks:

source: &Apply
da: &Anvend

source: &Selected Image
da: &Valgte billede

source: &Transparent Color:
da: &Transparentfarve:

source: &Fill Color:
da: &Fyldfarve:

source: Cr&op St&retch C&enter
da: Besk&ær St&ræk C&entrer

source: Options
da: Valgmuligheder

source: A&pply
da: &Anvend

source: &Images
da: &Billeder

source: &Add...
da: &Tilføj...

source: &Clear
da: &Slet

source: E&xport...
da: E&ksport...

source: Add Images
da: Tilføj billeder

source: Bitmaps (*.bmp)|*.bmp
da: Billeder (*.bmp)|*.bmp

source: Export Images
da: Eksporter billeder

source: N&ew SubItem
da: N&yt underelement

source: &State Index:
da: &Tilstandsindeks:

source: TreeView Items Editor
da: TreeView elementeditor

source: &New Node
da: &Nyt knudepunkt

source: N&ew SubNode
da: N&yt underknudepunkt

source: L&oad
da: &Indlæs

source: &Text:
da: &Tekst:

source: Sele&cted Index:
da: &Valgt indeks:

source: S&ub Items
da: &Underelementer

source: Add &SubItem
da: Tilføj &Underelement

source: De&lete
da: Sl&et

source: Sub Item &Properties
da: Underelement &egenskaber

source: Te&xt:
da: Te&kst:

source: Ima&ge Index:
da: Bille&deindeks:

source: All Files(*)
da: Alle filer(*)

source: Picture Editor
da: Billede editor

source: &Load...
da: &Indlæs...

source: &Save...
da: &Gem...

source: String list editor
da: Tekstliste redigeringsværktøj

source: 0 lines
da: 0 linjer

source: Text files (*.txt)|*.txt|Shell scripts (*.sh)|*.sh|Config files (*.conf)|*.conf|All files (*)|*
da: Tekstfiler (*.txt)|*.txt|Skalscripts (*.sh)|*.sh|Konfigurationsfiler (*.conf)|*.conf|Alle filer (*)|*

source: Load string list
da: Indlæs tekstliste

source: Text files (*.txt)|Config files (*.conf)|Shell scripts (*.sh)|All files (*)
da: Tekstfiler (*.txt)|Konfigurationsfiler (*.conf)|Skalscripts (*.sh)|Alle filer (*)

source: Save string list
da: Gem tekstliste

source: <a>View List</a>&nbsp;|&nbsp;<a HREF="<#PATH>Details">View Details</a>
da: <a>Vis liste</a>&nbsp;|&nbsp;<a HREF="<#PATH>Details">Vis Detaljer</a>

source: <a HREF=<#PATH>List>View List</a>&nbsp;|&nbsp;<a>View Details</a>
da: <a HREF=<#PATH>List>Vis liste</a>&nbsp;|&nbsp;<a>Vis detaljer</a>

source: &Previous
da: &Forrige

source: &Next
da: &Næste

source: &Translate Post
da: &Oversæt denne

source: &Translate Text
da: &Oversæt tekst

source: &Wrap Text
da: &Ombryd tekst

source: Cu&t
da: Kli&p

source: Cut|Cuts the selection and puts it on the Clipboard
da: Klip|Klipper det valgte ud og lægger det i udklipsholderen

source: &Copy
da: &Kopier

source: Copy|Copies the selection and puts it on the Clipboard
da: Kopier|Kopierer det valgte til udklipsholderen

source: &Paste
da: &Indsæt

source: Paste|Inserts Clipboard contents
da: Indsæt|Indsætter udklipsholderens indhold

source: Select &All
da: Vælg &alle

source: Select All|Selects the entire document
da: Vælg alle|Vælger hele dokumentet

source: Select &Font...
da: Vælg &skrifttype...

source: &Details...
da: &Detaljer...

source: Default URL:
da: Standart URL:

source: Toggle
da: Skift

source: St&atistics
da: St&atistik

source: &Log To List
da: &Log til liste

source: E&xit
da: &Afslut

source: &About...
da: &Om programmet...

source: &Options...
da: &Indstillinger...

source: &Log Traffic
da: &Log traffik

source: Options
da: Indstillinger

source: &Connection
da: &Forbindelse

source: &Search Path:
da: &Søgesti:

source: &Default URL:
da: &Standart URL:

source: &Activate at Startup
da: &Aktiver ved opstart

source: &Browser:
da: &Netlæser:

source: &Show in Log
da: &Vis i log

source: Log S&ize
da: Log S&tørrelse

source: Ma&x Events:
da: &Maks hændelser:

source: &Delete when max exceeded:
da: &Slet når maks overskredet:

source: Total Response Time:
da: Total svartid:

source: Avg Response Time:
da: Gns. svartid

source: Last Response Time:
da: Sidste svartid:

source: Min Response Time:
da: Minimum svartid:

source: Max Response Time:
da: Maksimal svartid:

source: &Reset
da: &Nulstil

source: About Web App Debugger
da: Om webprogram fejlsøgeren

source: Web Application Debugger
da: Webprogram Fejlsøger

source: Decision Cube Editor
da: Beslutningsterningseditor

source: Dimension Settings
da: Dimensionsindstillinger

source: Display &Name
da: Vis &navn

source: &Active Type
da: &Aktiv type

source: &Grouping
da: &Gruppering

source: &Initial Value
da: &Begyndelsesværdi

source: Available &Fields
da: Tilgængelige &felter

source: &Base Field
da: &Basisfelt

source: Control of when the information for this field is loaded
da: Bestem, hvornår informationerne er indlæst i dette felt

source: Group values for this field into ranges
da: Grupper værdier for dette felt i intervaller

source: Starting value for date ranges, Intial value for single valued dimensions
da: Startværdi for datointervaller, startværdi for enkeltværdidimensioner

source: Fieldname (for a summary, the original field used to calculate the summary)
da: Feltnavn (originalfeltet, hvis der er tale om en total eller lign.)

source: Memory Control
da: Hukommelsesstyring

source: Control whether to load the decision cube at design time
da: Bestem, hvorvidt beslutningsterningen skal indlæses ved designtidspunkt

source: Designer Data Options
da: Designer data indstillinger

source: Display Dimension &Names
da: Vis dimensionsn&avne

source: Display Names and &Values
da: Vis navne og &værdier

source: Display Names, Values, and &Totals
da: Vis navne, værdier og &totaler

source: &Run Time Display Only
da: &Kør kun tidsvisning

source: Cube Maximums
da: Terning maksima

source: Active
da: Aktiv

source: Active+Needed
da: Aktiv+Brugt

source: &Dimensions
da: &Dimensioner

source: &Summaries
da: &Sammenfatninger

source: &Cells
da: &Celler

source: Maximum
da: Maksimum

source: Current
da: Nuværende

source: Limit on the number of dimensions which can be loaded at one time
da: Begræsning på antallet af dimensioner, som kan blive indlæst på en gang

source: Limit on the number of summaries which can be loaded at one time
da: Begrænsning på antallet af opsummeringer, som kan indlæses på en gang

source: Limit on the number of storage cells which can be loaded at one time
da: Begrænsing på antallet af lagringsceller, som kan indlæses på en gang

source: Run a query to fetch information required to estimate cell usage
da: Hent nødvendig information via en forespørgsel for at estimere celleforbrug

source: &Get Cell Counts
da: &Hent celleantal

source: Decision Query Editor
da: Beslutningsforespørgselseditor

source: Dimensions/Summaries
da: Dimensioner/Sammenfatninger

source: &Dimensions:
da: &Dimensioner:

source: &Summaries:
da: &Sammenfatninger:

source: &List of Available Fields:
da: &Liste over tilgængelige felter:

source: &Table:
da: &Tabel:

source: List all fields or List only the fields in the query
da: Vis alle felter eller vis kun felterne i en forespørgsel

source: All &Fields
da: Alle &felter

source: Start a new query using a table from the database
da: Kør en ny forespørgsel med en tabel fra databasen

source: Use count(*) to calculate averages (counts null values)
da: Benyt count(*) for at beregne gennemsnit (tæller null værdier)

source: SQL Query
da: SQL Forespørgsel

source: &Query Text:
da: &Forespørgselstekst:

source: &Cancel Edit
da: &Annuller redigering

source: Type in the query directly
da: Indtast forespørgslen direkte

source: Add/Join Tables and Create Field List with SQL Builder
da: Tilføj/sammensæt tabeller og opret feltliste med SQL Builder

source: &count
da: &antal

source: &average
da: &gennemsnit

source: &Cancel
da: &Annuller

source: Source of Connection
da: Forbindelsens kilde

source: Use Data &Link File
da: Benyt &datalink fil

source: &Browse...
da: &Gennemse...

source: Use &Connection String
da: Anvend &forbindelsestekst

source: B&uild...
da: B&yg

source: Assign Data From
da: Tildel data fra

source: Add New
da: Tilføj ny

source: Delete Selected
da: Slet det valgte

source: Move &Up
da: Flyt &op

source: Move Selected Up
da: Flyt valgte op

source: Move Dow&n
da: Flyt &ned

source: Move Selected Down
da: Flyt valgte ned

source: &Select All
da: &Vælg alle

source: &Alias name:
da: &Aliasnavn:

source: &Driver name:
da: &Driver navn:

source: &Parameter overrides:
da: &Parameter erstatning:

source: &Name:
da: &Navn:

source: D&efaults
da: St&andarter

source: &Login prompt
da: &Indlogningsvindue

source: &Keep inactive connection
da: &Hold liv i inaktiv forbindelse

source: Input Requested
da: Indtastning ønskes

source: Don't Prompt Again
da: Spørg ikke igen

source: ActiveX Control Data Bindings Editor
da: ActiveX Kontrol datatilknytnings editor

source: &Property Name:
da: &Egenskabsnavn:

source: &Field Name:
da: &Feltnavn:

source: Bo&und Properties to Fields:
da: Egenskaber b&undet til felter:

source: <- &Bind ->
da: <- &Forbind ->

source: C&lear
da: &Slet

source: Available fields
da: Tilgængelige felter

source: Associate attributes
da: Associer attributter

source: Attribute set name
da: Sæt attributnavn
