Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/delphi7.po
Languages: da, ru

source: Class %s could not create QT widget
da: Klasse %s kunne ikke oprette QT widget
ru: Класс %s не может создать QT widget

source: Too many buttons specified for message box
da: For mange knapper specificeret til meddelelsesboks
ru: Определено слишком много кнопок для окна сообщения

source: Backspace
da: Bak

source: Tab
da: Faneblad

source: BackTab
da: TilbageTab

source: Return
da: Retur

source: Enter
da: Enter-tast

source: Space
da: Mellemrum

source: End
da: Slut

source: Home
da: Hjem

source: Left
da: Venstre

source: Up
da: Op

source: Right
da: Højre

source: Down
da: Ned

source: Ins
da: Inds

source: Del
da: Slet

source: Shift+
da: Skift+

source: Ctrl+
da: Ktrl+

source: Open
da: Åbn
ru: Открыть

source: WriteObject called twice for the same instance
da: WriteObject blev kaldt to gange for den samme instans
ru: WriteObject вызван дважды для одного и того же экземпляра

source: Resource %s is of incorrect class
da: Resource %s er af forkert klasse
ru: Неверный класс ресурса %s

source: Tab index out of bounds
da: Tab indeks er ude for gyldigt interval
ru: Tab индекс вышел за границы

source: Tab position incompatible with current tab style
da: Tab position er inkompatibel med nuværende tab stil
ru: Позиция tab несовместима с текущим стилем tab

source: Tab style incompatible with current tab position
da: Tab stil er inkompatibel med nuværende tab position
ru: Cтиль tab несовместим с текущей позицией tab

source: Bitmap image is not valid
da: Billede er ikke gyldigt
ru: Изображение Bitmap имеет неверный формат

source: Icon image is not valid
da: Ikon er ikke gyldigt
ru: Иконка (Icon) имеет неверный формат

source: Invalid pixel format
da: Ugyldigt pixel format
ru: Неверный точечный (pixel) формат

source: Bitmap is empty
da: Billedet er tomt
ru: Изображение Bitmap пустое

source: Scan line index out of range
da: Skanlinie indeks er ude for gyldigt område
ru: Scan line индекс вышел за границы

source: Cannot change the size of an icon
da: Kan ikke ændre størrelsen på et ikon
ru: Не могу изменить размер иконки

source: Unknown picture file extension (.%s)
da: Ukendt billedefilendelse (.%s)
ru: Неизвестное расширение файла изображения (.%s)

source: Unsupported clipboard format
da: Udklipsholderformat er ikke supporteret
ru: Неподдерживаемый формат буфера обмена

source: Out of system resources
da: Løbet tør for systemresourcer
ru: Не хватает системных ресурсов

source: Canvas does not allow drawing
da: Kanvas tillader ikke at der tegnes på det
ru: Canvas не позволяет рисовать

source: Invalid canvas state request
da: Ugyldig kanvas tilstandsforespørgsel
ru: Неверный запрос состояния canvas

source: Invalid image size
da: Ugyldig billedstørrelse
ru: Неверный размер изображения

source: Invalid widget handle
da: Ugyldig widget handle
ru: Неверный дескриптор widget

source: Color depth must be 1, 8 or 32 bpp
da: Farvedybden skal være 1, 8 eller 32 bpp
ru: Глубина цвета должна быть 1, 8 или 32 bpp

source: Invalid XImage
da: Ugyldig XImage
ru: Неверный XImage

source: Too many images
da: For mange billeder
ru: Слишком много изображений

source: Error creating widget
da: Fejl ved oprettelse af widget
ru: Ошибка создания widget

source: Cannot focus a disabled or invisible window (%s)
da: Kan ikke fokusere et usynligt eller inaktiveret vindue (%s)
ru: Не могу передать фокус ввода отключенному или невидимому окну

source: Control '%s' has no parent widget
da: Kontrollen '%s' har ingen forælderwidget
ru: Элемент управления '%s' не имеет родительского окна

source: Parent given is not a parent of '%s'
da: Den givne forælder er ikke en forælder til '%s'
ru: Данный родитель не является родителем '%s'

source: Cannot change Visible in OnShow or OnHide
da: Can ikke ændre Visible i OnShow eller OnHide
ru: Не могу изменить Visible в OnShow или OnHide

source: Cannot make a visible window modal
da: Kan ikke gøre synligt vindue modal
ru: Не могу сделать видимым модальное окно

source: Scrollbar property out of range
da: Scrollbar egenskab er uden for gyldigt talområde
ru: Свойство Scrollbar вышло за границы

source: %s property out of range
da: %s egenskab er uden for gyldigt talområde
ru: Свойство %s вышло за границы

source: Menu index out of range
da: Menuindeks er uden for gyldigt område
ru: Индекс меню вышел за границы

source: Menu inserted twice
da: Menu blev indsat to gange
ru: Меню вставлено дважды

source: Menu insertion recursion not allowed
da: Menuindsættelse må ikke være rekursiv
ru: Рекурсия при вставке меню не поддерживается

source: Sub-menu is not in menu
da: Undermenu er ikke i menu
ru: Подменю - не в меню

source: TMenu.SetForm: argument must be TCustomForm
da: TMenu.SetForm: argumentet skal være en TCustomForm
ru: TMenu.SetForm: аргумент должен быть TCustomForm

source: Not enough timers available
da: Ikke nok timere til rådighed
ru: Нет доступных таймеров

source: No printer adapter available for printing
da: Ingen printeradaptor tilgængelig for udskrivning
ru: Нет доступного адаптера принтера для печати

source: Printer index out of range
da: Printerindeks er uden for gyldigt talområde
ru: Индекс принтера вышел за границы

source: Printer selected is not valid
da: Den valgte printer er ikke gyldig
ru: Выбран неверный принтер

source: %s on %s
da: %s på %s

source: GroupIndex cannot be less than a previous menu item's GroupIndex
da: Gruppeindeks kan ikke være mindre end gruppeindeksen for et foregående menuelement
ru: GroupIndex не может быть меньше, чем GroupIndex предыдущего пункта меню

source: Cannot create form. No MDI forms are currently active
da: Kan ikke oprette formular. Ingen MDI formularer er aktive lige nu
ru: Не могу создать форму. Нет активных MDI форм

source: Invalid MDIParent for class %s
da: Ugyldig MDIParent for klassen %s
ru: Неверный MDIParent для класса %s

source: Cannot hide an MDI Child Form
da: Kan ikke skjule en MDI Child formular
ru: Не могу скрыть дочернюю MDI форму

source: Can only modify an image if it contains a bitmap
da: Kan kun modificere et billede, hvis det indeholder et bitmap
ru: Можно редактировать только изображения, которые содержат bitmap

source: A control cannot have itself as its parent
da: En kontrol kan ikke være sin egen forælder
ru: Элемент управления не может быть родителем самого себя

source: Cancel
da: Annuller
ru: Отмена

source: &Yes
da: &Ja
ru: &Да

source: &No
da: &Nej
ru: &Нет

source: &Help
da: &Hjælp
ru: &Справка

source: &Close
da: &Luk
ru: &Закрыть

source: &Ignore
da: &Ignorer
ru: Про&должить

source: &Retry
da: &Gentag
ru: &Повторить

source: Abort
da: Abryd
ru: Прервать

source: &All
da: &Alle
ru: &Все

source: Cannot drag a form
da: Kan ikke trække formular
ru: Не могу перемещать форму

source: PutObject to undefined item
da: PutObject til udefineret element
ru: PutObject для неопределенного типа

source: Icons
da: Ikoner
ru: Иконки

source: Bitmaps
da: Billeder

source: PNGs
da: PNGer

source: Drawings
da: Tegninger
ru: Рисунки

source: Jpegs
da: Jpeg'er

source: Invalid numeric value
da: Ugyldig numerisk værdi
ru: Неверное числовое значение

source: Invalid value for current item
da: Ugyldig værdi for nuværende element
ru: Неверное значение для текущего элемента

source: Warning
da: Advarsel
ru: Предупреждение

source: Error
da: Fejl
ru: Ошибка

source: Confirm
da: Bekræft
ru: Подтвердить

source: No help available
da: Ingen hjælp tilgængelig
ru: Справка недоступна

source: Help
da: Hjælp
ru: Справка

source: &Abort
da: &Abryd
ru: П&рервать

source: N&o to All
da: N&ej til alle
ru: Н&ет для всех

source: Yes to &All
da: Ja til &alle
ru: Д&а для всех

source: (Unknown)
da: (Ukendt)
ru: (Неизвестен)

source: (None)
da: (Ingen)
ru: (Нет)

source: Value must be between %d and %d
da: Værdi skal være mellem %d og %d
ru: Значение должно быть между %d и %d

source: Cannot create a default method name for an unnamed component
da: Kan ikke oprette en default metode for en komponent uden navn
ru: Не могу создать имя метода по умолчанию для безымянного компонента

source: Unnamed
da: Unavngivet
ru: Безымянный

source: Unable to insert a line
da: Ikke i stand til at indsætte en linje
ru: Невозможно вставить строку

source: The specified directory does not exist. Create it?
da: Den valgte filmappe findes ikke. Skal den oprettes?
ru: Указанная папка не существует. Создать ее?

source: Select Directory
da: Vælg filmappe
ru: Выбор папки

source: Unable to create directory "%s".
da: Ude af stand til at oprette filmappe "%s".
ru: Не могу создать папку "%s".

source: Access denied to "%s"
da: Adgang nægtet til "%s"
ru: Доступ к "%s" запрещен

source: Cannot read directory: "%s"
da: Kan ikke læse filmappe: "%s"
ru: Не могу прочитать папку: "%s"

source: Directory "%s" is not empty.
da: Filmappen "%s" er ikke tom.
ru: Папка "%s" - не пустая.

source: "%s" is not a subdirectory of "%s"
da: "%s" er ikke en undermappe af "%s"
ru: "%s" - не подкаталог "%s"

source: Directory &Name:
da: Filmappenavn:
ru: &Имя папки:

source: D&rives:
da: D&rev:
ru: &Устройства:

source: &Directories:
da: &Filmapper:
ru: &Папки:

source: &Files: (*.*)
da: &Filer: (*.*)
ru: &Файлы: (*.*)

source: Ne&twork...
da: Ne&tværk...
ru: &Сеть...

source: Unable to read directory "%s".
da: Ude af stand til at læse mappe "%s"
ru: Не могу прочитать папку "%s".

source: New Folder
da: Ny mappe
ru: Новая папка

source: "%s" File not found.
da: "%s" Fil ikke fundet.
ru: "%s" Файл не найден.

source: A file with that name already exists. Please specify a different filename.
da: En fil med det navn findes allerede. Specificer venligst et andet filnavn.
ru: Файл с таким именем уже существует. Пожалуйста, укажите другое имя файла.

source: Confirm file deletion
da: Bekræft filsletning
ru: Подтвеждение удаления файла

source: Are you sure you want to delete these %d items?
da: Er du sikker på, at du vil slette disse %d elementer?
ru: Вы уверены, что хотите удалить эти %d пункта(ов)?

source: Are you sure you want to delete "%s"?
da: Er du sikker på at du vil slette "%s"?
ru: Вы уверены, что хотите удалить "%s"?

source: Continue delete operation?
da: Fortsæt sletning?
ru: Продолжить операцию удаления?

source: Additional
da: Ekstra
ru: Дополнительно

source: Name
da: Navn

source: Size
da: Størrelse
ru: Размер

source: Date Modified
da: Dato ændret
ru: Дата изменения

source: Attributes
da: Attributter
ru: Атрибуты

source: Owner
da: Indehaver
ru: Хозяин

source: Group
da: Gruppe
ru: Группа

source: All Files (*)|*|
da: Alle filer (*)|*|
ru: Все файлы (*.*)|*.*

source: All Files (*.*)|*.*|
da: Alle Filer (*.*)|*.*|
ru: Все файлы (*.*)|*.*

source: Volume
da: Indhold
ru: Том

source: Free Space
da: Fri plads
ru: Свободно

source: any known drive
da: et hvilkensomhelst kendt drev
ru: неизвестный диск

source: Directory
da: Filmappe
ru: Папка

source: File
da: Filer
ru: Файл

source: Link to
da: Reference til
ru: Ссылка на

source: Invalid clipboard format
da: Ugyldigt udklipsholderformat
ru: Неверный формат буфера обмена

source: Clipboard does not support Icons
da: Udklipsholderen kan ikke håndtere ikoner
ru: Буфер обмена не поддерживает иконки

source: Cannot open clipboard
da: Kan ikke tilgå udklipsholderen
ru: Не могу открыть буфер обмена

source: Default
da: Standart

source: Text exceeds memo capacity
da: Tekst er større en kapaciteten for memo'en
ru: Текст превысил емкость memo

source: Custom Colors
da: Brugervalgte farver

source: Operation not supported on selected printer
da: Denne handling er kan ikke lade sig gøre med den valgte printer
ru: Операция не поддерживается на выбранном принтере

source: There is no default printer currently selected
da: Der er ikke valgt nogen standard printer lige nu
ru: Нет выбранного по умолчанию принтера

source: (Untitled)
da: (Uden titel)
ru: (Без имени)

source: Menu '%s' is already being used by another form
da: Menu '%s' er allerede i brug af en anden formular
ru: Меню '%s' уже используется другой формой

source: Picture:
da: Billede:
ru: Картинка:

source: Preview
da: Vis udskrift
ru: Просмотр

source: No Preview Available
da: Intet forhåndsvisning til rådighed
ru: Нет доступного Просмотра

source: Bold Italic
da: Fed Kursiv

source: Bold
da: Fed

source: Italic
da: Kursiv

source: Regular
da: Normal

source: Properties
da: Egenskaber
ru: Свойства

source: All Commands
da: Alle kommandoer

source: A property category called %s already exists
da: En egenskabskategori ved navn %s findes allerede
ru: Категория свойства, названная %s, уже создана

source: Property category does not exist (%s)
da: Egenskabskategorien findes ikke (%s)
ru: Категория свойства не создана (%s)

source: Property filters may only be name, class or type based (%d:%d)
da: Egenskabsfilter må kun være baseret på navn, klasse eller type (%d:%d)
ru: Фильтром свойств может быть только имя, класс или тип по базе (%d:%d)

source: Categories must define their own name and description
da: Kategorier skal definere deres eget navn og beskrivelse
ru: Категории должны определять свои имя и описание

source: Operation not allowed while dispatching application events
da: Handlingen er ikke tilladt mens applikationshandlinger bliver udført
ru: Операция не допустима во время отправки событий приложения

source: Text not found: "%s"
da: Teksten blev ikke fundet: "%s"
ru: Текст не найден: "%s"

source: Invalid ImageList Index
da: Ugyldigt ImageList indeks
ru: Неверный индекс ImageList

source: Unable to Replace Image
da: Ikke i stand til at erstatte billede
ru: Невозможно заменить изображение

source: Invalid image type
da: Ugyldig billedtype
ru: Неверный тип изображения

source: Image width and heigth must match
da: Billedbredde og højde skal passe sammen
ru: Ширина и высота изображения должны совпадать

source: Invalid image dimension
da: Ugyldig dimension for billedet
ru: Неверное измерение изображения

source: Error resizing ImageList
da: Fejl ved ændring af ImageList størrelse
ru: Ошибка изменения размеров ImageList

source: Range of %d to %d is invalid
da: Området %d til %d er ugyldigt
ru: Диапазон от %d до %d - неверный

source: MimeSource format must have an associated data stream
da: MimeSource formatet skal have en tilknyttet datastrøm
ru: Формат MimeSource должен иметь связанный с данными поток (stream)

source: Mime format not supported for TIcon
da: Mimeformatet kan ikke bruges med TIcon
ru: Формат Mime не поддерживается для TIcon

source: Save
da: Gem
ru: Сохранить

source: Save As
da: Gem som
ru: Сохранить как

source: Fi&nd what:
da: Fi&nd hvad:
ru: &Найти:

source: Match &whole word only
da: &Sammenlign hele ord
ru: &Только целые слова

source: Match &case
da: Bogstavsstørrelse skal passe
ru: С у&четом регистра

source: &Find Next
da: Find &Næste
ru: Найти &далее

source: Direction
da: Retning
ru: Направление

source: &Up
da: &Op
ru: &Вверх

source: &Down
da: &Ned
ru: Вн&из

source: Rep&lace with:
da: &Erstat med:
ru: За&менить на:

source: &Replace
da: &Erstat
ru: &Заменить

source: Replace
da: Erstat
ru: Замена

source: Replace &All
da: Erstat &alle
ru: Заменить в&се

source: Save %s as
da: Gem %s som
ru: Сохранить %s как

source: "%s" already exists. Do you want to replace it?
da: "%s" findes allerede. Ønsker du at erstatte den?
ru: "%s" уже создан. Хотите заменить его?

source: "%s" File not found. Please verify the correct filename was given.
da: "%s" Fil ikke fundet. Kontroller venligt at filnavnet er korrekt.
ru: "%s" Файл не найден. Пожалуйста, проверьте правильность данного имени файла.

source: "%s" Path not found. Please verify the correct path was given.
da: "%s" Stien ikke fundet. Kontroller venligst, at stien er korrekt.
ru: "%s" Путь не найден. Пожалуйста, проверьте правильность данного пути.

source: Drive %s does not exist. Please verify the correct drive was given.
da: Drevet %s findes ikke. Kontroller venligst, at det blev angivet korrekt.
ru: Диск %s не существует. Пожалуйста, проверьте правильность данного диска.

source: Image format not recognized
da: Billedeformatet kan ikke genkendes
ru: Формат изображения не распознан

source: Invalid handle value for %s
da: Ugyldig handle værdi for %s
ru: Неверное значение дескриптора (handle) для %s

source: Unable to write bitmap
da: Ude af stand til at skrive billede
ru: Не могу записать bitmap

source: All
da: Alle
ru: Все

source: Cannot set Clipped property while painting
da: Kan ikke sætte Clipped egenskaben, mens der tegnes
ru: Не могу установить свойство Clipped во время рисования

source: Invalid LCDNumber value
da: Ugyldig LCDNumber værdi
ru: Неверное значение LCDNumber

source: Failed to delete tab at index %d
da: Ude af stand til at slette faneblad ved indeks %s
ru: Не удалось удалить страницу (tab) с индексом %d

source: %d is an invalid PageIndex value. PageIndex must be between 0 and %d
da: %s er en ugyldig PageIndex værdi. PageIndex skal være mellem 0 og %d
ru: Неверное значение PageIndex (%d). PageIndex должен быть между 0 и %d

source: Invalid item level assignment
da: Ugyldig elementniveau tildeling
ru: Присваивание неверного уровня элемента

source: Invalid level (%d) for item "%s"
da: Ugyldigt niveau (%d) for element "%s"
ru: Неверный уровень (%d) для элемента "%s"

source: MultiLine must be True when TabPosition is tpLeft or tpRight
da: MultiLine skal være Sand, når TabPosition er tpLeft eller tpRight
ru: MultiLine должно быть True, когда TabPosition равно tpLeft или tpRight

source: %s is already in the StatusBar
da: %s er allerede i statusbjælken
ru: %s уже в StatusBar

source: Radio items must have a Controller as a parent
da: Radio elementer skal have en Controller som forælder
ru: Пункты Radio должны иметь Controller как родителя

source: Owner is not a TCustomHeaderSection
da: Ejeren er ikke en TCustomHeaderSection
ru: Владелец - не TCustomHeaderSection

source: Header Section owner must be a TCustomHeaderControl
da: Header Section ejer skal være en TCustomHeaderControl
ru: Владелец Header Section должен быть TCustomHeaderControl

source: Undo
da: &Fortryd
ru: Отменить

source: Redo
da: Omgør
ru: Повторить

source: Cut
da: Klip
ru: Вырезать

source: Copy
da: Kopier
ru: Копировать

source: Paste
da: Indsæt
ru: Вставить

source: Clear
da: Slet
ru: Очистить

source: Select All
da: Vælg alle
ru: Выбрать все

source: Unrecognized movie format
da: Ukendt filmformat
ru: Неизвестный видеоформат

source: Movie not loaded
da: Film ikke indlæst
ru: Видео не загружено

source: Loading...
da: Indlæser...
ru: Загрузка...

source: Fatal error: Cannot create application object in a shared object or library.
da: Fatal fejl: Kan ikke oprette applikationsobjektet i et delt objekt eller bibliotek
ru: Фатальная ошибка: Не могу создать объект приложения в разделенном (shared) объекте или библиотеке.

source: Fatal error: Cannot create more than one TApplication instance
da: Fatal fejl: Kan ikke oprette mere end en TApplicationsinterface
ru: Фатальная ошибка: Не могу создать более одного экземпляра TApplication

source: First record
da: Første post
ru: Первая запись

source: Prior record
da: Forrige post
ru: Предыдущая запись

source: Next record
da: Næste post
ru: Следующая запись

source: Last record
da: Sidste post
ru: Последняя запись

source: Insert record
da: Indsæt post
ru: Вставить запись

source: Delete record
da: Slet post
ru: Удалить запись

source: Edit record
da: Rediger post
ru: Изменить запись

source: Post edit
da: Gem redigering
ru: Сохранить изменения

source: Cancel edit
da: Annuller redigering
ru: Отменить изменения

source: Refresh data
da: Genindlæs data
ru: Обновить данные

source: Delete record?
da: Slet post?
ru: Удалить запись?

source: Delete all selected records?
da: Slet alle markerede poster?
ru: Удалить все выбранные записи?

source: Operation not allowed in a DBCtrlGrid
da: Handling er ikke tilladt i en DBCtrlGrid
ru: Операция не разрешена в DBCtrlGrid

source: Control cannot be used in a DBCtrlGrid
da: Kontrol kan ikke bruges i en DBCtrlGrid
ru: Этот элемент не может использоваться в DBCtrlGrid

source: Property already defined by lookup field
da: Egenskab er allerede defineret af opslagsfelt
ru: Свойство уже определено поисковым (lookup) полем

source: Grid requested to display more than 256 columns
da: Gitter forsøgte at vise mere end 256 kolonner
ru: Таблица (Grid) не может содержать более 256 колонок

source: Remote Login
da: Fjernlogin

source: row error
da: rækkefejl
ru: ошибка строки

source: All Values
da: Alle værdier

source: Move to Row Area
da: Flyt til rækkeområdet

source: Move to Column Area
da: Flyt til kolonneområdet

source: Open Dimension
da: Åbn dimension

source: Drilled In
da: Boret i dybden

source: The information requested could not be loaded.
da: Den forespurgte information kunne ikke indlæses.
ru: Требуемая информация не может быть загружена.

source: No active summaries have been defined.
da: Ingen aktive opsummeringer er blevet defineret.
ru: Не были определены активные итоги.

source: Not enough room available to load a summary.
da: Ikke nok plads til at indlæse en opsummering.
ru: Для загрузки итога не хватает места.

source: No available dimensions have been defined.
da: Ingen tilgængelige dimensioner er blevet defineret.
ru: Не были определены доступные измерения.

source: Not enough space available to load a dimension.
da: Ikke nok plads til at indlæse en dimension.
ru: Для загрузки измерения не хватает места.

source: Template:
da: Skabelon:

source: [Error]
da: [Fejl]
ru: [Ошибка]

source: Inactive Dimensions
da: Inaktive dimensioner

source: Display Data and Subtotals
da: Vis data og subtotaler
ru: Вывод данных и частичных итогов

source: Display Data Only
da: Vis kun data
ru: Вывод только данных

source: Display Subtotals Only
da: Vis kun subtotaler
ru: Вывод только частичных итогов

source: Drill in to this value
da: Bor i dybden med denne værdi

source: Subtotals on/off
da: Subtotaler med/ikke med
ru: Част.итоги вкл/выкл

source: Decision Cube Editor..
da: Decision Cube redigeringsværktøj
ru: Редактор Decision Cube..

source: Decision Query Editor..
da: Decision Forespørgselsredigeringsværktøj..
ru: Редактор Decision Query..

source: Show Detail Records..
da: Vis detaljeposter..
ru: Вывод записей детализации..

source: Unsupported data type : %s
da: Ikke understøttet datatype: %s
ru: Тип данных не поддерживается: %s

source: Row index out of range : %d
da: Rækkeindeks er ugyldig: %d
ru: Индекс строки вышел за границу: %d

source: Column index out of range : %d
da: Kolonneindeks er ugyldig: %d
ru: Индекс столбца вышел за границу: %d

source: Duplicate item in array
da: Dubleret element i rækken
ru: Дубликат элемента массива

source: Array index out of range : %d
da: Rækkeindeks er uden for gyldigt område: %d
ru: Индекс массива вышел за границу: %d

source: The DecisionCube Capacity is low. Please deactivate dimensions or change the data set.
da: DecisionCube kapaciteten er lav. Deaktiver venligst dimensioner eller udskift datasættet.
ru: Ресурсы DecisionCube исчерпаны. Отключите измерения или смените набор данных.

source: Query could not be run. Check that the query, SQL text, and Database are correct.
da: Forespørgslen kan ikke køres. Kontroller at forespørgslen, SQL teksten og databasen er korrekt.
ru: Не могу выполнить запрос. Проверьте правильность Query, кода SQL и БД (Database).

source: Operation not allowed on sorted string list.
da: Handlingen er ikke tilladt på en sorteret liste.
ru: Операция недопустима для отсортированного списка строк

source: String list does not allow duplicates.
da: Tekstlisten tillader ikke dubletter.
ru: Список строк не допускает дубликатов

source: The maximum allowed summaries of %d has been exceeded.
da: Maksimum antal opsummeringer %d er blevet overskredet.
ru: Превышен максимум итогов для %d.

source: General array error.
da: Generel array fejl.
ru: Общая ошибка массива.

source: Illegal Dimension Index
da: Illegalt dimensionsindeks
ru: Неверный индекс измерения
