Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/delphi7.po
Languages: da, ru

source: Received someone else's packet
da: Modtaget en anden's pakke

source: Command not recognized
da: Kommando ikke genkendt
ru: Команда не распознана

source: Goodbye
da: Farvel
ru: До свидания

source: Error: No program code to return request!
da: Fejl: Ingen programkode til at returnere forespørgslen!
ru: Ошибка: Нет кода программы, чтобы возвратить запрос!

source: Invalid syslog message: incorrect PRI section
da: Ugyldig syslog meddelelse: Ukorrekt PRI sektion
ru: Неверное сообщение syslog: неверная секция PRI

source: Invalid syslog message: incorrect PRI number "%s"
da: Ugyldig syslog meddelelse: ukorrekt PRI nummer "%s"
ru: Неверное сообщение syslog: неверный номер PRI "%s"

source: Invalid syslog message: incorrect timestamp "%s"
da: Ukorrekt syslog meddelelse: ukorrekt tidsstempling "%s"
ru: Неверное сообщение syslog: неверный timestamp "%s"

source: Invalid Syslog message: packet too large (%d bytes)
da: Ukorrekt syslog meddelelse: pakke for stor (%d byte)
ru: Неверное сообщение syslog: пакет слишком большой (%d байта(ов))

source: Invalid host name. A SYSLOG host name cannot contain any space ("%s")+
da: Ugyldigt værtsnavn. Et SYSLOG værtsnavn kan ikke indeholde mellemrum ("%s")+
ru: Неверное имя хоста. Имя хоста SYSLOG не может содержать пробелов ("%s")+

source: Mode has not been set.
da: Tilstand er ikke blevet sat.
ru: Режим не установлен.

source: Could not load SSL library.
da: Kunne ikke indlæse SSL biblioteket.
ru: Не могу загрузить библиотеку SSL.

source: SSL connection has dropped.
da: SSL forbindelsen blev tabt.
ru: SSL соединение прервано.

source: SSL certificate request error.
da: SSL certifikat forespørgselsfejl.
ru: Ошибка запроса сертификата SSL.

source: SSL library internal error.
da: Intern fejl i SSL biblioteket.
ru: Внутренняя ошибка библиотеки SSL.

source: Winsock stack
da: Winsock stak

source: Command Not Recognised
da: Kommando ikke genkendt
ru: Команда не распознана

source: Signing Off
da: Afbryder forbindelsen
ru: Выход

source: Start mail input; end with <CRLF>.<CRLF>
da: Start post inddata; afslut med <CRLF>.<CRLF>
ru: Начало ввода письма; конец с <CRLF>.<CRLF>

source: %s Address Okay
da: %s adresse O.k.
ru: %s адрес OK

source: %s Address Error
da: %s adressefejl
ru: %s ошибка адреса

source: User not local, Will forward
da: Bruger er ikke lokal, vil videresende
ru: Пользователь не локальный, будет передано далее

source: Welcome to the INDY SMTP Server
da: Welkommen til Indy SMTP værten
ru: Добро пожаловать в INDY SMTP Сервер

source: Hello %s
da: Hej %s
ru: Здравствуйте, %s

source: Polite people say HELO
da: Høflige folk siger HELO
ru: Вежливые люди говорят HELO

source: Syntax Error - Command not understood: %s
da: Syntaksfejl - Kommando blev ikke forstået: %s
ru: Синтаксическая ошибка - Команда не понята: %s

source: Indy SMTP Server
da: Indy SMTP vært
ru: Indy SMTP Сервер

source: Authentication Failed
da: Autentifikationen fejlede
ru: В авторизации отказано

source: Command Not Handled: %s
da: Kommando blev ikke håndteret: %s
ru: Команда не обработана: %s

source: Uneven size in DecodeToStream.
da: Ulige størrelse i DecodeToStream
ru: Нечетный размер в DecodeToStream.

source: Uneven size in Encode.
da: Ulige størrelse i Encode.
ru: Нечетный размер в Encode.

source: Message decoder not found
da: Meddelelsesdekoder blev ikke fundet
ru: Декодер сообщения не найден

source: Message encoder not found
da: Meddelelseskoder blev ikke fundet
ru: Кодировщик сообщения не найден

source: Unrecognized content trasnfer encoding.
da: Ukendt indholdsoverførselskodning (content transfer encoding).
ru: Неопознанное кодирование содержание передачи.

source: Unrecognized UUE encoding scheme.
da: UUE kodningsskema blev ikke genkendt.
ru: Неопознанное схема UUE кодирования.

source: The supplied IP address is not a valid multicast address [224.0.0.0 to 239.255.255.255].
da: Den angivne IP adresse er ikke en gyldig multicast adresse [224.0.0.0 til 239.255.255.255].
ru: Данный IP адрес - неверный групповой адрес [224.0.0.0 - 239.255.255.255].

source: This function is not supported on Win32.
da: Denne funktion er ikke understøttet af Win32.
ru: Эта функция не поддерживается на Win32.

source: Indy FTP Server ready.
da: Indy FTP vært er parat.
ru: Indy FTP Сервер готов.

source: Data connection already open; transfer starting.
da: Dataforbindelsen er allerede åben; starter overførsel.
ru: Соединение для данных уже открыто; передача начинается.

source: File status okay; about to open data connection.
da: Filestatus er O.k.; påbegynder nu åbning af dataforbindelsen.
ru: Статус файла OK; about to open data connection.

source: %s Command successful.
da: %s kommandoen lykkedes.
ru: %s Команда успешно выполнена.

source: Service ready for new user.
da: Tjenesten er parat til en ny bruger.
ru: Сервис готов для пового пользователя.

source: Service closing control connection.
da: Tjenesten lukker styreforbindelsen.
ru: Сервис закрывает управляющее соединение.

source: Data connection open; no transfer in progress.
da: Dataforbindelsen åben; der er ikke nogen overførsel igang.
ru: Открыто соединение для данных; нет передачи.

source: Closing data connection.
da: Lukker dataforbindelsen
ru: Закрытие соединения для данных.

source: Data connection closed abnormally.
da: Dataforbindelsen lukkede unormalt.
ru: Соединение для данных закрыто аварийно.

source: Entering Passive Mode (%s).
da: Går i passiv tilstand (%s).
ru: Вход в пассивный режим (%s).

source: User logged in, proceed.
da: Bruger logget ind, fortsæt venligst.
ru: Пользователь вошел, продолжаем.

source: Anonymous user logged in, proceed.
da: Anonymous brugeren logget ind, fortsæt venligst.
ru: Анонимный пользователь вошел, продолжаем.

source: Requested file action okay, completed.
da: Den forespurgte filhandling er O.k. og afsluttet.
ru: Требуемое действие с файлом OK, завершено.

source: "%s" created.
da: "%s" er nu oprettet.
ru: "%s" создан.

source: User name okay, need password.
da: Brugernavn er i orden, mangler adgangskode.
ru: Имя пользователя OK, требуется пароль.

source: Anonymous login OK, send e-mail as password.
da: Anonymous login er i orden, send e-post adresse som adgangskode.
ru: Анонимный вход OK, посылается e-mail как пароль.

source: Login with USER first.
da: Log først ind med USER.
ru: Войдите с USER сначала.

source: Need account for login.
da: Har brug for en konto til login.
ru: Требуется учетная запись для входа.

source: Requested file action pending further information.
da: Den forespurgte filhandling mangler yderligere information.
ru: Требуемое действие с файлом в ожидании дополнительной информации.

source: Service not available, closing control connection.
da: Tjenesten er ikke til rådighed, lukker styreforbindelsen.
ru: Сервис не доступен, закрытие управляющего соединения.

source: Can't open data connection.
da: Kan ikke åbne dataforbindelsen.
ru: Не могу открыть соединение для данных.

source: Requested file action not taken.
da: Forespurgt filhandling blev ikke udført.
ru: Требуемое действие с файлом не taken.

source: Requested action aborted: local error in processing.
da: Den forespurgte handling blev afbrudt: lokal fejl ved udførsel.
ru: Требуемое действие прервано: локальная ошибка в процессе.

source: Requested action not taken.
da: Forespurgt handling blev ikke udført.
ru: Требуемое действие не taken.

source: Syntax error, command unrecognized.
da: Syntaksfejl, kommando ikke genkendt.
ru: Синтаксическая ошибка, команда не распознана.

source: "%s" Command not implemented.
da: "%s" kommando ikke implementeret.
ru: "%s" Команда не реализована.

source: Not logged in.
da: Ikke logget ind.
ru: Не вошел.

source: Need account for storing files.
da: Har brug for en konto for at gemme filer.
ru: Требуется учетная запись для сохранения файлов.

source: Requested action aborted: page type unknown.
da: Forespurgt handling blev afbrudt: sidetypen (page type) er ukendt.
ru: Требуемое действие прервано: тип страницы неизвестен.

source: Requested file action aborted.
da: Forespurgt handling blev afbrudt.
ru: Требуемое действие с файлом прервано.

source: Maximum connections limit exceeded. Try again later.
da: Maksim antal forbindelser blev overskredet. Forsøg igen senere.
ru: Превышен лимит количества соединений. Попробуйте снова позже.

source: Type set to %s.
da: Type blev sat til %s.
ru: Тип установлен в %s.

source: Mode set to %s.
da: Tilstand blev sat til %s.
ru: Режим установлен в %s.

source: Structure set to %s.
da: Struktur blev sat til %s.

source: The following SITE commands are supported: HELP DIRSTYLE
da: Følgende SITE kommandoer er understøttet: HELP DIRSTYLE
ru: Следующие SITE команды не поддерживаются: HELP DIRSTYLE

source: %s directory structure.
da: %s filmappestruktur.
ru: %s структура каталогов.

source: End of Status
da: Slut på status
ru: Конец статуса

source: No OnListDirectory event found!
da: Ingen OnListDirectory håndtering fundet!
ru: Не найдено события OnListDirectory!

source: kernel messages
da: kernemeddelelser
ru: сообщения ядра

source: user-level messages
da: brugerniveau meddelelser (user-level)
ru: сообщения уровня пользователя

source: mail system
da: postsystem
ru: почтовая система

source: system daemons
da: systemdæmoner
ru: системные демоны

source: security/authorization messages (1)
da: sikkerheds-/autoriseringsmeddelelser (1)
ru: сообщения защиты/авторизации (1)

source: messages generated internally by syslogd
da: meddelelser lavet internt af syslogd
ru: сообщения, созданные внутри syslogd

source: line printer subsystem
da: linjeskriver undersystem
ru: подсистема строкового принтера

source: network news subsystem
da: nyhedsgruppe undersystem
ru: подсистема сетевых новостей

source: UUCP subsystem
da: UUCP undersystem
ru: подсистема UUCP

source: clock daemon (1)
da: tidsdæmon (1)
ru: демон часов (1)

source: security/authorization messages (2)
da: sikkerheds-/autorisationsmeddelelser (2)
ru: сообщения защиты/авторизации (2)

source: FTP daemon
da: FTP dæmon
ru: демон FTP

source: NTP subsystem
da: NTP undersystem
ru: подсистема NTP

source: log audit
da: log auditering
ru: лог аудит

source: log alert
da: log advarsel

source: clock daemon (2)
da: tidsdæmon (2)
ru: демон часов (2)

source: local use 0 (local0)
da: lokalt brug 0 (local0)

source: local use 1 (local1)
da: lokalt brug 1 (local1)

source: local use 2 (local2)
da: lokalt brug 2 (local2)

source: local use 3 (local3)
da: lokalt brug 3 (local 3)

source: local use 4 (local4)
da: lokalt brug 4 (local4)

source: local use 5 (local5)
da: lokalt brug 5 (local5)

source: local use 6 (local6)
da: lokalt brug 6 (local6)

source: local use 7 (local7)
da: lokalt brug 7 (local7)

source: Unknown or illegale facility code
da: Ukendt eller illegal facilitetskode
ru: Неизвестный или недопустимый код устройства

source: Emergency: system is unusable
da: Nødsituation: systemet er ikke brugbart
ru: Авария: система непригодна для использования

source: Alert: action must be taken immediately
da: Alarm: Der skal med det samme foretages noget
ru: Тревога: действие должно быть taken немедленно

source: Critical: critical conditions
da: Kritisk: Kritisk tilstand
ru: Опасность: состояние опасности

source: Error: error conditions
da: Fejl: Fejltilstand
ru: Ошибка: состояние ошибки

source: Warning: warning conditions
da: Advarsel: advarselstilstand
ru: Предупреждение: состояние предупреждения

source: Notice: normal but significant condition
da: Besked: normaltt, men vigtigt
ru: Замечание: нормальное, но важное состояние

source: Informational: informational messages
da: Information: Ren informationsniveau
ru: Информационно: информационные сообщения

source: Debug: debug-level messages
da: Fejlsøgning: Fejlsøgningsbeskeder
ru: Отладка: сообщения уровня отладки

source: Unknown or illegale security code
da: Ukendt eller illegal sikkerhedskode
ru: Неизвестный или недопустимый код защиты

source: Reply %s on Job ID %s
da: Svar %s på Job ID %s
ru: Ответить %s на Job ID %s

source: IRC Connect Failed
da: IRC forbindelse fejlede
ru: Соединение к IRC не установлено

source: Not connected to server.
da: Ikke forbundet med vært.
ru: Не подключено к серверу.

source: %s Non-visual component for 32-bit Delphi.
da: %s Ikke-visuel komponent for 32-bit Delphi.
ru: %s Не визульный компонент для 32-бит Delphi.

source: Nick
da: Øgenavn

source: username
da: brugernavn

source: Real name
da: Virkeligt navn
ru: Реальное имя

source: Local time is %s
da: Lokal tid er %s
ru: Локальное время - %s

source: Stopped
da: Standset
ru: Остановлен

source: Failed to Start: %s
da: Start fejlede: %s
ru: Ошибка старта: %s

source: Failed to Stop: %s
da: Standsning fejlede: %s
ru: Ошибка остановки: %s

source: Connected
da: Forbundet
ru: Соединен

source: Reconnect at %s: %s
da: Genopkobling %s: %s

source: You cannot set %s while the HL7 Component is working
da: Du kan ikke sætte %s mens HL7 komponenten arbejder
ru: Вы не можете установить %s, пока компонент HL7 работает

source: Attempt to %s while the HL7 Component is not working
da: Forsøg på %s mens HL7 komponenten ikke arbejdede
ru: Попытка %s, пока компонент HL7 работает

source: Interface is unusable due to failure to stop
da: Interfacet er ubrugeligt på grund af at standsning ikke kan lade sig gøre
ru: Интерфейс неиспользуемый из-за ошибки при остановке

source: Interface was already started
da: Interfacet kørte allerede
ru: Интерфейс уже запущен

source: Interface was already stopped
da: Interface var allerede standset
ru: Интерфейс уже остановлен

source: Mode is not initialised
da: Tilstanden er ikke initialiseret
ru: Режим не инициализирован

source: Component is in Asynchronous mode but OnMessageArrive has not been hooked
da: Komponenten er i asynkron tilstand, men OnMessageArrive er ikke blevet sat
ru: Компонент в асинхронном режиме, но OnMessageArrive не привязан

source: Component is in Synchronous mode but OnMessageReceive has not been hooked
da: Komponenten er i synkron tilstand, men OnMessageReceive er ikke blevet sat
ru: Компонент в синхронном режиме, но OnMessageReceive не привязан

source: Assigned Port value %d is invalid
da: Tildelt portværdi %d er ugyldig
ru: Определенный значение Port %d - неверное

source: A message has been received but the commication mode is unknown
da: En meddelelse er blevet modtaget, men kommunikationstilstanden er ukendt
ru: Сообщение было принято, но режим передачи неизвестен

source: Unexpected message arrived to an interface that is not listening
da: Uventet meddelelse ankom til et interface, som ikke lyttede
ru: Неожиданное сообщение прибыло на интерфейс, который не опрашивается

source: Unknown mode
da: Ukendt tilstand
ru: Неизвестный режим

source: Unable to stop client thread
da: Ude af stand til at stande klienttråd
ru: Не могу остановить клиентский поток

source: Send a message
da: Send en besked
ru: Отправить сообщение

source: Server Connection not locatable when sending message
da: Værtsforbindelse kunne ikke findes da det blev forsøgt at sende en meddelelse
ru: Server Connection not locatable, когда отправляется сообщение

source: You cannot send a message while you are still waiting for an answer
da: Du kan ikke sende en meddelelse mens du venter på et svar
ru: Вы не можете отправить сообщение, когда Вы ожидаете ответ

source: Unsupported object type. You can assign only one of the following types or thir descendants: TStrings, TStream.
da: Objekttypen er ikke understøttet. Du kan kun tildele en af følgende typer eller en nedarvning: TStrings, TStream.
ru: Неподдерживаемый тип объекта. Вы можете определить только один из следующих типов или их потомков: TStrings, TStream.

source: Protocol field is empty
da: Protokolfeltet er tomt
ru: Поле Protocol - пустое

source: Host field is empty
da: Værtsfeltet er tomt
ru: Поле Host - пустое

source: You must chain this component to another I/O Handler before using it
da: Du skal kæde denne komponent sammen med en anden I/O håndterer før du kan bruge den
ru: Вы должны связать этот компонент с другим I/O Handler перед его использованием

source: TIdSNPP Mess command only supports single line Messages.
da: TIdSNPP Mes kommando understøtter kun enkeltliniebeskeder.
ru: TIdSNPP Mess команда поддерживает только однострочные сообщения.

source: Cannot call TerminateAndWaitFor on FreeAndTerminate threads
da: Kan ikke kalde TerminateAndWaitFor på FreeAndTerminate tråde
ru: Не могу вызвать TerminateAndWaitFor на FreeAndTerminate потоках

source: Only one data module per application
da: Kun et datamodul per program
ru: Допустим только один модуль данных на приложение

source: No data modules registered
da: Ingen datamoduler er registreret
ru: Не зарегистрировано ни одного модуля данных

source: No dispatcher component found on data module
da: Ingen dispatchkomponent blev fundet på datamodulet
ru: Не найдено ни одного компонента-диспетчера в модуле данных

source: No automatically activated data modules
da: Ingen automatisk aktiverede data moduler
ru: Нет автоматически активированных модулей данных

source: Maximum number of concurrent connections exceeded. Please try again later
da: Maksimum antal samtidige forbindelser blev overskredet. Prøv igen senere
ru: Достигнут максимум конкурирующих соединений. Повторите попытку позже

source: <html><title>Internal Server Error 500</title> <h1>Internal Server Error 500</h1><hr> Exception: %s<br> Message: %s<br></html>
da: <html><title>Intern serverfejl 500</title> <h1>Intern serverfejl 500</h1><hr> Undtagelse: %s<br> Meddelelse: %s<br></html>
ru: <html><title>Внутренняя Ошибка Сервера 500</title> <h1>Внутренняя Ошибка Сервера 500</h1><hr> Исключительная ситуация: %s<br> Сообщение: %s<br></html>

source: <html><title>Document Moved 302</title> <body><h1>Object Moved</h1><hr> This Object may be found <a HREF="%s">here.</a><br> <br></body></html>
da: <html><title>Dokument flyttet 302</title> <body><h1>Objekt flyttet</h1><hr> Dette dokument forefindes muligvis <a HREF="%s">her.</a><br> <br></body></html>
ru: <html><title>Документ перемещен 302</title> <body><h1>Объект перемещен</h1><hr> Этот объект может быть найден <a HREF="%s">здесь.</a><br> <br></body></html>

source: No host
da: Ingen vært

source: Socket read error
da: Socket læsefejl
ru: Ошибка чтения из socket

source: Invalid ISAPI application: %s
da: Ugyldig ISAPI program: %s

source: Unsupported ISAPI Application version: %.8x
da: ISAPI version %.8x er ikke understøttet

source: Call to GetExtensionVersion FAILED. Error Code: %d
da: Kald til GetExtensionVersion FEJLEDE. Fejlkode: %d

source: Error loading ISAPI Application: %s
da: Fejl ved indlæsning af ISAPI program: %s

source: Invalid Redirect parameter
da: Ugyldig omdirigeringsparameter

source: ISAPI Application Error
da: ISAPI programfejl

source: Unknown command
da: Ukendt kommando

source: Unable to not open registry key: %s
da: Ude af stand til at åbne registreringsdatabase nøgle: %s
ru: Не могу открыть ключ реестра: %s

source: Invalid Action %d
da: Ugyldig handling %d
ru: Запрошено неверное действие

source: Exception in InterpretData: %s
da: Undtagelse i InterpretData: %s

source: Invalid data packet
da: Ugyldig datapakke
ru: Неверный пакет данных

source: Bad variant type %x
da: Dårlig varianttype %x
ru: Неподдерживаемый вариантный тип: %s

source: Web App Debugger
da: Web App Fejlsøger
ru: Отладчик Web-приложений

source: <HTML><HEAD><TITLE>Unauthorized</TITLE></HEAD><BODY><H1>Unauthorized</H1>Proper authorization is required for this area. Either your browser does not perform authorization, or your authorization has failed.</BODY></HTML>
da: <HTML><HEAD><TITLE>Uautoriseret</TITLE></HEAD><BODY><H1>Uautoriseret</H1>Korrekt autorisation er påkrævet for dette område. Enten foretager din netlæser ikke autorisation, eller også fejlede den.</BODY></HTML>
ru: <HTML><HEAD><TITLE>Несанкционировано</TITLE></HEAD><BODY><H1>Несанкционировано</H1>Правильная авторизация требуется для этой области. Либо Ваш браузер не поддерживает авторизацию, либо Ваша авторизация - неверная.</BODY></HTML>

source: <HTML><TITLE>The requested URL is forbidden</TITLE><BODY><H1>The requested URL is forbidden</H1><P>HTTP status code: 403</BODY></HTML>
da: <HTML><TITLE>Den forespurgte URL er forbudt</TITLE><BODY><H1>Den forespurgte URL er forbudt</H1><P>HTTP statuskode: 403</BODY></HTML>
ru: <HTML><TITLE>Требуемый URL запрещен</TITLE><BODY><H1>Требуемый URL запрещен</H1><P>Код статуса HTTP: 403</BODY></HTML>

source: <HTML><TITLE>Directory browsing is forbidden</TITLE><BODY><H1>The requested URL is forbidden</H1><P>HTTP status code: 403</BODY></HTML>
da: <HTML><TITLE>Filmappe visning er forbudt</TITLE><BODY><H1>Den angivne URL er forbudt</H1><P>HTTP statuskode: 403</BODY></HTML>
ru: <HTML><TITLE>Просмотр каталогов запрещен</TITLE><BODY><H1>Требуемый URL запрещен</H1><P>Код статуса HTTP: 403</BODY></HTML>

source: <HTML><TITLE>Invalid HTTP request: Method not allowed for HTTP/1.0</TITLE><BODY><H1>Invalid HTTP request: Method not allowed for HTTP/1.0</H1><P>HTTP status code: 400</BODY></HTML>
da: <HTML><TITLE>Ugyldig HTTP forespørgsel: Metoden er ikke tilladt for HTTP/1.0</TITLE><BODY><H1>Ugyldig HTTP forespørgsel: Metoden er ikke tilladt for HTTP/1.0</H1><P>HTTP statuskode: 400</BODY></HTML>
ru: <HTML><TITLE>Неверный HTTP запрос: Метод не допускается для HTTP/1.0</TITLE><BODY><H1>Неверный HTTP запрос: Метод не допускается для HTTP/1.0</H1><P>Код статуса HTTP: 400</BODY></HTML>

source: <TITLE>The requested URL was not found</TITLE><BODY><H1>The requested URL was not found</H1><P>HTTP status code: 404</BODY>
da: <TITLE>Den forespurgte URL blev ikke fundet</TITLE><BODY><H1>Den forespurgte URL blev ikke fundet</H1><P>HTTP statuskode: 404</BODY>

source: <TITLE>Internal Server Error</TITLE><BODY><H1>Internal Server Error</H1><P>HTTP status code: 500<P>HTTP error message: %s</BODY>
da: <TITLE>Intern værtsfejl</TITLE><BODY><H1>Intern værtsfejl</H1><P>HTTP statuskode: 500<P>HTTP fejlbesked: %s</BODY>

source: Invalid Action registration
da: Ugyldig registrering af en Action
ru: Неверная регистрация действия (action)

source: ERROR
da: FEJL

source: RESPONSE
da: SVAR

source: Event
da: Hændelse

source: Time
da: Tid
ru: Время

source: Date
da: Dato
ru: Дата изменения

source: Elapsed
da: Udløbet

source: Path
da: Sti

source: Code
da: Kode

source: Content Length
da: Indholdslængde

source: Content Type
da: Indholdstype

source: Thread
da: Tråd

source: (none)
da: (ingen)
ru: (нет)

source: Receive
da: Modtage

source: %s %s Error: (%d)%s
da: %s %s Fejl: (%d)%s
ru: %s %s Ошибка: (%d)%s

source: Build
da: Byg

source: <HTML><HEAD><TITLE>Directory of %s</TITLE></HEAD><BODY><H1>Directory of %0:s</H1>
da: <HTML><HEAD><TITLE>Filmappen %s</TITLE></HEAD><BODY><H1>Filmappen %0:s</H1>
ru: <HTML><HEAD><TITLE>Каталог %s</TITLE></HEAD><BODY><H1>Каталог %0:s</H1>

source: Up to <A HREF="%s">%0:s</A> <UL>
da: Op til <A HREF="%s">%0:s</A> <UL>

source: Up to <A HREF="%s">root directory</A> <UL>
da: Op til <A HREF="%s">rodmappen</A> <UL>
ru: Вверх в <A HREF="%s">корневой каталог</A> <UL>

source: <LI><A HREF="%s">%s</A> (%d bytes)
da: <LI><A HREF="%s">%s</A> (%d byte)
ru: <LI><A HREF="%s">%s</A> (%d байт)

source: Data set field is blank
da: Datasætfeltet er tomt
ru: Поле набора данных (Data set) - пустое

source: Data set field not found: %s
da: Datasætfeltet ikke fundet: %s
ru: Поле набора данных (Data set) не найдено: %s

source: Field is not a dataset field: %s
da: Feltet er ikke et datasæt felt: %s
ru: Поле %s - не поле набора данных (dataset)

source: %s: missing XMLBroker
da: %s: mangler XMLBroker
ru: %s: не указан XMLBroker

source: %0:s: Field "%1:s" not found
da: %0:s: Felt "%1:s" ikke fundet
ru: %0:s: Поле "%1:s" не найдено

source: Submit
da: Send

source: Reset
da: Nulstil

source: Apply Updates
da: Anvend opdateringer

source: Invalid parent
da: Ugyldig forælder
ru: Неверный родитель
