Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/delphi7.po
Languages: da, ru

source: The context has expired and can no longer be used.
da: Kontakten er udløbet og kan ikke længere bruges.
ru: Контекст потерял силу и не может далее использоваться.

source: The supplied message is incomplete. The signature was not verified.
da: Den leverede besked er ikke komplet. Signaturen blev ikke verificeret.
ru: Данное сообщение - незавершенное. Сигнатура не была проверена.

source: The credentials supplied were not complete, and could not be verified. The context could not be initialized.
da: Rettighederne (credentials) var ikke komplette, og kunne ikke verificeres. Konteksten kunne ikke oprettes.
ru: Данные полномочия - неполные, и не были проверены. Контекст не был инициализирован.

source: The buffers supplied to a function was too small.
da: Bufferne givet til funktionen var for små.
ru: Буффера, предоставленные функции, были слишком малы.

source: The credentials supplied were not complete, and could not be verified. Additional information can be returned from the context.
da: Rettighederne (credentials) som blev givet var ikke komplette, og kunne ikke verificeres. Yderligere informationer kan fås af konteksten.
ru: Данные полномочия - неполные, и не были проверены. Дополнительная информация может быть получена из контекста.

source: The context data must be renegotiated with the peer.
da: Kontekst data skal genaftales med modparten.

source: The target principal name is incorrect.
da: Det principielle navn for målet er ikke korrekt (target principal name).

source: There is no LSA mode context associated with this context.
da: Der er ingen LSA mode kontekst tilknyttet denne kontekst.

source: The clocks on the client and server machines are skewed.
da: Urene på klient- og værtsmaskine går ikke ens.
ru: Время на часах клиентской и серверной машин отличается.

source: The certificate chain was issued by an untrusted authority.
da: Certifikatskæden blev givet af en ubetroet autoritet

source: The message received was unexpected or badly formatted.
da: Meddelelsen der blev modtaget var uventet eller dårligt formateret.
ru: Полученное сообщение было неожиданным или неверно отформатированным.

source: An unknown error occurred while processing the certificate.
da: En ukendt fejl skete mens certifikatet blev analyseret.
ru: Неизвестная ошибка возникла во время обработки сертификата.

source: The received certificate has expired.
da: Certifikatet der blev modtaget er udløbet.
ru: Полученный сертификат потерял силу.

source: The specified data could not be encrypted.
da: De angivne data kan ikke krypteres.
ru: Указанные данные не должны быть зашифрованы.

source: The specified data could not be decrypted.
da: De angive data kan ikke dekrypteres.
ru: Указанные данные не должны быть расшифрованы.

source: The client and server cannot communicate, because they do not possess a common algorithm.
da: Klienten og værten kan ikke kommunikere, eftersom der ikke findes en fælles algoritme for dem begge.
ru: Клиент и сервер не могут общаться, потому что они не обладают общим алгоритмом.

source: The security context could not be established due to a failure in the requested quality of service (e.g. mutual authentication or delegation).
da: Sikkerhedskonteksten kan ikke oprettes på grund af en fejl i den forespurgte servicekvalitet (QoS).
ru: Контекст защиты не может быть созданe из-за сбоя в требуемом свойстве сервиса (например, взаимное опознавание или делегирование).

source: Unknown error
da: Ukendt fejl
ru: Неизвестная ошибка

source: SSPI %s returns error #%d(0x%x): %s
da: SSPI %s returnerer fejl #%d(0x%x): %s
ru: SSPI %s вернула ошибку #%d(0x%x): %s

source: SSPI interface has failed to initialise properly
da: SSPI interface fejlede ved opstart
ru: Интерфейс SSPI не смог инициализироваться правильно

source: No PSecPkgInfo specified
da: Ingen PSecPkgInfo blev angivet
ru: PSecPkgInfo не указан

source: No credential handle acquired
da: Ingen credential handle opnået

source: Can not change credentials after handle aquired. Use Release first
da: Kan ikke ændre rettigheder (credentials) efter at håndtag blev fremskaffet. Brug først release
ru: Не могу изменить полномочия после handle aquired. Используйте сначала Release

source: Unknown credentials use
da: Ukendt rettighedsproblem (credentials)

source: Do AcquireCredentialsHandle first
da: Først brug AcquireCredentialsHandle
ru: Сделайте сначала AcquireCredentialsHandle

source: CompleteAuthToken is not supported
da: CompleteAuthToken understøttes ikke
ru: CompleteAuthToken не поддерживается

source: Incorrect length in received block
da: Ukorrekt længde i modtaget blok
ru: Неправильный размер в принятом блоке

source: Unknown
da: Ukendt
ru: Неизвестен

source: Unknown FTP listing format
da: Ukendt FTP listningsformat
ru: Неизвестный формат листинга FTP

source: Connection established
da: Forbindelsen blev etableret
ru: Соединение установлено

source: Starting FTP transfer
da: Starter FTP overførsel
ru: Начало передачи по FTP

source: Transfer complete
da: Overførsel færdig
ru: Передача закончена

source: Transfer aborted
da: Overførsel afbrudt
ru: Передача прервана

source: %s is corrupt.
da: %s er korrupt.
ru: %s поврежден.

source: %s is not a valid service.
da: %s er ikke en gyldig tjeneste.
ru: %s - неверная служба.

source: Socket Error # %d %s
da: Socketfejl # %d %s
ru: Ошибка socket # %d %s

source: Interrupted system call.
da: Afbrudt systemkald.
ru: Прерванный системный вызов.

source: Bad file number.
da: Dårligt filnummer.
ru: Неверный номер файла.

source: Access denied.
da: Adgang nægtet.
ru: В доступе отказано.

source: Bad address.
da: Dårlig adresse.
ru: Неверный адрес.

source: Invalid argument.
da: Ugyldigt argument.
ru: Неверный аргумент.

source: Too many open files.
da: For mange åbne filer.
ru: Слишком много открытых файлов.

source: Operation would block.
da: Handlingen ville blokere.

source: Operation now in progress.
da: Handlingen er nu i gang.
ru: Операция сейчас выполняется.

source: Operation already in progress.
da: Handlingen er allerede i gang.
ru: Операция уже выполняется.

source: Socket operation on non-socket.
da: Socket handling på en ikke-socket.
ru: Socket операция на non-socket.

source: Destination address required.
da: Destinationsadressen er påkrævet.
ru: Требуется адрес приемника.

source: Message too long.
da: Meddelelsen er for lang.
ru: Сообщение слишком длинное.

source: Protocol wrong type for socket.
da: Protokoltypen er forkert for socket.
ru: Неверный тип протокола для socket.

source: Bad protocol option.
da: Dårlig protokolindstilling.
ru: Неверная опция протокола.

source: Protocol not supported.
da: Protokollen er ikke supporteret.
ru: Протокол не поддерживается.

source: Socket type not supported.
da: Sockettype er ikke supporteret.
ru: Тип socket'а не поддерживается.

source: Operation not supported on socket.
da: Denne handling understøttes ikke af denne socket.
ru: Операция не поддерживается на socket.

source: Protocol family not supported.
da: Protokolfamilien er ikke understøttet.
ru: Семейство протоколов не поддерживается.

source: Address family not supported by protocol family.
da: Adressefamilien støttes ikke af protokolfamilien.
ru: Семейство адресов не поддерживается семейством протоколов.

source: Address already in use.
da: Adressen bruges allerede.
ru: Адрес уже используется.

source: Cannot assign requested address.
da: Kan ikke tilknytte den forespurgte adresse.
ru: Не могу присвоить требуемый адрес.

source: Network is down.
da: Netværket er nede.
ru: Сеть не работает.

source: Network is unreachable.
da: Netværket kan ikke nås.
ru: Сеть недоступна.

source: Net dropped connection or reset.
da: Netværket mistede forbindelsen eller blev nustillet.
ru: Сеть сбросила соединение.

source: Software caused connection abort.
da: Programmellet medførte en afbrydelse af forbindelsen.
ru: Программное обеспечение вызвало аварийное прекращение работы соединения.

source: Connection reset by peer.
da: Forbindelsen blev nulstillet af modparten.
ru: Сброс соединения by peer.

source: No buffer space available.
da: Ingen stødpudeplads til rådighed.
ru: Нет доступного места для буфера.

source: Socket is already connected.
da: Socket er allerede forbundet.
ru: Socket уже соединен.

source: Socket is not connected.
da: Socket er ikke forbundet.
ru: Socket не соединен.

source: Cannot send or receive after socket is closed.
da: Kan ikke sende eller modtage efter at socket er lukket.
ru: Не могу посылать и принимать после закрытия socket.

source: Too many references, cannot splice.
da: For mange referencer, kan ikke opdele.
ru: Слишком много отношений, не могу соединить.

source: Connection timed out.
da: Forbindelsen fik et tidsudløb.
ru: Соединение превысило время.

source: Connection refused.
da: Forbindelsen blev nægtet.
ru: Соединение прервано.

source: Too many levels of symbolic links.
da: For mange niveauer af symbolske referencer.
ru: Слишком много уровней символических ссылок.

source: File name too long.
da: Filnavnet er for langt.
ru: Имя файла слишком длинное.

source: Host is down.
da: Værten (eng. Host) er nede.
ru: Хост не работает.

source: No route to host.
da: Ingen rute til værten.
ru: Нет маршрута к хосту.

source: Directory not empty
da: Filmappen er ikke tom
ru: Каталог не пуст

source: Too many processes.
da: For mange processer.
ru: Слишком много процессов.

source: Too many users.
da: For mange brugere.
ru: Слишком много пользователей.

source: Disk Quota Exceeded.
da: Diskkvota overskredet.
ru: Превышен лимит места на диске.

source: Stale NFS file handle.
da: Stale NFS filhåndtag.
ru: Устаревший дескриптор (handle) NFS файла.

source: Too many levels of remote in path.
da: For mange niveauer af remote i stien.
ru: Слишком много уровней удаленных (remote) в пути.

source: Network subsystem is unavailable.
da: Netværksundersystem er ikke til rådighed.
ru: Сетевая подсистема недоступна.

source: WINSOCK DLL Version out of range.
da: WINSOCK DLL version er forkert.
ru: Версия WINSOCK DLL вышла за границы.

source: Winsock not loaded yet.
da: Winsock er ikke indlæst endnu.
ru: Winsock еще не загружен.

source: Host not found.
da: Værten blev ikke fundet.
ru: Хост не найден.

source: Non-authoritative response (try again or check DNS setup).
da: Ikke-autoritativt svar (prøv igen eller kontroller DNS opsætning)
ru: Ненадежный ответ (попытайтесь снова или проверьте настройки DNS).

source: Non-recoverable errors: FORMERR, REFUSED, NOTIMP.
da: Fejl uden mulighed for genopretning: FORMERR, REFUSED, NOTIMP.
ru: Неисправляемые ошибки: FORMERR, REFUSED, NOTIMP.

source: Valid name, no data record (check DNS setup).
da: Gyldigt navn, ingen datapost (kontroller DNS opsætning).
ru: Верное имя, нет записи данных (проверьте настройки DNS).

source: command not recognized
da: kommando blev ikke forstået
ru: команда не распознана

source: %s is not a Gopher+ server
da: %s er ikke en Gopher+ vært
ru: %s - не сервер Gopher+

source: DNS Server Reports Query Format Error
da: DNS svarer med fejl i forespørgselsformatet

source: DNS Server Reports Query Server Error
da: DNS svarer med fejl i forespørgselsværten

source: DNS Server Reports Query Name Error
da: DNS svarer med fejl i navn

source: DNS Server Reports Query Not Implemented Error
da: DNS svarer at den ikke har implementeret forespørgslen

source: DNS Server Reports Query Refused Error
da: DNS nægter at håndtere forespørgslen

source: Server Returned Unknown Error
da: Værten returnerede en ukendt fejl
ru: Сервер возвратил неизвестную ошибку

source: TimedOut
da: Tidsudløb

source: MF is an Obsolete Command. USE MX.
da: MF er en udgået kommando. Brug MX.
ru: MF - устаревшая команда. Используйте MX.

source: MD is an Obsolete Command. Use MX.
da: MD er en udgående kommando. Brug MX.
ru: MD - устаревшая команда. Используйте MX.

source: MailA is an Obsolete Command. USE MX.
da: MailA er en udgående kommando. Brug MX.
ru: MailA - устаревшая команда. Используйте MX.

source: -Err 501 MailB is not implemented
da: -Err 501 MailB er ikke implementeret
ru: -Err 501 MailB не выполнена

source: Invalid Query Count %d
da: Udgyldigt forespørgselsantal %d
ru: Неверное число запросов %d

source: Invalid Packet Size %d
da: Ugyldig pakkestørrelse %d
ru: Неверный размер пакета %d

source: Received Packet is too small. Less than 4 bytes %d
da: Den modtagne pakke er for lille, mindre end 4 byte %d
ru: Принятый пакет слишком мал. Менее 4 байт %d

source: Invalid Header Id %d
da: Ugyldig hoved id %d
ru: Неверный Id заголовка %d

source: Received Packet is too small. Less than 12 bytes %d
da: Modtaget pakke er for lille, mindre end 12 byte %d
ru: Принятый пакет слишком мал. Менее 12 байт %d

source: Received Packet is too small. %d
da: Modtaget pakke er for lille. %d
ru: Принятый пакет слишком мал. %d

source: Data file saved to %s
da: Datafil gemt til %s
ru: Файл данных сохранен в %s

source: Control file save to %s
da: Styrefil gemt til %s
ru: Контрольный файл сохранен в %s

source: Directory %s does not exist
da: Filmappen %s findes ikke
ru: Каталог %s не создан

source: Winshoes LPD Server %s
da: Winshoes LPD vært %s

source: Server status: active
da: Værtsstatus: aktiv
ru: Сервер статус: активен

source: Queue %s status: %s
da: Kø %s status: %s
ru: Статус очереди %s: %s

source: closing connection
da: lukker forbindelsen
ru: закрытие соединения

source: Unknown queue %s
da: Ukendt kø %s
ru: Неизвестная очередь %s

source: connected with %s
da: forbundet med %s
ru: соединен с %s

source: abort job
da: afbryd job
ru: сброс работы

source: Receive control file
da: Modtage styrefil
ru: Прием контрольного файла

source: Receive data file
da: Modtage datafil
ru: Прием файла данных

source: Error: no queues defined
da: Fejl: Ingen køer defineret
ru: Ошибка: очереди не определены

source: Unexpected operation from %s:%d
da: Uventet handling fra %s:%d
ru: Неожиданная операция из %s:%d

source: Unsupported transfer mode: "%s"
da: Overførselsmetode understøttes ikke: "%s"
ru: Неподдерживаемый режим передачи: "%s"

source: Unable to complete write request, progress halted at %d bytes
da: Ude af stand til at færdiggøre skriveforespørgsel, standsede ved %d byte
ru: Не могу завершить запись запроса, процесс прерван на %d байтах

source: Unable to open %s
da: Ude af stand til at åbne %s
ru: Не могу открыть %s

source: Access to %s denied
da: Adgang nægtet til %s
ru: Доступ к %s запрещен

source: Invalid Text count. TIdText must be greater than 1
da: Udgyldigt tekstantal. TIdText skal være større end 1
ru: Неверное количество Text. TIdText должен быть больше 1

source: TIdMessagePart can not be created. Use descendant classes.
da: TIdMessagePart kan ikke oprettes. Brug nedarvede klasser.
ru: TIdMessagePart не может быть создан. Используйте классы-потомки.

source: Error saving attachment.
da: Fejl ved gemning af vedhæftelse.
ru: Ошибка сохранения вложения.

source: not specified
da: ikke angivet
ru: не определен

source: Unrecognized POP3 Response Header: "%s"
da: Ukendt POP3 Svar: "%s"

source: Server do not support APOP (no timestamp)
da: Værten understøtter ikke APOP (ingen tidsstempling)

source: Unable to execute command, wrong connection state;Current connection state: %s.
da: Ude af stand til at udføre kommando, forkert forbindelsestilstand;Nuværende tilstand: %s.
ru: Не могу выполнить команду, неверное состояние соединения;Текущее состояние соединения: %s.

source: Unrecognized IMAP4 Response Header.
da: IMAP4 svar ikke forstået.
ru: Неопознанный заголовок ответа IMAP4.

source: Any
da: Hvilkensomhelst
ru: Любой

source: Non Authenticated
da: Ikke autentificeret
ru: Неопознанный

source: Authenticated
da: Autentificeret
ru: Опознанный

source: Selected
da: Markeret
ru: Выбранный

source: Username:
da: Brugernavn:
ru: Имя:

source: Password:
da: Adgangskode:
ru: Пароль:

source: Invalid Login.
da: Ugyldigt login.
ru: Неверный вход в систему.

source: Allowed login attempts exceeded, good bye.
da: Tilladt antal loginforsøg er overskredet. Farvel.
ru: Превышено число разрешенных попыток входа, до свидания.

source: No authentication handler has been specified.
da: Der er ikke angivet nogen autentifikationshåndterer.
ru: Не определен обработчик идентификации.

source: OnDataAvailable event is nil.
da: OnDataAvailable handling er nil.
ru: Событие OnDataAvailable равно nil.

source: server not responding
da: værten svarer ikke
ru: сервер не отвечает

source: Server did not respond.
da: Værten svarede ikke.
ru: Сервер не ответил.

source: The string %s does not translate into a valid IP.
da: Teksten %s kan ikke oversættes til et gyldigt IP nummer.
ru: Строка %s не переводится в правильный IP.

source: Invalid network mask.
da: Ugyldig netværksmaske.
ru: Неверная маска сети.

source: Invalid value length: Should be 32.
da: Ugyldig værdilængde: Skulle være 32.
ru: Неверная длина значения: Должно быть 32.

source: There is too many IP addresses in the specified range (%d) to be displayed at design time.
da: Der er for mange IP adresser i det angivne område (%d) til at de kan vises på designtidspunktet.
ru: Слишком много IP адресов в указанном диапазоне (%d) отобразится в design time.

source: Reply Timed Out: The server did not return a response and the query has been abandoned
da: Tidsudløb for svar: Værten returnerede ikke et svar og forespørgslen er forladt
ru: Истекло время ожидания ответа: Сервер не возвратил ответ и запрос был отвергнут

source: Invalid Port: The foreign or local port is not specified correctly or invalid
da: Ugyldig port: Den lokale eller fjerne port er ikke angivet korrekt eller ugyldig
ru: Неверный порт: Внешний или локальный порт неправильно определен или неверный

source: No User: Port pair is not used or not used by an identifiable user
da: Ingen bruger: Portpar er ikke brugt eller ikke brugt af en identificerbar bruger
ru: Нет пользователя: Пара портов не используется или не используется опознанным пользователем

source: Hidden User: Information was not returned at a user's request
da: Skjult bruger: Informationen blev ikke returneret på grund af en bruger's forespørgsel
ru: Невидимый пользователь: Информация не была возвращена по запросу пользователя

source: Unknown or other error: Can not determine owner, other error, or the error can not be revealed.
da: Ukendt eller anden fejl: Kan ikke afgøre ejer, anden fejl, eller fejlen kan ikke afsløres.
ru: Неизвестная или другая ошибка: Не могу определить владельца, либо ошибка, или необнаруженная ошибка.

source: About
da: Om programmet
ru: О Indy

source: About Internet &Direct (Indy) %s...
da: Om Internet &Direct (Indy) %s...
ru: О Internet &Direct (Indy) %s...

source: For the latest updates and information please visit:
da: For de seneste opdateringer og informationer, besøg:
ru: Для получения обновлений и информации посетите, пожалуйста:

source: Project Coordinator
da: Projektkoordinator
ru: Координатор проекта

source: Project Co-Coordinator
da: Projekt ko-koordinator
ru: СоКоординатор проекта

source: Documentation Coordinator
da: Dokumentationskoordinator
ru: Координатор документации

source: Demos Coordinator
da: Demonstrationskoordinator
ru: Координатор демо

source: Distribution Coordinator
da: Distributionskoordinator
ru: Координатор дистрибуции

source: Retired/Past Contributors
da: Pensionerede/foregående bidragydere
ru: Ушедшие/Прошлые помощники

source: Binding Editor
da: Binding redigering
ru: Редактор связей

source: &Add
da: &Tilføj
ru: &Добавить

source: &Remove
da: &Fjern
ru: &Удалить

source: &Bindings
da: &Bindinger
ru: &Связи

source: &IP Address
da: &IP adresse
ru: &IP адрес

source: Call to %s.GetByte [property Bytes] with index <> [0..%d]
da: Kald til %s.GetByte [property Bytes] med indeks <> [0..%d]
ru: Вызов к %s.GetByte [property байт] с индексом <> [0..%d]

source: Error in transformation before send
da: Fejl ved transformation før afsendelse
ru: Ошибка в преобразовании перед посылкой

source: Transform failed
da: Transformation fejlede
ru: Ошибка преобразования

source: CRC Failed
da: CRC fejlede
ru: Ошибка CRC

source: Connecting
da: Forbinder
ru: Соединение

source: Disconnect
da: Afbryder
ru: Отключение

source: Cannt connect to the Master server
da: Kan ikke forbinde til mestervært
ru: Не могу подключиться к Master серверу

source: Do not allow connctions now
da: Tillad ikke forbindelser nu
ru: Сейчас не разрешены соединения

source: Message type recognition error
da: Fejl ved genkendelse af meddelelsestype
ru: Ошибка распознания типа сообщения

source: Message handling failed
da: Meddelelseshåndtering fejlede
ru: Ошибка обработки сообщения

source: Interpretation of message failed
da: Fortolkning af meddelelsen fejlede
ru: Ошибка интерпретации сообщения

source: Custom message interpretation failed
da: Specielt lavet meddelelsesforeståelse fejlede
ru: Ошибка интерпретации произвольного сообщения

source: Request rejected or failed.
da: Forespørgslen blev afvist eller fejlede.
ru: Запрос отвергнут или не выполнен.

source: Request rejected because SOCKS server cannot connect.
da: Forespørgslen fejlede fordi SOCKS værten ikke kan forbinde.

source: Request rejected because the client program and identd report different user-ids.
da: Forespørgslen fejlede fordi klientprogrammet og identd rapporterer forskellige brugerid'ere.

source: Unknown socks error.
da: Ukendt socks fejl.
ru: Неизвестная ошибка socks.

source: Socks server did not respond.
da: Socksværten svarede ikke.
ru: Socks сервер не отвечает.

source: Invalid socks authentication method.
da: Ugyldig socks autentifikationsmetode.
ru: Неверный метод socks аутентификации.

source: Authentication error to socks server.
da: Autentifikationsfejl til socksvært.
ru: Ошибка аутентификации на socks сервере.

source: General SOCKS server failure.
da: Generel SOCKS vært fejl.
ru: Общая ошибка SOCKS сервера.

source: Connection not allowed by ruleset.
da: Forbindelse er ikke tilladt ifølge regelsæt.
ru: Соединение не разрешено набором правил (ruleset).

source: Network unreachable.
da: Netværket kan ikke nås.
ru: Сеть недоступна.

source: Host unreachable.
da: Værten kan ikke nås.
ru: Хост недоступен.

source: TTL expired.
da: TTL udløb.
ru: TTL истекло.

source: Command not supported.
da: Kommando er ikke understøttet.
ru: Команда не поддерживается.

source: Address type not supported.
da: Adressetypen er ikke understøttet.
ru: Тип адреса не поддерживается.

source: Destination file already exists.
da: Destinationsfilen findes allerede.
ru: Файл-приемник уже создан.

source: Error accepting connection with SSL.
da: Fejl ved modtagelse af SSL forbindelse.
ru: Ошибка допуска соединения с SSL.

source: Error connecting with SSL.
da: Fejl ved oprettelse af SSL forbindelse.
ru: Ошибка соединения с SSL.

source: SetCipher failed.
da: SetCipher fejlede.
ru: Ошибка SetCipher.

source: Error creating SSL context.
da: Fejl ved oprettelse af SSL kontekst.
ru: Ошибка создания SSL контекста.

source: Could not load root certificate.
da: Kunne ikke indlæse rodcertifikat.
ru: Не могу загрузить root сертификат.

source: Could not load certificate.
da: Kunne ikke indlæse certifikat.
ru: Не могу загрузить сертификат.

source: Could not load key, check password.
da: Kunne ikke indlæse nøgle, kontroller adgangskoden.
ru: Не могу загрузить ключ, проверьте пароль.

source: Error geting SSL method.
da: Fejl ved henting af SSL metode.
ru: Ошибка получения SSL метода.

source: Error binding data to SSL socket.
da: Fejl ved binding af data til SSL socket.
ru: Ошибка привязки данных к SSL socket.

source: &New Message Part...
da: &Ny meddelelsesdel...

source: Extra Headers Text Editor
da: Ekstra hovedsektioner tekstredigeringsværktøj

source: Body Text Editor
da: Kropstekstredigeringsværktøj

source: Not enough bytes received
da: Ikke modtaget nok byte
ru: Получены не все байты

source: Non-echo type response received
da: Ikke-ekko type svar modtaget
