Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/delphi5.po
Languages: pt_br

source: Tab style incompatible with current tab position
pt_br: Estilo da aba incompatível com a posição da aba corrente

source: A component named %s already exists
pt_br: Nome duplicado '%s' em %s

source: ''%s'' is not a valid component name
pt_br: ''%s'' não é um nome válido para um componente

source: A class named %s already exists
pt_br: Uma classe chamada %s já existe

source: %s has not been registered as a COM class
pt_br: %s não foi registrado como uma classe COM

source: ''%s'' is not a valid integer value
pt_br: ''%s'' não é um valor inteiro válido

source: Line too long
pt_br: Linha muito longa

source: Invalid property value
pt_br: Propriedade Value inválida

source: Invalid property path
pt_br: Propriedade Path inválida

source: Invalid property type: %s
pt_br: Propriedade Type inválida: %s

source: Invalid property element: %s
pt_br: Propriedade Element inválida: %s

source: Property does not exist
pt_br: Propriedade não existe

source: Property is read-only
pt_br: Esta propriedade é somente-para-leitura

source: Error reading %s%s%s: %s
pt_br: Erro lendo %s%s%s: %s

source: Ancestor for '%s' not found
pt_br: Ancestrau para '%s' não encontrado

source: Bitmap image is not valid
pt_br: Bitmap não é válido

source: Icon image is not valid
pt_br: Ícone não é válido

source: Metafile is not valid
pt_br: Metafile não é válido

source: Invalid pixel format
pt_br: Formato de pixel inválido

source: Bitmap is empty
pt_br: Este Bitmap está vazio

source: Scan line index out of range
pt_br: Procura de indexador de linha fora de faixa

source: Cannot change the size of an icon
pt_br: Impossível alterar o tamanho de um icone

source: Invalid operation on TOleGraphic
pt_br: Operação inválida em TOleGraphic

source: Unknown picture file extension (.%s)
pt_br: Extenção de arquivo de imagem desconhecida (.%s)

source: Unsupported clipboard format
pt_br: Formato não suportado

source: Out of system resources
pt_br: Sistema sem recursos

source: Canvas does not allow drawing
pt_br: O canvas não esta permitindo desenhar

source: Invalid image size
pt_br: Tamanho de imagem inválido

source: Too many images
pt_br: Muitas imagens

source: Image dimensions do not match image list dimensions
pt_br: Dimensões da imagem diferente da lista de imagens

source: Invalid ImageList
pt_br: ImageList inválido

source: Unable to Replace Image
pt_br: Impossibilitado de trocar a imagem

source: Invalid ImageList Index
pt_br: Indexador do ImageList inválido

source: Failed to read ImageList data from stream
pt_br: Falha ao ler os dados do ImageList para o fluxo

source: Failed to write ImageList data to stream
pt_br: Falha ao gravar dados no ImageList para o fluxo

source: Error creating window device context
pt_br: Erro ao criar a janela de contexto do dispositivo

source: Client of TDrag not initialized
pt_br: Cliente do TDrag não inicializado

source: Error creating window class
pt_br: Erro criando a classe da janela

source: Error creating window
pt_br: Erro criando a janela

source: Cannot focus a disabled or invisible window
pt_br: Não é possível focar uma janela invisível ou não permitida

source: Control '%s' has no parent window
pt_br: Controle '%s' não tem antecessor na janela

source: Cannot hide an MDI Child Form
pt_br: Não é possível esconder um formulário filho MDI

source: Cannot change Visible in OnShow or OnHide
pt_br: Não é possível trocar a propriedade Visible em OnShow ou OnHide

source: Cannot make a visible window modal
pt_br: Não é possível marcar uma janela visível como modal

source: Scrollbar property out of range
pt_br: Propriedade Scrollbar fora de faixa

source: %s property out of range
pt_br: Propriedade %s fora de faixa

source: Menu index out of range
pt_br: Índice de menu fora de faixa

source: Menu inserted twice
pt_br: Menu inserido duas vezes

source: Sub-menu is not in menu
pt_br: Sub-menu não está em um menu

source: Not enough timers available
pt_br: Não há timers suficientes

source: Printer is not currently printing
pt_br: Impressora não está imprimindo agora

source: Printing in progress
pt_br: Impressão em progresso

source: Printer index out of range
pt_br: Indice da impressora fora de faixa

source: Printer selected is not valid
pt_br: Impressora selecionada não é válida

source: %s on %s
pt_br: %s em %s

source: GroupIndex cannot be less than a previous menu item's GroupIndex
pt_br: GroupIndex não pode ser menor que o ítem de menu anterior ao GroupIndex

source: Cannot have more than one MDI form per application
pt_br: Não é possível ter mais que um formulário MDI por aplicação

source: Cannot create form. No MDI forms are currently active
pt_br: Não é possível criar formulário. Não há formulários MDI ativos neste momento

source: Invalid component registration
pt_br: Registro de componete inválido

source: Can only modify an image if it contains a bitmap
pt_br: Não é possível modificar um TImage que contém um bitmap

source: A control cannot have itself as its parent
pt_br: Um controle não pode ter ele mesmo como seu antecessor

source: Cancel
pt_br: Cancelar

source: &Yes
pt_br: &Sim

source: &No
pt_br: &Não

source: &Help
pt_br: &Ajuda

source: &Close
pt_br: &Fechar

source: &Ignore
pt_br: &Ignorar

source: &Retry
pt_br: &Repetir

source: Abort
pt_br: Abortar

source: &All
pt_br: &Todos

source: Cannot drag a form
pt_br: Não é possível arrastar um formulário

source: PutObject to undefined item
pt_br: PutObject não definido para ítem

source: Could not load CARDS.DLL
pt_br: Não foi possível carregar CARDS.DLL

source: Duplicate CardId found
pt_br: Encontrada uma duplicata de CardId

source: Cannot load older version of TShape
pt_br: Não posso carregar uma versão antiga de TShape

source: Enhanced Metafiles
pt_br: Metafiles realçado

source: Icons
pt_br: Ícone

source: Grid too large for operation
pt_br: Grid muito larga para esta operação

source: Too many rows or columns deleted
pt_br: Muitas linhas ou colunas deletadas

source: Grid index out of range
pt_br: Índice do grid fora de faixa

source: Fixed column count must be less than column count
pt_br: Contador de colunas fixas deve ser menor ou igual que o número de colunas

source: Fixed row count must be less than row count
pt_br: Contador de linhas fixas deve ser menor ou igual ao número de linhas

source: Cannot insert or delete rows from grid
pt_br: Não é possível inserir ou deletar linhas da grade

source: %s on line %d
pt_br: %s na linha %d

source: Identifier expected
pt_br: Identificado aguardado

source: String expected
pt_br: String aguardada

source: Number expected
pt_br: Numero aguardado

source: ''%s'' expected
pt_br: ''%s'' aguardado(a)

source: %s expected
pt_br: %s aguardado(a)

source: Invalid numeric value
pt_br: Valor numerico inválido

source: Invalid string constant
pt_br: String constante inválida

source: Invalid binary value
pt_br: Valor binário inválido

source: Outline index not found
pt_br: Índice de contorno não encontrado

source: Parent must be expanded
pt_br: Antecessor deve ser expandido

source: Invalid value for current item
pt_br: Valor inválido para o ítem corrente

source: Invalid input value
pt_br: Valor de entrada inválido

source: Invalid input value. Use escape key to abandon changes
pt_br: Valor de entrada inválido. Use a tecla ESC para abandonar as alterações

source: Invalid outline index
pt_br: Índice de contorno inválido

source: Incorrect level assignment
pt_br: Nível de transferência incorreto

source: Invalid selection
pt_br: Seleção inválida

source: File load error
pt_br: Erro ao carregar arquivo

source: Maximum outline depth exceeded
pt_br: Máxima profundidade do contorno excedida

source: Warning
pt_br: Atenção

source: Error
pt_br: Erro

source: Information
pt_br: Informação

source: Confirm
pt_br: Confirmar

source: No help available
pt_br: Ajuda não disponível

source: Help
pt_br: Ajuda

source: &Abort
pt_br: &Abortar

source: N&o to All
pt_br: N&ão para todos

source: Yes to &All
pt_br: S&im para todos

source: (Unknown)
pt_br: (Desconhecido)

source: Value must be between %d and %d
pt_br: Valor deve estar entre %d e %d

source: Invalid argument to date encode
pt_br: Arqumento inválido para decodificar data

source: Invalid argument to time encode
pt_br: Argumento inválido para coficação de hora

source: ''%s'' is not a valid date
pt_br: ''%s'' não é uma Data válida

source: ''%s'' is not a valid time
pt_br: ''%s'' não é uma Hora válida

source: ''%s'' is not a valid date and time
pt_br: ''%s'' não é uma Data e Hora válidos

source: Invalid file name - %s
pt_br: Nome de arquivo inválido - %s

source: All files (*.*)|*.*
pt_br: Todos os arquivos (*.*)|*.*

source: All
pt_br: Todos

source: : [ - no volume label - ]
pt_br: : [ - Sem Rótulo - ]

source: Unable to insert a line
pt_br: Não é possível inserir linha

source: The specified directory does not exist. Create it?
pt_br: O diretório especificado não existe. Criá-lo?

source: Select Directory
pt_br: Selecione o diretório

source: Unable to create directory
pt_br: Impossível criar diretório

source: Directory &Name:
pt_br: Diretório &Nome:

source: &Directories:
pt_br: &Diretorios:

source: &Files: (*.*)
pt_br: &Arquivos: (*.*)

source: Ne&twork...
pt_br: &Rede...

source: Invalid clipboard format
pt_br: Formato na área de transferência inválido

source: Clipboard does not support Icons
pt_br: Área de transferência não suporta ícones

source: Cannot open clipboard
pt_br: Não posso abrir a área de transferência

source: Default
pt_br: Padrão

source: Text exceeds memo capacity
pt_br: Texto excedeu a capacidade de 32K

source: Custom Colors
pt_br: Personalizar Cores

source: Operation not supported on selected printer
pt_br: Operação não suportada ao selecionar impressora

source: There is no default printer currently selected
pt_br: Esta impressora selecionada não é a padrão

source: Unable to write to %s
pt_br: Impossível gravar para %s

source: Bits index out of range
pt_br: Índice de Bits fora de faixa

source: (Untitled)
pt_br: Aplicação sem título

source: Invalid data type for '%s'
pt_br: Tipo de dado inválido para '%s'

source: Failed to create key %s
pt_br: Falha ao criar chave %s

source: Failed to set data for '%s'
pt_br: Falha ao definir dados para '%s'

source: Failed to get data for '%s'
pt_br: Falha ao passar dados para '%s'

source: Unknown RichEdit conversion file extension (.%s)
pt_br: Incapaz de converter arquivo de extenção (.%s) para RichEdit

source: Menu '%s' is already being used by another form
pt_br: Menu '%s' já está inicializado e usado por outro formulário

source: Picture:
pt_br: Imagem:

source: Preview
pt_br: Visualizar

source: Cannot open AVI
pt_br: Não é possível abrir arquivo AVI

source: No MCI device open
pt_br: Dispositivo MCI não aberto

source: All files (*.*)|*.*|Wave files (*.wav)|*.wav|Midi files (*.mid)|*.mid|Video for Windows (*.avi)|*.avi
pt_br: Todos arquivos (*.*)|*.*|Arquivos wave (*.wav)|*.wav|Arquivos Midi (*.mid)|*.mid|Video para Windows (*.avi)|*.avi

source: DigitalVideo
pt_br: Vídeo Digital

source: Other
pt_br: Outro

source: Overlay
pt_br: Sobreposto

source: Sequencer
pt_br: Seqüência

source: Videodisc
pt_br: Vídeo disco

source: WaveAudio
pt_br: Áudio Wave

source: Unknown error code
pt_br: Código de erro desconhecido

source: Bold Italic
pt_br: Negrito Itálico

source: Bold
pt_br: Negrito

source: Italic
pt_br: Itálico

source: Regular
pt_br: Normal

source: Properties
pt_br: Propriedades

source: Windows socket error: %s (%d), on API '%s'
pt_br: Erro no Socket do Windows: %s (%d), on API '%s'

source: Asynchronous socket error %d
pt_br: Erro %d de sincronia de Socket

source: No address specified
pt_br: Nenhum endereço especificado

source: Can't listen on an open socket
pt_br: Impossível listar em um Socket aberto

source: Can't create new socket
pt_br: Impossível criar um novo Socket

source: Socket already open
pt_br: Socket já existe

source: Can't change value while socket is active
pt_br: Impossível mudar o valor enquanto o Socket está ativo

source: Socket must be in blocking mode
pt_br: Socket precisa esta em Modo de bloqueio

source: Read
pt_br: Ler

source: Write
pt_br: Gravar

source: Service failed on %s: %s
pt_br: Falha de serviço em %s: %s

source: execute
pt_br: E&xecutar

source: pause
pt_br: pausa

source: continue
pt_br: continuar

source: interrogate
pt_br: interrogar

source: shutdown
pt_br: Reiniciar

source: Service failed in custom message(%d): %s
pt_br: Falha de serviço sob a mensagem (%d): %s

source: Service installed successfully
pt_br: Serviço instalado com sucesso

source: Service "%s" failed to install with error: "%s"
pt_br: Serviço "%s" falho ou instalado com erro: "%s"

source: Service uninstalled successfully
pt_br: Serviço desinstalado com successo

source: Service "%s" failed to uninstall with error: "%s"
pt_br: Serviço "%s" falho ou desinstalado com erro: "%s"

source: Invalid action registration
pt_br: Registo de ação inválido

source: Invalid action unregistration
pt_br: ação invalida ao desregistrar

source: Invalid action enumeration
pt_br: Ação de enumeração inválida

source: Invalid action creation
pt_br: Ação de criação inválida

source: Docked control must have a name
pt_br: O controle acoplado deve ter um conhecido

source: Error removing control from dock tree
pt_br: Erro removendo controle da arvore

source: - Dock zone not found
pt_br: - Zona da doca não encontrada

source: - Dock zone has no control
pt_br: - Zona da doca não tem controle

source: All Commands
pt_br: Todos Comandos

source: List does not allow duplicates ($0%x)
pt_br: Lista nao permite duplicidade ($0%x)

source: A property category called %s already exists
pt_br: Uma categoria de propriedade chamada %s já existe

source: Property category does not exist (%s)
pt_br: Categoria de propriedade não existe(%s)

source: '%s' is an invalid mask at (%d)
pt_br: '%s' é uma mascara inválida em (%d)

source: Property filters may only be name, class or type based (%d:%d)
pt_br: Propriedade Filters pode apenas ser nome, classe ou tipo baseado (%d:%d)

source: Categories must define their own name and description
pt_br: Categorias precisam definir seus nomes e descrições

source: Operation not allowed while dispatching application events
pt_br: Operação não suportada enquanto dispachando eventos da aplicação

source: Invalid field size
pt_br: Tamanho de campo inválido

source: Invalid FieldKind
pt_br: FieldKind inválido

source: Invalid field registration
pt_br: Registro de campo inválido

source: Field '%s' is of an unknown type
pt_br: Campo '%s' de tipo desconhecido

source: Field name missing
pt_br: Nome do campo ausente

source: Duplicate field name '%s'
pt_br: Nome de campo '%s' duplicado

source: Field '%s' not found
pt_br: Campo '%s' não encontrado

source: Cannot access field '%s' as type %s
pt_br: Não é possível acessar o campo '%s' do tipo %s

source: Invalid value for field '%s'
pt_br: Valor inválido para o campo '%s'

source: %g is not a valid value for field '%s'. The allowed range is %g to %g
pt_br: %g Não é um valor válido para o campo '%s'. A faixa permitida é de %g até %g

source: '%s' is not a valid integer value for field '%s'
pt_br: '%s' não é um inteiro válido para o campo '%s'

source: '%s' is not a valid boolean value for field '%s'
pt_br: '%s' não é uma valor boleano válido para o campo '%s'

source: '%s' is not a valid floating point value for field '%s'
pt_br: '%s' não é um valor de ponto flutuante válido para o campo '%s'

source: Type mismatch for field '%s', expecting: %s actual: %s
pt_br: Campo '%s' não é do tipo esperado, esperando: %s atual: %s

source: Size mismatch for field '%s', expecting: %d actual: %d
pt_br: Tamanho sem combinação para campo '%s', esperando: %d atual: %d

source: Invalid variant type or size for field '%s'
pt_br: Tipo ou tamanho da variante inválido para o campo '%s'

source: Value of field '%s' is out of range
pt_br: Valor do campo '%s' está fora de faixa

source: Field '%s' has no dataset
pt_br: Campo '%s' não tem arquivo

source: Field '%s' cannot be a calculated or lookup field
pt_br: Campo '%s' não pode ser um campo calculado ou lookup

source: Field '%s' cannot be modified
pt_br: Campo '%s' não pode ser modificado

source: Field index out of range
pt_br: Índice de campo fora de faixa

source: No index currently active
pt_br: Índice corrente não ativo

source: Field '%s' is not indexed and cannot be modified
pt_br: Campo '%s' não está indexado e não pode ser modificado

source: Cannot access index field '%s'
pt_br: Não é possível acessar o índice do campo '%s'

source: Duplicate index name '%s'
pt_br: Nome de índice duplicado '%s'

source: No index for fields '%s'
pt_br: Não tem índice para os campos '%s'

source: Index '%s' not found
pt_br: Índice '%s' não encontrado

source: Duplicate name '%s' in %s
pt_br: Nome duplicado '%s' em %s

source: Circular datalinks are not allowed
pt_br: Ligações de dados circulares não são permitidas

source: Lookup information for field '%s' is incomplete
pt_br: Informação Lookup para o campo '%s' está incompleta

source: DataSource cannot be changed
pt_br: DataSource não pode ser atualizado

source: Nested datasets cannot have a MasterSource
pt_br: Arquivos aninhados não podem ter uma tabela mestra

source: Cannot perform this operation on an open dataset
pt_br: Não é possível realizar esta operação em um arquivo aberto

source: Dataset not in edit or insert mode
pt_br: Arquivo não está em modo de edição ou inserção

source: Cannot perform this operation on a closed dataset
pt_br: Não é possível realizar esta operação em um arquivo fechado

source: Cannot perform this operation on an empty dataset
pt_br: Não é possível realizar esta operação em um arquivo vazio

source: Cannot modify a read-only dataset
pt_br: Não é possível modificar um arquivo somente de leitura

source: Nested dataset must inherit from %s
pt_br: Arquivo aninhado têm que herdar de %s

source: Filter expression incorrectly terminated
pt_br: Expressão de filtro incorretamente terminada

source: Unterminated field name
pt_br: Nome de campo não terminado

source: Unterminated string constant
pt_br: Constante de string não terminada

source: Invalid filter expression character: '%s'
pt_br: Caractere inválido na expressão de filtro: '%s'

source: '(' expected but %s found
pt_br: '(' esperado mas %s encontrado

source: ')' expected but %s found
pt_br: ')' esperado mas %s encontrado

source: ')' or ',' expected but %s found
pt_br: ')' ou ',' aguardado mas %s existe

source: Expression expected but %s found
pt_br: Expressão esperada mas %s encontrada

source: Field '%s' cannot be used in a filter expression
pt_br: Campo '%s' não pode ser usado em uma expressão de filtro

source: NULL only allowed with '=' and '<>'
pt_br: NULL somente permitido com '=' e '<>'

source: Constant out of range
pt_br: Constante fora de faixa

source: Field '%s' is not of type Boolean
pt_br: Campo '%s' não é do tipo boleano

source: Incorrectly formed filter expression
pt_br: Expressão de filtro formada incorretamente

source: nothing
pt_br: Absolutamente

source: Type mismatch in expression
pt_br: Tipo de expressão desconhecida

source: Operation cannot mix aggregate value with record-varying value
pt_br: Operação não pode misturar valor agregado com valor registro-variado

source: Arithmetic in filter expressions not supported
pt_br: Filtro de expressão aritmética não suportada

source: Expression is not an aggregate expression
pt_br: Expressão não é uma expressão agregada

source: Constant is not correct type %s
pt_br: Constante corrente não é do tipo %s

source: Aggregate expressions not allowed in filters
pt_br: Expressões agregadas não permitem filtros

source: IN predicate list may not be empty
pt_br: Lista de predicados IN pode não estar vazia

source: Invalid use of keyword
pt_br: Uso de Keyword inválido

source: Parameter '%s' not found
pt_br: Parametro '%s' não encontrado

source: Unable to load bind parameters
pt_br: Não é possível carregar parâmetros da fita

source: Parameter '%s', cannot save data larger than %d bytes
pt_br: Parâmetro '%s', não é possível salvar dados maiores que %d bytes

source: Field '%s' is of an unsupported type
pt_br: Campo '%s' é do tipo não suportado

source: Property may not be modified while aggregate is active
pt_br: Esta propriedade não pode ser modificada enquanto o agregado está ativo

source: SQL not supported: %s
pt_br: SQL não suportado: %s

source: Execute not supported: %s
pt_br: Execução não suportada: %s

source: Field '%s' is not the correct type of calculated field to be used in an aggregate, use an internalcalc
pt_br: Campo '%s' não é o tipo correto de campo calculado para ser usado em um agregado, use um "internalcalc"

source: First record
pt_br: Primeiro registro

source: Prior record
pt_br: Registro Anterior

source: Next record
pt_br: Próximo registro

source: Last record
pt_br: Último registro

source: Insert record
pt_br: Inserir registro

source: Delete record
pt_br: Apagar registro

source: Edit record
pt_br: Editar registro

source: Post edit
pt_br: Gravar Edição

source: Cancel edit
pt_br: Cancelar Edição

source: Refresh data
pt_br: Recarregar dados

source: Delete record?
pt_br: Apagar registro?

source: Delete all selected records?
pt_br: Apagar todos os registro selecionados?

source: Record not found
pt_br: Registro não encontrado

source: Operation not allowed in a DBCtrlGrid
pt_br: Operação não suportada em um DBCtrlGrid

source: Control cannot be used in a DBCtrlGrid
pt_br: Controle não pode ser usado em um DBCtrlGrid

source: Property already defined by lookup field
pt_br: Esta propriedade já foi definida por um campo melhor

source: Grid requested to display more than 256 columns
pt_br: Grade requesitada para mostrar mais que 256 colunas

source: Remote Login
pt_br: Login Remoto

source: Data Bindings...
pt_br: Juntando dados...

source: &Transaction Editor...
pt_br: Editor de &Transação...

source: Database Files (*.gdb)|*.gdb|All files (*.*)|*.*
pt_br: Arquivos da DataBase(*.gdb)|*.gdb|Todos os arquivos (*.*)|*.*

source: Transaction is currently Active. Rollback and continue?
pt_br: Uma transação está atualmente ativa. Deseja descarregar e continuar?

source: Unknown error
pt_br: Erro desconhecido

source: InterBase library gds32.dll not found in the path. Please install InterBase to use this functionality
pt_br: Biblioteca gds32.dll do InterBase não encontrada no caminho. Por favor re-instale o InterBase

source: InterBase Install DLL ibinstall.dll not found in the path. Please install InterBase 6 to use this functionality
pt_br: Biblioteca ibinstall.dll do InterBase não encontrada no caminho. Por favor re-instale o InterBase 6

source: Unsupported feature
pt_br: Caracteristica não suportada

source: Not permitted
pt_br: Não permitida

source: Temporary file access error
pt_br: Erro no acesso ao arquivo temporário

source: Database connection timed out
pt_br: Tempo esgotado para a conexão ao Database

source: Cannot set database
pt_br: Impossível registrar database

source: Cannot set transaction
pt_br: Impossível registrar transaçao

source: Operation cancelled at user's request
pt_br: Operação cancelada pelo usuário

source: DPB Constant (isc_dpb_%s) is unsupported
pt_br: DPB Constante (isc_dpb_%s) não é suportada

source: DPB Constant (%d) is unknown
pt_br: DPB Constante (%d) é desconhecida

source: TPB Constant (isc_tpb_%s) is unsupported
pt_br: TPB Constante (isc_tpb_%s) não é suportada

source: TPB Constant (%d) is unknown
pt_br: TPB Constante (%d) é desconhecida

source: Cannot perform operation -- DB is not open
pt_br: Não é possível executar esta operação em um banco de dados fechado

source: Cannot perform operation -- DB is currently open
pt_br: Não é possível executar esta operação em um banco de dados aberto
