Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/delphi7.po
Languages: da, ru

source: Connection name missing
da: Forbindelsesnavnet mangler
ru: Отсутствует имя соединения

source: Missing query, table name or procedure name
da: Mangler forespørgsel, tabelnavn eller procedurenavn
ru: Отсутствует запрос, имя таблицы или имя процедуры

source: Missing Database property
da: Mangler databasegenskab
ru: Отсутствует свойство Database

source: Missing DriverName property
da: Mangler DriverName egenskab
ru: Отсутствует свойство DriverName

source: Unable to execute Query
da: Ude af stand til at udføre forespørgsel
ru: Не могу выполнить Запрос

source: Table/Procedure not found
da: Tabel/procedure blev ikke fundet
ru: Таблица/процедура не найдена

source: There is no active transaction
da: Der er ikke nogen aktiv transaktion
ru: Нет активной транзакции

source: A transaction is already active
da: En transaktion er allerede aktiv
ru: Транзакция уже активна

source: Unable to Load %s
da: Ude af stand til at indlæse %s
ru: Не могу загрузить %s

source: Unable to Find Procedure %s
da: Ude af stand til at finde procedure %s
ru: Не могу найти процедуру %s

source: &Edit Connection Properties
da: &Rediger forbindelsesegenskaber
ru: &Изменить свойства соединения

source: &Edit CommandText
da: &Rediger CommandText
ru: &Изменить CommandText

source: DLL/Shared Library Name not Set
da: DLL/delt biblioteksnavn ikke sat
ru: Имя DLL/Shared Library не установлено

source: Driver/Connection Registry File '%s' not found
da: Driver/Forbindelse registreringsdatabase fil '%s' ikke fundet
ru: Файл регитсрации драйвера/соединения '%s' не найден

source: Cannot find TableName in CommandText
da: Kan ikke finde TableName i CommandText
ru: Не могу найти TableName в CommandText

source: Cursor not returned from Query
da: Forespørgsel returnerede ikke cursor
ru: Курсор не возвращен из Запроса

source: Unable to Open Metadata
da: Ude af stand til at åbne metadata
ru: Не могу открыть Metadata

source: SQL Error: Error mapping failed
da: SQL fejl: Fejlkortlægning fejlede
ru: Ошибка SQL: Error mapping failed

source: Stored Procedures not supported by '%s' Server
da: '%s' værten understøtter ikke Stored Procedures
ru: Хранимые процедуры не поддерживаются '%s' Server

source: Packages are not supported by '%s' Server
da: '%s' værten understøtter ikke pakker
ru: Пакеты не поддерживаются '%s' сервером

source: DBX Error: No Mapping for Error Code Found
da: DBX fejl: Ingen kortlægning for den fundne fejlkode
ru: Ошибка DBX: No Mapping for Error Code Found

source: DBX Error: Connection not found, error message cannot be retrieved
da: DBX fejl: Forbindelsen blev ikke fundet, fejlmeddelelsen kan ikke fremskaffes
ru: Ошибка DBX: Соединение не найдено, сообщение об ошибке не может быть получено

source: DBX Error: MetadataObject not found, error message cannot be retrieved
da: DBX fejl: Metadataobjekt ikke fundet, fejlmeddelelsen kan ikke fremfindes
ru: Ошибка DBX: MetadataObject не найден, сообщение об ошибке не может быть получено

source: DBX Error: Command not found, error message cannot be retrieved
da: DBX fejl: Kommando ikke fundet, fejlmeddelelsen kan ikke fremfindes
ru: Ошибка DBX: Соединение не найдено, сообщение об ошибке не может быть получено

source: DBX Error: Cursor not found, error message cannot be retrieved
da: DBX fejl: Cursor ikke fundet, fejlmeddelelsen kan ikke fremfindes
ru: Ошибка DBX: Соединение не найдено, сообщение об ошибке не может быть получено

source: dbExpress Error: Insufficient Memory for Operation
da: dbExpress fejl: Mangler hukommelse for at kunne udføre handling
ru: Ошибка dbExpress: Не хватает памяти для операции

source: dbExpress Error: Invalid Field Type
da: dbExpress fejl: Ugyldig filtype
ru: Ошибка dbExpress: Неверное тип поля

source: dbExpress Error: Invalid Handle
da: dbExpress fejl: ugyldigt håndtag
ru: Ошибка dbExpress: Неверный дескриптор

source: dbExpress Error: Invalid Time
da: dbExpress fejl: Ugyldigt klokkeslet
ru: ''%s'' - неверное время

source: dbExpress Error: Operation Not Supported
da: dbExpress fejl: Handling er ikke understøttet
ru: Неподдерживаемая возможность

source: dbExpress Error: Invalid Data Translation
da: dbExpress fejl: Ugyldig data oversættelse
ru: Ошибка dbExpress: Неверное преобразование данных

source: dbExpress Error: Invalid Parameter
da: dbExpress fejl: Ugyldig parameter
ru: Ошибка dbExpress: Неверный параметр

source: dbExpress Error: Parameter/Column out of Range
da: dbExpress fejl: Parameter/kolonne ude for gyldigt talområde
ru: Значение должно быть между %d и %d

source: dbExpress Error: Parameter Not Set
da: dbExpress fejl: Parameter ikke angivet
ru: Ошибка dbExpress: Параметр не установлен

source: dbExpress Error: Result set at EOF
da: dbExpress fejl: Resultatsættet er ved EOF
ru: Конец файла

source: dbExpress Error: Invalid Username/Password
da: dbExpress fejl: ugyldigt brugernavn/adgangskode
ru: Ошибка dbExpress: Неверное имя/пароль

source: dbExpress Error: Invalid Precision
da: dbExpress fejl: ugyldig præcision
ru: Ошибка dbExpress: Неверная точность

source: dbExpress Error: Invalid Length
da: dbExpress fejl: Ugyldig længde
ru: Ошибка dbExpress Error: Неверная длина

source: dbExpress Error: Invalid Transaction Isolation Level
da: dbExpress fejl: Ugyldig transaktionsisoleringsniveau
ru: Ошибка dbExpress: Неверный Уровень Изоляции Транзакций

source: dbExpress Error: Invalid Transaction ID
da: dbExpress fejl: ugyldigt transaktions ID
ru: Ошибка dbExpress: Неверный ID транзакции

source: dbExpress Error: Duplicate Transaction ID
da: dbExpress fejl: Dubleret transaktions ID
ru: Ошибка dbExpress: Дубликат ID транзакции

source: dbExpress Error: Application is not licensed to use this feature
da: dbExpress fejl: Programmet er ikke licensieret til at bruge denne facilitet
ru: dbExpress: Приложение не лицензировано для использование этой возможности

source: dbExpress Error: Local Transaction already active
da: dbExpress fejl: Lokal transaktion er allerede aktiv
ru: Ошибка dbExpress: Локальная транзакция уже активна

source: dbExpress Error: Multiple Transactions not Enabled
da: dbExpress fejl: Muligheden for flere samtidige transaktioner er ikke slået til
ru: Ошибка dbExpress: Несколько транзакций не доступно

source: Multiple Connections not supported by %s driver
da: Flere samtidige forbindelser kan ikke lade sig gøre med %s styreprogrammet
ru: Многочисленные соединения не поддерживаются драйвером %s

source: Unable to move %s to %s
da: Ude af stand til at flytte %s til %s
ru: Не могу переместить %s в %s

source: Configuration file %s not found
da: Opsætningsfilen %s blev ikke fundet
ru: Файл конфигурации %s не найден

source: ObjectView must be True for Table with Object fields
da: ObjectView skal være slået til for tabeller med objektfelter
ru: ObjectView должен быть True для таблиц с Object полями

source: Driver (%s) not found in Cfg file (%s)
da: Styreprogrammet (%s) blev ikke fundet i Cfg filen (%s)
ru: Драйвер (%s) не найден в конфиг. файле (%s)

source: Object type name required as parameter value
da: Objekttypenavnet er krævet som parameterværdi
ru: Имя типа Object требуется как значение параметра

source: Cannot create file %s
da: Kan ikke oprette filen %s
ru: Не могу создать файл %s

source: Open trace log file
da: Åbner sporingslogfil
ru: Открыть файл протокола трассировки

source: Text files (*.txt)|*.txt|All files (*.*)|*.*
da: Tekst filer (*.txt)|*.txt|Alle filer (*.*)|*.*
ru: Текстовые файлы (*.txt)|*.txt|Все файлы (*.*)|*.*

source: Log files (*.log)
da: Logfiler (*.log)
ru: Файлы протокола (*.log)

source: Circular provider references not allowed.
da: Cirkulære provider referencer er ikke tilladt.
ru: Циклические ссылки провайдеров не допускаются.

source: Data Bindings...
da: Databindinger...
ru: Привязка данных...

source: No help keyword specified.
da: Mangler nøgleord til hjælpen.

source: Initialization of script debugger failed. Verify that a script debugger is installed
da: Script fejlsøgeren kan ikke startes op. Kontroller at den er installeret.

source: Script execution timed out after %d seconds
da: Script udførsel standsede efter et tidsudløb på %d sekunder

source: A script error occured. Do you want to debug?
da: En script fejl optrådte. Ønsker du at starte fejlsøgeren?

source: Script Error
da: Scriptfejl

source: Field %s requires a value
da: Felt %s kræver en værdi
ru: Поле %s требует значение

source: %s does not allow multiple values
da: %s tillader ikke flere værdier
ru: %s не допускает множественные значения

source: %s does not allow multiple files
da: %s tillader ikke flere filer
ru: %s не допускает множественные файлы

source: %s requires a file
da: %s kræver en fil
ru: %s требует файл

source: Modification of %s is not permitted
da: Ændring af %s er ikke tilladt
ru: Изменение %s не допустимо

source: Execution of action %s is not permitted
da: Udførsel af aktion %s er ikke tilladt
ru: Выполнение действия %s не допустимо

source: Field view not permitted
da: Feltvisning er ikke tilladt
ru: Просмотр поля не допустим

source: Data Modification is not permitted
da: Dataændring er ikke tilladt
ru: Изменение данных не допустимо

source: %s does not support file upload
da: %s understøtter ikke filupload
ru: %s не поддерживает закачку файлов

source: Login page is not defined
da: Loginsiden er ikke defineret
ru: Страница входа не определена

source: Web Page not found: %s
da: Netsiden blev ikke fundet: %s
ru: Web-страница не найдена: %s

source: Web Page does not provide content
da: Websiden leverer ikke noget indhold
ru: Web-страница не предоставляло содержимого

source: Field %s did not provide an image
da: Felt %s leverer ikke et billede
ru: Поле %s не предоставляло изображения

source: Unknown Adapter mode: %s
da: Ukendt adaptertilstand: %s
ru: Неизвестный режим адаптера: %s

source: DataSet is nil
da: Datasæt er nil
ru: DataSet равен nil

source: Row not found in %s
da: Række ikke fundet i %s
ru: Строка не найдена в %s

source: Field %s changed by another user
da: Felt %s ændret af en anden bruger
ru: Поле %s изменено другим пользователем

source: Field not found: %s
da: Felt ikke fundet: %s
ru: Поле не найдено: %s

source: %s: DataSet property is nil
da: %s: Dataset egenskaben er nil
ru: %s: свойство DataSet равно nil

source: %0:s: Dataset %1:s unknown keyfields
da: %0:s: Dataset %1:s ukendte nøglefelter
ru: %0:s: Dataset %1:s неизв. ключевые поля

source: %0:s: Dataset %1:s not active
da: %0:s: Datasæt %1:s ikke aktiv
ru: %0:s: Dataset %1:s не активен

source: %0:s: ValueField property value is blank
da: %0:s: ValueField egenskaben er tom
ru: %0:s: значение свойства ValueField - пустое

source: Missing XML Data Component
da: Mangler XML data komponent
ru: Отсутствует компонент данных XML

source: Could not create XMLDocument
da: Kunne ikke oprette XMLDocument
ru: Не могу создать XMLDocument

source: Add Fields...
da: Tilføj felter...
ru: Добавить поля...

source: Add All Fields
da: Tilføj alle felter
ru: Добавить все поля

source: Add Fields
da: Tilføj felter
ru: Добавление полей

source: Add Actions...
da: Tilføj handlinger...
ru: Добавить Actions...

source: Add All Actions
da: Tilføj alle handlinger
ru: Добавить все действия

source: Add Actions
da: Tilføj handlinger
ru: Добавить Actions

source: Add Commands...
da: Tilføj kommandoer...
ru: Добавить команды...

source: Add All Commands
da: Tilføje alle kommandoer
ru: Добавить все команды

source: Add Commands
da: Tilføj kommandoer
ru: Добавление команд

source: Add Columns...
da: Tilføj kolonner...
ru: Добавить колонки...

source: Add All Columns
da: Tilføj alle kolonner
ru: Добавить все колонки

source: Add Columns
da: Tilføj kolonner
ru: Добавление колонок

source: %s: Adapter property is nil
da: %s: Adapter egenskab er nil
ru: %s: свойство Adapter равно nil

source: %s: Fieldname is blank
da: %s: Feltnavn er tomt
ru: %s: пустое имя поля

source: %0:s: Field %1:s not found in associated Adapter
da: %0:s: Felt %1:s ikke fundet i det tilknyttede adapter
ru: %0:s: поле %1:s не найдено в связанном Adapter

source: %s: Action name is blank
da: %s: Action navn er tom
ru: %s: пустое имя действия

source: %0:s: Action %1:s not found in associated Adapter
da: %0:s: Aktion %1:s ikke fundet i tilknyttet adapter
ru: %0:s: действие %1:s не найдено в связанном Adapter

source: %s: DisplayComponent property is nil
da: %s: DisplayComponent egenskab er nil
ru: %s: свойство DisplayComponent равно nil

source: No request handlers handled this request. The WebAppComponents PageDispatcher, AdapterDispatcher or DispatchActions property may not be set.
da: Ingen forespørgselshåndterere håndterede denne forespørgsel. WebAppComponents PageDispatcher, AdapterDispatcher eller DispatchActions egenskaberne er muligvis ikke angivet.
ru: Нет обработчиков запросов обрабатывающих этот запрос. Свойства WebAppComponents PageDispatcher, AdapterDispatcher или DispatchActions должны быть установлены.

source: Password must not be blank
da: Adgangskoden må ikke være tom
ru: Пароль не должен быть пустым

source: Username must not be blank
da: Brugernavnet må ikke være tomt
ru: Имя пользователя не должно быть пустым

source: Adapter Request not handled: %0:s, %1:s
da: Adapterforespørgsel blev ikke håndteret: %0:s, %1:s
ru: Запрос адаптера не управляем: %0:s, %1:s

source: Dispatching blank page name
da: Dispatching tomt sidenavn

source: Page access denied
da: Adgang til siden blev nægtet
ru: Доступ к странице закрыт

source: Web Page does not support redirect
da: Netsiden understøtter ikke viderestilling
ru: Web-страница не поддерживает перенаправление

source: Can't find included page: %s
da: Kan ikke finde inkluderet side: %s
ru: Не могу найти включенную страницу: %s

source: Page %s does not support inclusion
da: Siden %s understøtter ikke inkludering
ru: Страница %s не поддерживает вложение

source: Include file %s includes itself
da: Inkluderingsfilen %s inkluderer sig selv
ru: Включенный файл %s содержит сам себя

source: Incorrect image format (%0:s) for field %1:s
da: Ukorrekt billedformat (%0:s) for felt %1:s
ru: Неправильный формат изображения (%0:s) для поля %1:s

source: Uploaded file expected for field %s
da: Indsendt fil forventet for felt %s
ru: Закаченный файл ожидается для поля %s

source: UserName
da: Brugernavn

source: Password
da: Adgangskode

source: UserID not found
da: BrugerID blev ikke fundet
ru: UserID не найден

source: Invalid password
da: Ugyldig adgangskode
ru: Неверный пароль

source: Missing password
da: Mangler adgangskode
ru: Отсутствует пароль

source: Unknown user name
da: Ukendt brugernavn
ru: Неизвестное имя пользователя

source: Missing user name
da: Mangler brugernavn
ru: Отсутствует имя пользователя

source: Cannot create script engine: %s. Error: %x
da: Kan ikke oprette scriptmaskine: %s. Fejl: %x
ru: Не могу создать script engine: %s. Ошибка: %x

source: Cannot initialize script engine
da: Kan ikke starte scriptmaskinen
ru: Не могу инициализировать script engine

source: Script engine not found: %s.
da: Scriptmaskine blev ikke fundet: %s
ru: Script engine не найден: %s.

source: Script Object expected
da: Forventede scriptobjekt
ru: Script Object ожидается

source: Integer parameter expected
da: Forventede heltalsparametre
ru: Целочисленный параметр ожидается

source: Unexpected parameter type
da: Forventede ikke denne parametertype
ru: Неожиданный тип параметра

source: Unexpected return type
da: Uventet returtype
ru: Неожиданный возвращаемый тип

source: Duplication prototype name
da: Dubleret protokoltypenavn
ru: Неуникальное имя прототипа

source: Boolean parameter expected
da: Forventede boolean parameter
ru: Параметр логического типа ожидается

source: Double parameter expected
da: Forventede parameter af datatypen double
ru: Параметр типа Double ожидается

source: Unexpected script error
da: Uventet scriptfejl

source: <table width="95%%" border="1" cellspacing="0" bordercolor="#C0C0C0"> <tr> <td colspan=2> <font color="#727272"><b>Error[%0:d]:</b> %1:s </font> </td> </tr> <tr> <td> <font color="#727272"><b>Line:</b> %2:d </font> </td> <td> <font color="#727272"><b>Position:</b> %3:d </font> </td> </tr> </table>
da: <table width="95%%" border="1" cellspacing="0" bordercolor="#C0C0C0"> <tr> <td colspan=2> <font color="#727272"><b>Fejl[%0:d]:</b> %1:s </font> </td> </tr> <tr> <td> <font color="#727272"><b>Linje:</b> %2:d </font> </td> <td> <font color="#727272"><b>Position:</b> %3:d </font> </td> </tr> </table>
ru: <table width="95%%" border="1" cellspacing="0" bordercolor="#C0C0C0"> <tr> <td colspan=2> <font color="#727272"><b>Ошибка[%0:d]:</b> %1:s </font> </td> </tr> <tr> <td> <font color="#727272"><b>Строка:</b> %2:d </font> </td> <td> <font color="#727272"><b>Позиция:</b> %3:d </font> </td> </tr> </table>

source: Maximum sessions exceeded
da: Maksimum antal sessioner overskredet
ru: Превышено максимальное количество сессий

source: Variable not found: %s
da: Variablen blev ikke fundet: %s
ru: Переменная не найдена: %s

source: Component does not support scripting. Class: %0:s, Name: %1:s
da: Komponenten understøtter ikke scripting. Klasse: %0:s, Navn: %1:s
ru: Компонент не поддерживает scripting. Класс: %0:s, Имя: %1:s

source: Object does not support scripting. Class: %0:s
da: Objekt understøtter ikke scripting. Klasse: %0:s
ru: Объект не поддерживает scripting. Класс: %0:s

source: Parameter expected
da: Forventet parameter
ru: Параметр ожидается

source: String parameter expected
da: Forventede tekstparameter
ru: Строковый параметр ожидается

source: Invalid image (the size is less than 4 bytes long).
da: Ugyldigt billede (størrelsen er mindre end 4 byte)
ru: Неверный размер изображения

source: File include error on line %d: expecting "
da: Fejl ved inklusion af fil på linie %d: forventede "
ru: Ошибка включения файла (include) в строке %d: ожидается "

source: File include error on line %d: expecting =
da: Fejl ved inklusion af fil på linie %d: forventede =
ru: Ошибка включения файла (include) в строке %d: ожидается =

source: File include error on line %d: expecting virtual, file, or page, but found %s.
da: Fejl ved inklusion af fil på linie %d: forventede virtual, file eller page, men fandt %s
ru: Ошибка включения файла (include) в строке %d: ожидается virtual, файл, или страница, но найдено %s.

source: unknown
da: ukendt
ru: неизвестный

source: Component %s not found
da: Komponent %s ikke fundet
ru: Компонент %s не найден

source: Getting the Count of a TComponentsEnumerator object is not supported
da: Det er ikke understøttet at hente Count på et TComponentsEnumerator objekt
ru: Вызов Count у объекта TComponentsEnumerator не поддерживается

source: Component was expected to implement IInterfaceComponentReference for ValuesList support
da: Det var forventet at komponent implementerede IInterfaceComponentReference for ValuesList understøttelse
ru: Компонент ожидается для реализации IInterfaceComponentReference для поддержки ValuesList

source: Errors object must support the interface IIterateIntfSupport
da: Errors objektet skal understøtte interfacet IIterateIntfSupport
ru: Объект ошибок должен поддерживать интерфейс IIterateIntfSupport

source: Creates a WebSnap Application
da: Opretter et WebSnap program

source: WebSnap Application
da: WebSnap program

source: Creates a WebSnap Page Module
da: Opretter et WebSnap Page modul

source: WebSnap Page Module
da: Websnap Page modul

source: Creates a WebSnap Data Module
da: Opretter et WebSnap datamodul

source: WebSnap Data Module
da: Websnap datamodul

source: There is currently no active project.
da: Der er ikke noget aktivt projekt lige nu

source: Data Packet
da: Datapakke

source: Can't execute %s %d
da: Kan ikke udføre %s %d

source: Timeout occurred waiting for %s to execute
da: Tidsudløb ved udførsel af %s

source: Unable to execute %s
da: Ude af stand til at udføre %s

source: Unexpected error occurred executing %s
da: Uventet fejl opstod, da %s blev udført

source: File Status:
da: Filstatus:
ru: Статус файл:

source: Found
da: Fundet
ru: Найден

source: Not found
da: Ikke fundet
ru: Не найден

source: Missing ProgID
da: Mangler ProgID
ru: Отсутствует ProgID

source: Go
da: Kør
ru: Пуск

source: Fetch &Params
da: Hent %parametre
ru: Загрузить &Пар-ры

source: &Web Page Editor...
da: &Web Page redigeringsværktøj...
ru: Редактор &веб страниц...

source: Delete existing components?
da: Slet eksisterende komponenter?
ru: Удалить созданные компоненты?

source: Add All Actions...
da: Tilføj alle aktioner...
ru: Добавить все Actions...

source: Restore Defaults
da: Genskab standardværdier
ru: По умолчанию

source: Add Params...
da: Tilføj parametre...
ru: Все параметры...

source: Add All Params
da: Tilføje alle parametre
ru: Добавить все пар-ры

source: Text file (*.txt)|*.txt|Any file (*.*)|*.*
da: Tekst fil (*.txt)|*.txt|Hvilkensomhelst fil (*.*)|*.*
ru: Добавить все пар-ры

source: Text file (*.txt)|*.txt|Any file (*)|*
da: Tekstfil (*.txt)|*.txt|Hvilkensomhelst fil (*)|*
ru: Добавить все пар-ры

source: XTR files (*.xtr)|*.xtr
da: XTR filer (*.xtr)|*.xtr
ru: XTR файлы (*.xtr)|*.xtr

source: Open Transformation File
da: Åbn transformationsfil
ru: Открыть файл преобразования

source: XML files (*.xml)|*.xml
da: XML filer (*.xml)|*.xml
ru: XML файлы (*.xml)|*.xml

source: Open Xml File
da: Åbn XML fil
ru: Открыть Xml файл

source: Data Access
da: Data adgang
ru: Доступ к данным

source: XMLDataFile must be specified
da: XMLDataFile skal angives

source: TransformationFile must be specified
da: TransformationFile skal angives

source: Version of Transformation File not supported
da: Denne transformationsfilsversion er ikke understøttet

source: Error saving file
da: Fejl ved gemning af fil

source: Error opening file
da: Fejl ved åbning af fil

source: Could not open file
da: Kunne ikke åbne fil

source: Error Loading XML
da: Fejl ved indlæsning af XML

source: Error on line %d, position %d
da: Fejl på linje %d, position %d

source: Reason: %s
da: Årsag: %s

source: XML Parse Error:
da: XML tydningsfejl:

source: Cannot read WideString from odd byte position
da: Kan ikke læse en WideString fra en ulige byte position

source: Cannot write WideString to odd byte position
da: Can ikke skrive WideString til en ulige byte position

source: Odd size not valid for WideString
da: Ulige størrelse er ikke gyldigt for WideString

source: Negative stream size invalid
da: Negativ streamstørrelse er ugyldig

source: Odd byte position not valid for WideString
da: Ulige byte position er ikke gyldig for WideString

source: Capacity cannot be less than size
da: Kapacitet kan ikke være mindre end størrelsen

source: Must have a target stream
da: Skal have en målstrøm

source: "%s" DOMImplementation already registered
da: "%s" DOMImplementation er allerede registreret
ru: "%s" DOMImplementation уже зарегистрирован

source: No matching DOM Vendor: "%s"
da: Ingen passende DOM Forhandler: "%s"
ru: Нет подходящего DOM Vendor: "%s"

source: Selected DOM Vendor does not support this property or method
da: Den valgte DOM forhandler understøtter ikke denne egenskab eller metode
ru: Выбранный DOM Vendor не поддерживает это свойство или метод

source: Property or Method "%s" is not supported by DOM Vendor "%s"
da: Egenskab eller metode "%s" er ikke understøttet af DOM Forhandleren "%s"
ru: Свойство или метод "%s" не поддерживается DOM Vendor "%s"

source: Node cannot be null
da: Knudepunktet kan ikke være null
ru: Узел не может быть пустым (null)

source: Microsoft MSXML is not installed
da: Microsoft MSXML er ikke installeret
ru: Microsoft MSXML не установлен

source: This property or method is not implemented in the Open XML Parser
da: Denne egenskab eller metode er ikke implementereti OpenXML parseren
ru: Это свойство или метод не реализован в Open XML Parser

source: Invalid string offset
da: Ugyldig tekst forskydning
ru: Неверное смещение в строке
