Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/delphi7.po
Languages: da, ru

source: Initial Value is not legal for this type of Grouping
da: Startværdi er ikke tilladt for denne type gruppering
ru: Initial Value - неверное для этого типа Grouping

source: Dimension Map is not the correct size
da: Dimensionskort har forkert størrelse
ru: Dimension Map - неверного размера

source: Cannot perform this action on an active Dimension Map
da: Kan ikke udføre denne handling på et aktivt dimensionskort
ru: Не могу выполнить это действие на активном Dimension Map

source: Not Available
da: Ikke tilgængelig
ru: Недопустимо

source: Information required to do Maximum Cell limit is not current. Do you want to fetch it now?
da: Nødvendige informationer for at sætte en maksimumgrænse for celler er ikke opdateret. Ønsker du at hente informationerne nu?
ru: Информация для получения Maximum Cell limit неактуальна. Обновить сейчас?

source: Date grouping is not allowed for fields of this type
da: Datogruppering er ikke tilladt for felter af denne type
ru: Группировка дат не разрешена для полей такого типа

source: Cannot build the Decision Cube with an empty data set
da: Kan ikke lave en DecisionCube med et tomt datasæt
ru: Не могу построить Decision Cube с пустым набором данных (data set)

source: Data set property is not assigned
da: Datasæt egenskab er ikke sat
ru: Свойство Data set не определено

source: No summaries are defined.
da: Ingen opsummeringer er defineret.
ru: Итоги не определены.

source: No dimension fields are defined.
da: Ingen dimensionsfelter er defineret.
ru: Поля измерений не определены.

source: The dimension types for this dataset cannot be determined automatically. You must map the fields to dimensions or summaries with the Decision Cube Editor
da: Dimensionstypen for dette datasæt kan ikke findes automatisk. Du skal kortlægge felterne til dimensioner eller opsummeringer med DecisionCube redigeringsværktøjet
ru: Типы измерений для этого набора данных не могут быть определены автоматически. Вы должны сопоставить поля измерениям или итогам в Редакторе Decision Cube

source: All dimension fields must be grouped.
da: Alle dimensionsfelter skal være grupperet.
ru: Все поля измерений должны быть сгруппированы.

source: The query may be incorrectly defined, or you may need to map its fields to active dimensions or summaries with the Decision Cube Editor
da: Køen er muligvis ikke defineret korrekt, eller også mangler du at kortlægge dens felter til aktive dimensioner eller opsummeringer med DecisionCube redigeringsværktøjet
ru: Запрос некорректен, либо нужно сопоставить его поля активным измерениям или итогам в Редакторе Decision Cube

source: The dataset may be incorrectly defined, or you may need to map its fields to active dimensions or summaries with the Decision Cube Editor
da: Datasættet er muligvis ukorrekt defineret, eller også skal du kortlægge dets felter til aktive dimensioner eller opsummeringer med DecisionCube redigeringsværktøjet
ru: Набор данных задан неверно, либо нужно сопоставить его поля активным измерениям или итогам в Редакторе Decision Cube

source: Average is calculated using sum and count summaries for each field. The necessary summaries have been added.
da: Gennemsnittet er beregnet ved hjælp af sum og antal for hvert felt. Disse er nu blevet tilføjet.
ru: Среднее вычисляется через итоги sum и count для каждого поля. Требуемые итоги были добавлены.

source: Average is calculated using a field sum and count(*). The necessary summaries have been added.
da: Gennemsnittet er beregnet ved hjælp af sum og count(*). De nødvendige opsummeringer er blevet tilføjet.
ru: Среднее вычисляется через поля sum и count(*). Требуемые итоги были добавлены.

source: Query is legal.
da: Forespørgslen er gyldig.
ru: Запрос правильный.

source: is already in the query
da: er allerede i forespørgslen
ru: - уже в запросе

source: is not an allowed summary type
da: er ikke en tilladt opsummeringstype
ru: - неверный тип итога

source: is not an allowed dimension type
da: er ikke en tilladt dimensionstype
ru: неверный тип измерения

source: Average summaries use Sum and Count
da: Gennemsnits benytter sum og antal
ru: Итоги Average используют Sum и Count

source: Do you still want to Exit?
da: Ønsker du stadigvæk at afslutte?
ru: Вы действительно хотите выйти?

source: The query you have created is not legal.
da: Forespørgslen, som du har oprettet, er ikke gyldig.
ru: Созданный Вами запрос неверен.

source: The query you have entered is not legal. Please correct it before continuing.
da: Forespørgslen, som du har oprettet, er ikke gyldig. Ret det venligst før du fortsætter.
ru: Введенный запрос неверен. Исправьте его для продолжения.

source: Could not remove the field
da: Kan ikke fjerne feltet
ru: Не могу удалить поле

source: All Fields
da: Alle felter
ru: Все поля

source: Query Fields
da: Forespørgslesfelter
ru: Поля запроса

source: &Edit Done
da: &Rediger afsluttet

source: &Edit Query
da: &Rediger forespørgsel

source: One or more fields of a type which cannot be tabulated were removed from the query.
da: En eller flere felter af en type, som ikke kan tabuleres, er blevet fjernet fra forespørgslen.
ru: Одно или более полей непригодного для отображения типа были удалены из запроса.

source: Decision Cube size excedes limits
da: Decision Cube størrelse er for stor
ru: Размер Decision Cube превысил пределы

source: The maximum allowed dimensions of %d has been exceeded.
da: Maksimum antal dimensioner %d er blevet overskredet.
ru: Превышен максимум допустимой размерности %d.

source: Total cell count of %d exceeds the maximum of %d.
da: Total celleantal %d overskrider maksimum, som er %d.
ru: Общее число ячеек %d превысило максимум - %d.

source: Field %s has an unsupported data type: %s
da: Felt %s har en ikke understøttet datatype: %s
ru: Поле %s имеет неподдерживаемый тип данных: %s

source: Scanning data set values...
da: Gennemser datasætværdier...
ru: Сканирование значений набора данных (data set)...

source: User canceled DecisionCube population.
da: Brugeren afbrød DecisionCube befolkningen.
ru: Вы прервали построение DecisionCube.

source: Grouping values ...
da: Grupperer værdier ...
ru: Группирование значений ...

source: Creating Cube index for %s ...
da: Opretter Cube indeks for %s ...
ru: Создание индекса Cube для %s ...

source: Unable to create derived summary.
da: Ude af stand til at oprette en afledt opsummering
ru: Не могу создать производный итог.

source: True
da: Sand

source: False
da: Falsk

source: The bin type does not match the fieldtype.
da: Bin typen passer ikke med felttypen.
ru: Тип контейнера не соответствует типу поля.

source: Fatal error in cache: code: %d
da: Fatal fejl i cache: kode: %d
ru: Фатальный сбой кэша: код: %d

source: String Data type not supported for summaries
da: String datatypen virker ikke med opsummeringer
ru: Строковый тип данных неприменим для итогов

source: Dataset is too large
da: Datasættet er for stort
ru: Набор данных (dataset) слишком велик

source: Building data store...
da: Opbygger datalager...
ru: Построение хранилища данных...

source: Sum of %s
da: Sum af %s
ru: Сумма %s

source: Count of %s
da: Antal %s
ru: Количество %s

source: Maximum of %s
da: Maksimum af %s
ru: Максимум %s

source: Minimum of %s
da: Minimum af %s
ru: Минимум %s

source: Average of %s
da: Gennemsnit af %s
ru: Среднее %s

source: Variance of %s
da: Varians af %s
ru: Отклонение %s

source: Standard Deviation of %s
da: Standardafvigelse af %s
ru: Стандартная девиация %s

source: Summary of %s
da: Sum af %s
ru: Итог %s

source: Unsupported Data Type %d
da: Ikke understøttet datatype %d
ru: Тип данных %d не поддерживается

source: Other Values
da: Andre værdier
ru: Другие Значения

source: Query lacks a Select/From clause.
da: Forespørgslen manlger en select/from del.
ru: В запросе отсутствует предложение Select/From.

source: No argument provided for an operator or summary
da: Operator eller opsummering har ingen argumenter
ru: Для оператора или итога не задан аргумент

source: An expression cannot be used for a grouping field
da: Et udtryk kan ikke bruges som grupperingsfelt
ru: Выражение нельзя использовать для поля группировки

source: Out of Bounds
da: Ude af området
ru: Выход за границы

source: &Graphical Query Builder...
da: %Grafisk forespørgslesbygger...
ru: &Графический построитель запросов...

source: &Decision Query Editor...
da: &Decision Forespørgselsredigeringsværktøj...
ru: Редактор &Decision запросов...

source: &Decision Cube Editor...
da: &Decision Cube redigeringsværktøj...
ru: Редактор &Decision Cube...

source: &Query Editor...
da: &Forespørgselsredigeringsværktøj...
ru: Редактор &запросов...

source: Sub&totals on/off
da: Tænk/sluk sub&totaler
ru: Под&итоги вкл/выкл

source: &Do not display Sparse Rows/Columns
da: &Vis ikke deludfyldte rækker og kolonner
ru: &Не показывать пустые строки/столбцы

source: &Display Sparse Rows/Columns
da: &Vis deludfyldte rækker og kolonner
ru: &Показывать пустые строки/столбцы

source: Grid Dimension Options
da: Gitterdimensionsvalgmuligheder
ru: Опции Grid Dimension

source: Grid Dimension Settings
da: Dimensionsindstillinger
ru: Настройки Grid Dimension

source: Cube Properties
da: Terningegenskaber
ru: Свойства Cube

source: Host is empty
da: Værten er tom

source: POP3 proxy ready
da: POP3 proxy er parat

source: command must be either USER or QUIT
da: Kommandoen skal enten være USER eller QUIT

source: POP3 proxy signing off
da: POP3 proxy logger af

source: Already connected.
da: Allerede forbundet.
ru: Уже соединено.

source: Byte index out of range.
da: Byteindeks er uden for gyldigt område.
ru: Индекс Byte вышел за границы.

source: Cannot allocate socket.
da: Kan ikke fremskaffe socket.
ru: Не могу зарезервировать socket.

source: Connection Closed Gracefully.
da: Forbindelsen blev lukket på korrekt vis.
ru: Соединение элегантно закрыто.

source: Could not bind socket. Address and port are already in use.
da: Kunne ikke tilknytte socket. Adresse og port er allerede i brug.
ru: Не могу привязать socket. Адрес и порт уже используются.

source: Failed attempting to retrieve time zone information.
da: Fejl ved forsøg på at skaffe tidszoneinformation.
ru: Ошибка при попытке получить информацию о часовом поясе.

source: No bindings specified.
da: Ingen bindinger angivet
ru: Привязки не определены.

source: OnExecute not assigned.
da: OnExecute er ikke sat.
ru: OnExecute не определен.

source: Not all bytes sent.
da: Ikke alle byte blev sendt.
ru: Посланы не все байты.

source: Not enough data in buffer.
da: Ikke nok data i buffer.
ru: Нет данных в буфере.

source: Package Size Too Big.
da: Pakkestørrelsen er for stor.
ru: Размер пакета слишком большой.

source: Raw Receive Error = 0.
da: Raw Receive fejl = 0.
ru: Ошибка приема Raw = 0.

source: ICMP Receive Error = 0.
da: ICMP modtagelsesfejl = 0.
ru: Ошибка приема ICMP = 0.

source: Winsock Initialization Error.
da: Fejl ved opstart af winsock.
ru: Ошибка инициализации Winsock.

source: %s could not be loaded.
da: %s kunne ikke indlæses.
ru: %s не может быть загружен.

source: Set Size Exceeded.
da: Sæt størrelse overskredet
ru: Установленный размер превышен.

source: Thread Class Not Specified.
da: Trådklasse er ikke angivet.
ru: Не определен класс потока (thread).

source: File "%s" not found
da: Filen "%s" kan ikke findes.
ru: Файл "%s" не найден

source: Cannot change target while active.
da: Kan ikke ændre fejlsøgningsmålet mens det er aktivt.
ru: Не могу изменить приемник, когда он активен.

source: Only one TIdAntiFreeze can exist per application.
da: Der må kun bruges en TIdAntiFreeze per program.
ru: Может быть создан только один TIdAntiFreeze в приложении.

source: %d: Circular links are not allowed
da: %d: Cirkulære referencer er ikke tilladt
ru: %d: циклические ссылки не допустимы

source: InterceptEnabled cannot be set to true when Intercept is nil.
da: InterceptEnabled kan ikke være sand, når Intercept er nil.
ru: InterceptEnabled не может быть установлен в true когда Intercept равен nil.

source: IOHandler value is not valid
da: IOHandler værdien er ikke gyldig
ru: Значение IOHandler - неверное

source: Not Connected
da: Ikke forbundet
ru: Не соединен

source: Object type not supported.
da: Objekttypen er ikke understøttet
ru: Тип объекта не поддерживается.

source: AcceptWait property cannot be modified while server is active.
da: AcceptWait egenskaben kan ikke modificeres mens serveren er aktiv.

source: Terminate Thread Timeout
da: Tidsudløb for trådstandsning
ru: Завершить тайм-аут потока

source: No execute handler found.
da: Ingen execute håndterer blev fundet
ru: Не найдено execute обработчиков.

source: No data to read.
da: Ingen data til læsning.
ru: Нет данных для чтения.

source: Can not bind in port range (%d - %d)
da: Kan ikke forbinde i port området (%d - %d)
ru: Не могу связать в диапазоне портов (%d - %d)

source: Invalid Port Range (%d - %d)
da: Ugyldigt portområde (%d - %d)
ru: Неверный диапазон портов (%d - %d)

source: Read Timeout
da: Tidsudløb ved læsning
ru: Тайм-аут чтения

source: Max line length exceeded.
da: Maksimal linielængde overskredet.
ru: Превышена макс. длина строки.

source: UDP Receive Error = 0.
da: UDP Modtagelsesfejl = 0.
ru: Ошибка приема UDP = 0.

source: No command handler found.
da: Ingen kommandohåndterer blev fundet.
ru: Дескрипторов команды не найдено.

source: Cannot perform task while server is active.
da: Kan ikke udføre opgaven mens serveren er aktiv.
ru: Не могу выполнить задачу, пока сервер активен.

source: @ Outside address
da: @ udenfor adressen
ru: @ внешний адрес

source: Unable to initialize compressor
da: Ude af stand til at starte kompressor
ru: Не могу инициализировать компрессор

source: Unable to initialize decompressor
da: Ude af stand til at starte dekompressoren
ru: Не могу инициализировать декомпрессор

source: Compression error
da: Kompressionsfejl
ru: Ошибка сжатия

source: Decompression error
da: Dekompressionsfejl
ru: Ошибка распаковки

source: Error on call Winsock2 library function %s
da: Fejl ved kald til Winsock2 biblioteksfunktionen %s
ru: Ошибка вызова фнкции %s библиотеки Winsock2

source: Error on loading Winsock2 library (%s)
da: Fejl ved inlæsning af Winsock2 biblioteket (%s)
ru: Ошибка загрузки библиотеки Winsock2 (%s)

source: Extension is empty
da: Endelsen er tom
ru: Расширение - пустое

source: Mimetype is empty
da: Mimetypen er tom
ru: Mimetype - пустое

source: Extension already exits
da: Endelsen findes allerede
ru: Расширение уже существует

source: Indy Clients
da: Indy klienter

source: Indy Servers
da: Indy servere

source: Resolving hostname %s.
da: Finder IP for værtsnavn %s.
ru: Поиск хоста %s.

source: Connecting to %s.
da: Forbinder til %s.
ru: Подключение к %s.

source: Connected.
da: Forbundet.
ru: Соединено.

source: Disconnecting.
da: Afbryder forbindelsen.
ru: Отсоединение от %s.

source: Disconnected.
da: Afbrudt.
ru: Отсоединено.

source: Connect timed out.
da: Forbindelse tidsudløb.
ru: Превышено время ожидания соединения.

source: Encoding text
da: Koder tekst
ru: Кодирование текста

source: Encoding attachment
da: Koder vedhæftning
ru: Кодирование вложения

source: Unknown Message Part Type.
da: Ukendt meddelelsesdelstype
ru: Неизвестный Message Part Type.

source: Invalid Encoding. UU only allows Body and Attachments
da: Ugyldig kodning. UU tillader kun krop og vedhæftninger.
ru: Неверное кодирование. UU позволено только с телом и вложениями

source: Connection explicitly refused by NNTP server.
da: Forbindelsen blev eksplicit nægtet af NNTP værten.
ru: В соединении явно отказано NNTP сервером.

source: Stringlist not initialized!
da: Stringlist er ikke startet op!
ru: Stringlist не проинициализирован!

source: No OnNewsgroupList event has been defined.
da: Ingen OnNewsgroupList hændelse er blevet defineret.
ru: Не определено событие OnNewsgroupList.

source: No OnNewGroupsList event has been defined.
da: Ingen OnNewGroupsList hændelse er blevet defineret.
ru: Не определено событие OnNewGroupsList.

source: No OnNewNewsList event has been defined.
da: Ingen OnNewNewsList hændelse er blevet defineret.
ru: Не определено событие OnNewNewsList.

source: Recv
da: Modt
ru: Полч:

source: Sent
da: Sendt
ru: Посл:

source: Chunk Started
da: Chunks startet
ru: Кусок стартовал

source: Continue
da: Fortsæt
ru: Продолжение

source: Switching protocols
da: Skifter protokoller
ru: Переключение протоколов

source: Created
da: Oprettet
ru: Создан

source: Accepted
da: Akcepteret
ru: Принят

source: Non-authoritative Information
da: Ikke autoritativ information
ru: Ненадежная информация

source: No Content
da: Intet indhold
ru: Нет содержимого

source: Reset Content
da: Nulstil indhold
ru: Сброс содержимого

source: Partial Content
da: Delvist indhold
ru: Частичное содержимое

source: Moved Permanently
da: Permanent flyttet
ru: Перемещен постоянно

source: Moved Temporarily
da: Midlertidigt flyttet
ru: Перемещен временно

source: See Other
da: Se andet
ru: Смотри другое

source: Not Modified
da: Ikke ændret
ru: Не изменен

source: Use Proxy
da: Benyt proxy
ru: Исп. прокси

source: Bad Request
da: Dårlig forespørgsel
ru: Неверный запрос

source: Unauthorized
da: Uautoriseret
ru: Не авторизовано

source: Forbidden
da: Forbudt
ru: Запрещено

source: Not Found
da: Ikke fundet
ru: Не найдено

source: Method not allowed
da: Metode er ikke tilladt
ru: Метод не допустим

source: Not Acceptable
da: Ikke akceptabelt
ru: Недопустимый

source: Proxy Authentication Required
da: Proxy autentifikation er nødvendig
ru: Авторизация на прокси требуется

source: Request Timeout
da: Tidsudløb på forespørgsel

source: Conflict
da: Konflikt
ru: Конфликт

source: Gone
da: Væk
ru: Готово

source: Length Required
da: Længde påkrævet
ru: Length требуется

source: Precondition Failed
da: Førbetingelse fejlede
ru: Ошибка Precondition

source: Request Entity To Long
da: Forespørgselsdel er for lang

source: Request-URI Too Long. 256 Chars max
da: Forespørgsels-URI for lang. Max 256 tegn.
ru: Request-URI слишком длинный. Максимум 256 символов

source: Unsupported Media Type
da: Medietype er ikke understøttet
ru: Неподдерживаемый тип мультимедиа

source: Internal Server Error
da: Intern værtsfejl
ru: Внутренняя ошибка сервера

source: Not Implemented
da: Ikke implementeret
ru: Невыполненный

source: Bad Gateway
da: Dårlig gateway
ru: Неверный шлюз

source: Service Unavailable
da: Service ikke tilgængelig
ru: Сервис (служба) не доступен

source: Gateway timeout
da: Gateway tidsudløb
ru: Таймаут шлюза

source: HTTP version not supported
da: HTTP version er ikke understøttet
ru: Версия HTTP не поддерживается

source: Unknown Response Code
da: Ukendt svarkode
ru: Неизвестный код ответа

source: Header has already been written.
da: Hoved er allerede blevet skrevet
ru: Заголовок уже написан.

source: Error in parsing command.
da: Fejl ved forståelse af kommando.
ru: Ошибка при разборе команды.

source: Unsupported authorization scheme.
da: Autorisationsskema er ikke understøttet.
ru: Неподдерживаемая схема авторизации.

source: Cannot change session state when the server is active.
da: Kan ikke ændre sessionstilstand når værten er aktiv.
ru: Не могу изменить состояние сессии, когда сервер активен.

source: This authentication method is already registered with class name %s.
da: Denne autentifikationsmetode er allerede registreret med klassenavnet %s.
ru: Этот метод авторизации уже зарегистрирован с классом %s.

source: Unsupported hash algorithm. This implementation supports only MD5 encoding.
da: Hashalgoritme er ikke understøttet. Denne implementering virker kun med MD5 hash kodning.
ru: Неподдерживаемый hash алгоритм. Эта реализация поддерживает только кодирование MD5.

source: Successfull API call
da: API kald lykkedes
ru: Успешный вызов API

source: Not enough memory is available to complete this request
da: Ikke nok hukommelse til at udføre denne forespørgsel
ru: Нет свободной памяти для завершения этого запроса

source: The handle specified is invalid
da: Det angivne håndtag er ikke gyldigt
ru: Указанный дескриптор - неверный

source: The function requested is not supported
da: Den forespurgte funktion er ikke understøttet
ru: Требуемая функция не поддерживается

source: The specified target is unknown or unreachable
da: Det angivne mål er ikke kendt eller kan ikke nås
ru: Указанный приемник (target) неизвестен или недостижим

source: The Local Security Authority cannot be contacted
da: Den lokale sikkerhedsautoritet kan ikke kontaktes

source: The requested security package does not exist
da: Den forespurgte sikkerhedspakke findes ikke
ru: Требуемый пакет защиты не существует

source: The caller is not the owner of the desired credentials
da: Opkalderen ejer ikke de nødvendige rettigheder (credentials)

source: The security package failed to initialize, and cannot be installed
da: Sikkerhedspakken kunne ikke starte, og kan ikke installeres
ru: Пакет защиты вызвал сбой при инициализации, и не может быть установлен

source: The token supplied to the function is invalid
da: Funktionen fik en ugyldig token

source: The security package is not able to marshall the logon buffer, so the logon attempt has failed
da: Sikkerhedspakken er ikke i stand til at kontrollere logonbufferen, så logonforsøget fejlede
ru: Пакет защиты не способен разместить буффер входа, таким образом, попытка входа была неудачной

source: The per-message Quality of Protection is not supported by the security package
da: Per-besked Quality of Protection er ikke understøttet af sikkerhedspakken
ru: The per-message Quality of Protection не поддерживается пакетом защиты

source: The security context does not allow impersonation of the client
da: Sikkerhedskonteksten tillader ikke at klienten lader som om den er en anden

source: The logon attempt failed
da: Logonforsøget fejlede
ru: Неудачная попытка входа

source: The credentials supplied to the package were not recognized
da: Rettighederne (credentials) som blev givet til pakken blev ikke genkendt
ru: Полномочия, данные пакету, не опознаны

source: No credentials are available in the security package
da: Ingen rettigheder (credentials) er tilgængelige i sikkerhedspakken

source: The message or signature supplied for verification has been altered
da: Meddelelsen eller signaturen er blevet ændret og signaturens sammenhæng med meddelelsen kan derfor ikke verificeres

source: The message supplied for verification is out of sequence
da: Meddelelsen som blev forsøgt verificeret er ude af sekvensrækkefølge

source: No authority could be contacted for authentication.
da: Ingen autoritet kunne kontaktes til autentificering

source: The function completed successfully, but must be called again to complete the context
da: Funktionen afsluttede med succes, men skal kaldes igen for at færdiggøre kontekst
ru: Функция завершилась успешно, но должна быть вызвана снова для завершения контекста

source: The function completed successfully, but CompleteToken must be called
da: Funktionen afsluttede med succes, men CompleteToken skal kaldes
ru: Функция завершилась успешно, но должен быть вызван CompleteToken

source: The function completed successfully, but both CompleteToken and this function must be called to complete the context
da: Funktionen afsluttede med succes, men både CompleteToken og denne funktion skal kaldes for at færdiggøre kontekst
ru: Функция завершилась успешно, но CompleteToken и эта функция должны быть вызваны для завершения контекста

source: The logon was completed, but no network authority was available. The logon was made using locally known information
da: Logon blev foretages, men ingen netværksautoritet var tilgængelig. Logon blev gjort med lokalt tilgængelige oplysninger
ru: Вход завершен, но нет доступных сетевых полномочий. Вход был сделан с использованием локально известной информации
