Repository: kuksundo/hgs
Catalog: common/dxgettext/trunk/translations/*/delphi5.po
Languages: pt_br

source: Database name is missing
pt_br: O nome do Database esta faltando

source: Transaction is not active
pt_br: Transação não está ativa

source: Transaction is active
pt_br: Transação está ativa

source: Timeout values cannot be negative
pt_br: Valores de Timeout não podem ser negativos

source: No databases are listed in transaction component
pt_br: Nenhuma Database está listada no componente de transação

source: Updating wrong database
pt_br: Não é possível atualizar, %s não pertence a %s

source: Updating wrong transaction. Unique transaction expected in set
pt_br: Atualizando transação errada. A única transação esperada em indicação

source: Database not assigned
pt_br: Database não indicada

source: Transaction not assigned
pt_br: Transaction não indicada

source: XSQLDA index out of range
pt_br: Indice XSQLDA está fora de faixa

source: XSQLDA name does not exist (%s)
pt_br: Nome do XSQLDA não existe (%s)

source: End of file
pt_br: Fim do Arquivo

source: Beginning of file
pt_br: Inicio do Arquivo

source: Invalid statement handle
pt_br: Declaração de handle inválida

source: IBSQL Open
pt_br: IBSQL Aberto

source: IBSQL Closed
pt_br: IBSQL Fechado

source: Dataset open
pt_br: Não é possível realizar esta operação em um arquivo aberto

source: Dataset closed
pt_br: Não é possível realizar esta operação em um arquivo fechado

source: Unknown SQL Data type (%d)
pt_br: SQL Data type desconhecido (%d)

source: Invalid column index (index exceeds permitted range)
pt_br: Indice de coluna inválido (Indice excede faixa permitida)

source: Invalid parameter index (index exceeds permitted range)
pt_br: Indice de parametro inválido (Indice excede faixa permitida)

source: Invalid data conversion
pt_br: Conversão de dados inválida

source: Column cannot be set to null (%s)
pt_br: A coluna não pode ser nula (%s)

source: Blob stream cannot be read
pt_br: Blob Stream não pode ser lido

source: Blob stream cannot be written
pt_br: Blob stream não pode ser escrito

source: Empty query
pt_br: Query vazia

source: Cannot "open" a non-select statement. Use ExecQuery
pt_br: Impossível "abrir" uma transação não selecionada. Use ExecQuery

source: No access to field "%s"
pt_br: Não é possível acessar o campo '%s' em um filtro

source: Field "%s" is read-only
pt_br: Campo '%s' não pode ser modificado

source: Field "%s" not found
pt_br: Campo '%s' não encontrado

source: Cannot insert into dataset. (No insert query)
pt_br: Impossível inserir no dataset. (Não insere query)

source: Cannot post. (No update/insert query)
pt_br: Impossível postar. (Não atualiza/insere query)

source: Cannot update. (No update query)
pt_br: Impossível atualizar. (Não atualiza query)

source: Cannot delete from dataset. (No delete query)
pt_br: Impossível apagar do dataset. (Não apaga query)

source: Cannot refresh row. (No refresh query)
pt_br: Impossível recarregar. (Não recarrega query)

source: Buffer not set
pt_br: Buffer não definido

source: Circular references not permitted
pt_br: Referências circulares não são permitidas

source: SQL Parse Error: %s
pt_br: Erro do SQL Parse: %s

source: User abort
pt_br: Usuário cancelou

source: Data set is uni-directional
pt_br: Operação não suportada em um Dataset unidirecional

source: Cannot create shared resource. (Windows error %d)
pt_br: Impossível criar recurso compartilhado. (Erro do Windows %d)

source: Windows API error. (Windows error %d [$%.8x])
pt_br: Erro da API do Windows. (Erro do Windows %d [$%.8x])

source: Column lists do not match
pt_br: Lista de colunas não encontrada

source: Column types don't match. (From index: %d; To index: %d)
pt_br: Tipos de colunas não encontrado. (Do indice: %d; até o indice: %d)

source: Can't end a shared transaction unless it is forced and equal to the transaction's TimeoutAction
pt_br: Impossível finalizar transação compartilhada enquanto ela é forçada e igual a TimeoutAction da transação

source: Unsupported Field Type
pt_br: Tipo de campo não suportado

source: Circular DataLink Reference
pt_br: Ligações de dados circulares não são permitidas

source: Empty SQL Statement
pt_br: Nenhuma declaração SQL disponível

source: use Open for a Select Statement
pt_br: use Abrir para uma declaração selecionada

source: Required Param value not set
pt_br: Valor do parametro requerido não definido

source: No Stored Procedure Name assigned
pt_br: Stored Procedure Name não foi definido

source: use ExecProc for Procedure; use TQuery for Select procedures
pt_br: use ExecProc para proceder; use TQuery para selecionar procedimentos

source: Update Failed
pt_br: Atualização falhou

source: CachedUpdates not enabled
pt_br: CachedUpdates não ativa

source: Request is not live - cannot modify
pt_br: Requerimento não está ativo - impossível modificar

source: No Provider
pt_br: Não há Provider disponível

source: No Records Affected
pt_br: Nenhum Registro Afetado

source: No Table Name assigned
pt_br: Propriedade TableName faltando

source: Cannot Create Primary Index; are created automatically
pt_br: Impossível criar Indice Primário; Eles são criados automaticamente

source: Cannot Drop System Index
pt_br: Impossível soltar Indice do Sistema

source: Table Name Mismatch
pt_br: Combinação de Nome da tabela inválido

source: Index Field Missing
pt_br: Não é possível acessar o índice do campo '%s'

source: Cannot Cancel events while processing
pt_br: Você não pode chamar o CancelEvents de dentro de um handler do OnEventAlert

source: Invalid Event
pt_br: O evento em branco adicionado lista de eventos EventAlerter é inválido

source: Exceded Maximum Event limits
pt_br: Você só pode registrar 15 eventos por EventAlerter

source: No Events Registered
pt_br: Você precisa registrar os eventos antes de enfileiralos

source: Invalid Queueing
pt_br: Você não pode chamar o QueueEvents de dentro de um handler do OnEventAlert

source: Invalid Registration
pt_br: Você não pode registrar/desregistrar eventos de dentro de um handler do OnEventAlert

source: Invalid Batch Move
pt_br: Parâmetros inválidos para batch move

source: SQL Dialect Invalid
pt_br: Dialeto SQL inválido

source: SPB Constant Not supported
pt_br: Constante SPB não suportado

source: SPB Constant Unknown
pt_br: Constante SPB desconhecida

source: Cannot perform operation -- service is not attached
pt_br: Impossível completar operação -- serviço não está anexado

source: Cannot perform operation -- service is attached
pt_br: Impossível completar operação -- serviço está anexado

source: Server Name Missing
pt_br: Nome do Servidor faltando

source: Query Parameters missing or incorrect
pt_br: Parametros da Query faltando ou incorretos

source: start Parameters missing or incorrect
pt_br: Parametros iniciais faltando ou incorretos

source: Unexpected Output buffer value
pt_br: Valor de saida do buffer não esperado

source: Generic ServiceStart not applicable: Use Specific Procedures to set configuration params
pt_br: ServiceStart generico não aplicável: Use procedimentos especificos para definir os parametros de configuração

source: SQL Monitor Instance is already present
pt_br: Instancia do SQL Monitor já existe

source: EOF in comment detected
pt_br: EOF em comentário detectado

source: EOF in string detected
pt_br: EOF em string detectado

source: Parameter name expected
pt_br: Nome do parametro esperado

source: Cannot print value
pt_br: Impossível imprimir valor

source: Missing data provider or data packet
pt_br: Provedor de dados ou base de dados perdidos

source: Invalid data packet
pt_br: Base de dados inválida

source: Must apply updates before refreshing data
pt_br: É necessário aplicar as atualizações antes de atualizar os dados

source: Invalid provider. Provider was freed by the application server
pt_br: Provedor inválido. o provedor foi livrado pelo servidor de aplicação

source: Cannot connect, %s must contain a valid ServerName or ServerGUID
pt_br: Não é possível conectar, %s necessita do ServerName ou ServerGUID validos

source: Cannot connect, %s must contain a valid repository id
pt_br: Não é possível conectar, %s necessita conter um container id válido

source: Grouping level exceeds current index field count
pt_br: Nivel de agrupamento excede a contagem atual do campo do deslocamento predeterminado

source: Grouping level not defined
pt_br: Nível de agrupamento não definido

source: Circular provider references not allowed
pt_br: Referências de provedor circulares não são permitidas

source: Error loading MIDAS.DLL
pt_br: Erro carregando MIDAS.DLL

source: No fields defined. Cannot create dataset
pt_br: Nenhum campo foi definido. Impossível criar dataset

source: Error reading from socket
pt_br: Erro de leitura no socket

source: Provider name "%s" was not recognized by the server
pt_br: Nome do provedor "%s" não foi reconhecido pelo servidor

source: Unsupported variant type: %s
pt_br: Tipo de variante: %s não suportado

source: Invalid action received: %d
pt_br: A ação recebida é inválida: %d

source: Invalid response
pt_br: Resposta incorreta

source: Update affected more than 1 record.
pt_br: Atualizacao afeta mais de um registro.

source: Value cannot be stored in an optional parameter
pt_br: Não pode ser armazenado valores em um parâmetro opcional

source: Record or field constraint failed.
pt_br: Falha do registro ou do campo

source: Field
pt_br: Campo

source: Cannot apply updates to a ReadOnly provider
pt_br: Não é possível aplicar atualizações em um provedor somente-leitura

source: Unable to find record. No key specified
pt_br: Não é possível localizar o registro. Nenhuma chave foi especificada

source: Field name cannot be longer then %d characters. Try setting ObjectView to True on the dataset
pt_br: O nome do campo não pode ser maior que %d caracteres.Tente ajustar o ObjectView para True no dataset

source: Cannot resolve to dataset when using nested datasets or references
pt_br: Não é possível resolver a série de dados ao usar séries ou referências aninhadas

source: Preparation of record constraint failed with error "%s"
pt_br: A preparação do registro de confinamento falhou com erro "%s"

source: Preparation of field constraint failed with error "%s"
pt_br: O Confinamento padrão do campo falhou com erro "%s"

source: Preparation of default expression failed with error "%s"
pt_br: Expressão padrão preparada falhou com erro "%s"

source: Array elements of type %s are not supported
pt_br: Tipo de elementos do array %s não são suportados

source: Unable to resolve records. Table name not found.
pt_br: Propriedade TableName faltando

source: Modifications are not allowed
pt_br: Modificaçã não e permitida

source: Deletes are not allowed
pt_br: Exclusão não e permitida

source: Inserts are not allowed
pt_br: Inserçã não e permitida

source: CommandText changes are not allowed
pt_br: Alterar CommandText não e permitido

source: No server available
pt_br: Nenhum servidor disponível

source: Expected return value not received
pt_br: Não foi recebido nenhum valor do retorno que era aguardado

source: URL required
pt_br: URL e necessaria

source: URL must be in the form "http://server.company.com/scripts/httpsrvr.dll"
pt_br: URL deve estar na forma "http://server.company.com/scripts/httpsrvr.dll"

source: Server is busy
pt_br: Servidor ocupado

source: Object not available: %s
pt_br: Objeto não disponivel: %s

source: '%s' is not a valid property value
pt_br: '%s' não é um valor de propriedade válido

source: OLE control activation failed
pt_br: A ativação do controle OLE falhou

source: Could not obtain OLE control window handle
pt_br: Impossível obter "window handle" controle OLE

source: Variant does not reference an OLE object
pt_br: Variante não se refere a um objeto OLE

source: Variant does not reference an automation object
pt_br: Variante não se refere a um objeto de automação

source: Method '%s' not supported by OLE object
pt_br: Metodo '%s' não é suportado por um objeto de automação

source: Link Properties
pt_br: Propriedades de Ligação

source: Cannot link to an invalid source.
pt_br: Impossível se ligar a uma origem inválida.

source: Break link operation is not supported.
pt_br: Operação de Quebra de Ligação não suportada.

source: Linked %s
pt_br: Ligado %s

source: Operation not allowed on an empty OLE container
pt_br: Operação não suportada em um OLE vazio

source: Invalid object verb
pt_br: Objeto verbo inválido

source: %s Properties
pt_br: %s Propriedades

source: License information for %s is invalid
pt_br: Informações de licensa para %s é inválida

source: License information for %s not found. You cannot use this control in design mode
pt_br: Informações de licensa para %s não foi encontrada. Você não pode usar este controle em modo de criação

source: Unable to retrieve a pointer to a running object registered with OLE for %s/%s
pt_br: Impossível aportar um ponteiro para um objeto em execução registrado com OLE para %s/%s

source: The Socket Server can only be run as a service on NT 3.51 and prior
pt_br: O Socket Server pode somente ser executado como um serviço no NT 3.51 e anteriores

source: Cannot exit when there are active connections. Kill connections?
pt_br: Impossível sair enquanto tiver conexões ativas. Forçar fechamento das conexões?

source: Cannot change settings when there are active connections. Kill connections?
pt_br: Impossível alterar as configurações enquanto tiver conexões ativas. Forçar fechamento das conexões?

source: Disconnecting clients can cause application errors. Continue?
pt_br: Desconectar os clientes pode causar erros no aplicativo. Continuar?

source: Error opening port %d with error: %s
pt_br: Erro abrindo porta %d com erro: %s

source: (Not Shown)
pt_br: (Não Mostrar)

source: %d current connections
pt_br: %d conexões ativas

source: The Socket Server is already running
pt_br: O Socket Server está ativo no momento

source: This change will not take affect until the Socket Server is restarted
pt_br: Estas configurações não terão efeitos enquanto o Socket Server não for reiniciado

source: Invalid Action registration
pt_br: Registo de ação inválido

source: Duplicate action name
pt_br: Ação nome Duplicada

source: Only one WebDispatcher per form/data module
pt_br: Somente um WebDispatcher por Form/Data Module

source: Name
pt_br: Nome

source: PathInfo
pt_br: Info do Caminho

source: Enabled
pt_br: Ativa

source: Producer
pt_br: Produtor

source: Too many table columns
pt_br: Grade requesitada para mostrar mais que 256 colunas

source: Field Name
pt_br: Campo Nome

source: Field Type
pt_br: Campo Tipo

source: Error creating system registry entry
pt_br: Erro criando entrada no registro do sistem

source: Object factory for class %s missing
pt_br: A fábrica de objetos para a classe %s está faltando

source: Type information missing for class %s
pt_br: Tipo de informação faltando para a classe %s

source: Incorrect type information for class %s
pt_br: Tipo de informação incorreta para a classe %s

source: Dispatch interface missing from class %s
pt_br: Faltando interface de envio da classe %s

source: Method '%s' not supported by automation object
pt_br: Metodo '%s' não é suportado por um objeto de automação

source: DCOM not installed
pt_br: DCOM não instalado

source: COM Server Warning
pt_br: Aviso do COM Server

source: There are still active COM objects in this application. One or more clients may have references to these objects, so manually closing
pt_br: Ainda há objetos COM ativos neste aplicativo. Um ou mais clientes podem ter referências para este objetos, apenas fechando manualmente

source: this application may cause those client application(s) to fail. Are you sure you want to close this application?
pt_br: Este aplicativo pode causar falhas para os Aplicativo(s) Cliente. Você quer fechar este aplicativo?

source: <unknown>
pt_br: <desconhecido>

source: '%s' is not a valid integer value
pt_br: ''%s'' não é um valor inteiro válido

source: '%s' is not a valid floating point value
pt_br: '%s' não é um valor de Ponto Flutuante válido

source: '%s' is not a valid date
pt_br: ''%s'' não é uma Data válida

source: '%s' is not a valid time
pt_br: ''%s'' não é uma Hora válida

source: '%s' is not a valid date and time
pt_br: ''%s'' não é uma Data e Hora válidos

source: Out of memory
pt_br: Sem memória

source: I/O error %d
pt_br: Erro I/O %d

source: File not found
pt_br: Arquivo não encontrado

source: Invalid filename
pt_br: Nome de arquivo inválido - %s

source: Too many open files
pt_br: Existem muitos arquivos abertos

source: File access denied
pt_br: Acesso ao arquivo negado

source: Read beyond end of file
pt_br: A leitura ultapassou o Fim do Arquivo(EOF)

source: Disk full
pt_br: Disco cheio

source: Invalid numeric input
pt_br: Valor numerico inserido inválido

source: Division by zero
pt_br: Divisão por zero

source: Range check error
pt_br: Erro de checagem de faixa

source: Integer overflow
pt_br: Extravasamento de valor inteito

source: Invalid floating point operation
pt_br: Operação de Ponto Flutuante inválido

source: Floating point division by zero
pt_br: Divisão por zero de Ponto Flutuante

source: Floating point overflow
pt_br: Extravasamento de valor de Ponto Flutuante

source: Floating point underflow
pt_br: Sub-carregamento de valor de Ponto Flutuante

source: Invalid pointer operation
pt_br: Operação de ponteiro inválido

source: Invalid class typecast
pt_br: Typecast de Classe inválido

source: Access violation at address %p. %s of address %p
pt_br: Violação de accesso no endereço %p. %s do endereço %p

source: Stack overflow
pt_br: Extravasamento da pilha

source: Control-C hit
pt_br: Control-C pressionada

source: Privileged instruction
pt_br: Instruções de privilégio

source: Operation aborted
pt_br: Operação abortada

source: Exception %s in module %s at %p. %s%s
pt_br: Exceção %s no modulo %s not %p. %s%s

source: Application Error
pt_br: Erro do aplicativo

source: Format '%s' invalid or incompatible with argument
pt_br: Formato gráfico inválido

source: No argument for format '%s'
pt_br: Nenhum argumento para formato '%s'

source: Invalid variant type conversion
pt_br: Conversão de tipo variante inválido

source: Invalid variant operation
pt_br: Operação variante inválida

source: Variant method calls not supported
pt_br: Metodo de chamada variante não suportada

source: Format result longer than 4096 characters
pt_br: O formato do resultado é maior que 4096 caracteres

source: Format string too long
pt_br: String de formato muito longa

source: Error creating variant array
pt_br: Erro criando array do tipo variant

source: Variant is not an array
pt_br: Tipo variant não é um array

source: Variant array index out of bounds
pt_br: Índice de array do tipo variant fora dos limites

source: External exception %x
pt_br: Exceção externa %x

source: Assertion failed
pt_br: Falha de asserção

source: Interface not supported
pt_br: Interface não suportada

source: Exception in safecall method
pt_br: Exceção em método de chamada segura

source: %s (%s, line %d)
pt_br: %s (%s, linha %d)

source: Abstract Error
pt_br: Erro Abstrato

source: Access violation at address %p in module '%s'. %s of address %p
pt_br: Violação de accesso no endereço %p no modulo '%s'. %s do endereço %p

source: Cannot access package information for package '%s'
pt_br: Impossível accessar pacote de informações para pacote '%s'

source: Can't load package %s. %s
pt_br: Impossíver ler pacote %s. %s

source: Invalid package file '%s'
pt_br: Arquivo de pacote '%s' inválido

source: Invalid package handle
pt_br: Handle de pacote inválido

source: Application is not licensed to use this feature
pt_br: Este aplicativo não está licensiado a usar esta ferramenta

source: Feb
pt_br: Fev

source: Apr
pt_br: Abr

source: May
pt_br: Maio

source: Aug
pt_br: Ago

source: Sep
pt_br: Set

source: Oct
pt_br: Out

source: Dec
pt_br: Dez

source: January
pt_br: Janeiro

source: February
pt_br: Fevereiro

source: March
pt_br: Março

source: April
pt_br: Abril

source: June
pt_br: Junho

source: July
pt_br: Julho

source: August
pt_br: Agosto

source: September
pt_br: Setembro

source: October
pt_br: Outubro

source: November
pt_br: Novembro

source: December
pt_br: Dezembro

source: Sun
pt_br: Dom

source: Mon
pt_br: Seg

source: Tue
pt_br: Ter

source: Wed
pt_br: Qua

source: Thu
pt_br: Qui

source: Fri
pt_br: Sex

source: Sat
pt_br: Sab

source: Sunday
pt_br: Domingo

source: Monday
pt_br: Segunda

source: Tuesday
pt_br: Terça

source: Wednesday
pt_br: Quarta

source: Thursday
pt_br: Quinta

source: Friday
pt_br: Sexta

source: Saturday
pt_br: Sábado

source: Add Fields
pt_br: Adicionar Campos
