Repository: kuksundo/hgs
Catalog: OpenSrc/lib/dxgettext/trunk/translations/*/infopower2000.po
Languages: da

source: About InfoPower
da: Om InfoPower

source: Registration No.:
da: Registration Nr.:

source: Edit Linked Field
da: Rediger sammenkædet felt

source: Select Displayed Field
da: Vælg felt til visning

source: Displayed Field
da: Vist felt

source: Select field from linked table to display
da: Vælg felt fra sammenkædet tabel til visning

source: Select Joined Fields
da: Vælg sammenkædede felter

source: Master Fields
da: Mesterfelter

source: Index Fields
da: Indeksfelter

source: Available Indexes
da: Indekser til rådighed

source: Joined Fields
da: Sammenkædede felter

source: Select index to use from linked table
da: Vælg indeks fra sammenkædet tabel

source: Clear currently joined fields
da: Slet valg af sammenkædede felter

source: Clear
da: Slet

source: Join selected master and index field
da: Sammenkæd valgt mester og indeks felt

source: Select linked table for this field
da: Vælg sammenkædet tabel for dette felt

source: Select Linked Table
da: Vælg sammenkædet tabel

source: Add New (Ins)
da: Tilføj ny (Ins)

source: Add
da: Tilføj

source: Delete Selected
da: Slet markeret

source: Delete
da: Slet

source: Move Selected Up (Ctrl-Up)
da: Flyt den markerede op (Ctrl-Op)

source: Move Up
da: Flyt op

source: Move Selected Down (Ctrl-Down)
da: Flyt den markerede ned (Ctrl-Ned)

source: Move Down
da: Flyt ned

source: &Edit Mask
da: &Redigeringsmaske

source: &Delete Mask
da: &Slettemaske

source: Super Search
da: Supersøgning

source: &Fields
da: &Felter

source: Sort field list alphabetically or in their natural logical order
da: Sorter feltlisten alfabetisk eller i den naturlige rækkefølge

source: Field Order
da: Feltrækkefølge

source: Alpha&betic &Logical
da: Alfa&betisk &Naturlig

source: Field &Value
da: Felt&værdi

source: Specify how the Field Value should be compared
da: Specificer, hvordan feltværdien skal sammenlignes

source: Search Type
da: Søgetype

source: &Exact Match &Partial Match at Beginning Partial Match Any&where
da: &Passer præcist &Starten passer En &del af teksten passer

source: Searching is case-sensitive
da: Søgningen ser forskel på store og små bogstaver

source: Case Sensi&tive
da: &Forskel på store og små bogstaver

source: Show records that do not match the field value criteria
da: Vis poster som ikke passer med feltværdikriterierne

source: N&on-matching records
da: Poster som &ikke passer

source: Clear the current field's search value
da: Slet søgeværdien for det markerede felt

source: &Clear
da: &Ryd

source: Enter field's search value
da: Indtast feltet søgeværdi

source: &Starting Range
da: &Startområde

source: En&ding Range
da: Sl&utområde

source: Enter starting range for field
da: Indtast startområdet for felt

source: Enter ending range for field
da: Indtast slutområdet for felt

source: Clear starting range for field
da: Ryd startområdet for felt

source: Clear ending range for field
da: Ryd slutområdet for felt

source: Cl&ear
da: R&yd

source: Start a new search
da: Start en ny søgning

source: &New Search
da: &Ny søgning

source: View summary of current search criteria
da: Vis opsummerings af søgekriterier

source: View Su&mmary
da: Vis &opsummering

source: Search fields by value or by range
da: Søg felter efter værdi eller område

source: By &Value By &Range
da: Efter &Værdi Efter &Område

source: Show all fields or only currently searched fields
da: Vis alle felter eller kun de felter, der søges på lige nu

source: &All &Searched
da: &Alle &Kun de søgte

source: Select Filterable Fields
da: Vælg filtrerbare felter

source: &Field Display Label
da: &Etiket til felt

source: You can set the
da: Du kan sætte

source: &Add Fields
da: &Tilføj felter

source: &Remove Fields
da: &Fjern felter

source: Show Search Summary
da: Vis søgeopsummering

source: Table
da: Tabel

source: Use Table Extension
da: Brug tabeludvidelsen

source: Lookup
da: Opslag

source: &Search Characters
da: &Søg tegn

source: Search &By
da: Søg &efter

source: Enter characters for incremental search
da: Indtast tegn til inkrementiel søgning

source: Table Name and current record position
da: Tabelnavn og position for markeret post

source: Edit Inspector Items
da: Rediger inspector elementer

source: &New Item
da: &Nyt element

source: N&ew Subitem
da: N&yt underelement

source: &Delete
da: &Slet

source: Move &Up
da: Flyt &op

source: Move Do&wn
da: Flyt &ned

source: Add &Fields
da: Tilføj &felter

source: Locate Value
da: Find værdi

source: &Search Type
da: &Søgetype

source: &Case-sensitive
da: &Se forskel på store/små bogstaver

source: Match occurs only if there is an exact match
da: Alt skal passe helt før der er et sammenfald

source: &Exact Match
da: &Præcist sammenfald

source: Match occurs if the start of the field's value matches
da: Sammenfald sker når starten på feltet passer med værdien

source: &Partial Match at Beginning
da: &Delvist sammenfald ved start

source: Match occurs if any part of the field matches
da: Sammenfald sker hvis bare en del af feltet passer med teksten

source: Partial Match &Anywhere
da: &Delvist sammenfald

source: Select the field to search on
da: Vælg det felt der skal søges på

source: Find first match
da: Find første sammenfald

source: Fi&rst
da: Fø&rste

source: Find next match from current record
da: Find næste sammenfald fra nuværende post

source: &Next
da: &Næste

source: Edit Picture Mask Database
da: Rediger database over billedemasker

source: &Description
da: &Beskrivelse

source: &Picture Mask
da: &Billedemaske

source: Select Picture Mask
da: Vælg billedemaske

source: Allo&w Invalid Exit
da: Tillad ugyldig afslutning

source: Auto &Fill
da: Automatisk udfyldning

source: De&sign Mask
da: D&esign maske

source: Us&e Mask to Edit Field in Control
da: Benyt maske til redigering af felt i kontrol

source: Edit Combo List
da: Rediger comboliste

source: &Map Displayed Value to Stored Value
da: &Kortlæg den viste værdi til gemt værdi

source: Clear Entire List
da: Ryd hele listen

source: &Clear List
da: &Ryd liste

source: Add Fields
da: Tilføj felter

source: &Available Fields
da: &Tilgængelige felter

source: &Sort By Table Field Order
da: &Sorter efter tabelfeltrækkefølge

source: Design Picture Mask
da: Design billedemaske

source: Edit Picture Mask
da: Rediger billedemaske

source: &Verify Syntax
da: &Kontroller syntaks

source: &Restore Original
da: &Genskab original

source: &AutoFill
da: &Autoudfyldning

source: Test Picture Mask
da: Test billedemaske

source: &Sample Value
da: &Prøveværdi

source: &Test Value
da: &Testværdi

source: &Save Mask
da: &Gem maske

source: Paragraph
da: Afsnit

source: Cancel
da: Annuller

source: Ali&gnment
da: &Placering

source: &Left:
da: &Venstre:

source: &Right:
da: &Højre:

source: First line:
da: Første linje:

source: Indentation
da: Indrykning

source: Spacing
da: Afstand

source: &Before:
da: &Før:

source: Aft&er:
da: &Efter:

source: Li&ne spacing:
da: Li&njeafstand:

source: &At
da: &Ved

source: Left Center Right
da: Venstre Midte Højre

source: Single 1.5 Lines Double At least Exactly Multiple
da: Enkelt 1.5 Linjer Dobbelt Mindst Præcist Flerdobbelt

source: Edit Rich Text
da: Rediger RTF

source: &File
da: &Filer

source: &Load
da: &Indlæs

source: Save &As
da: Gem &som

source: &Save and Exit
da: &Gem og afslut

source: &Print
da: &Udskriv

source: Page Set&up
da: Side&opsætning

source: E&xit
da: &Afslut

source: &Edit
da: &rediger

source: &Undo
da: &Fortryd

source: &Redo
da: &Gentag

source: Cu&t
da: Kli&p

source: &Copy
da: &Kopier

source: &Paste
da: &Indsæt

source: Cle&ar
da: R&yd

source: Select A&ll
da: Vælg &alt

source: Find &Next
da: Find &næste

source: R&eplace
da: &Erstat

source: &View
da: &Vis

source: &Toolbar
da: &Værktøjsbjælke

source: &Format Bar
da: &Formatteringsbjælke

source: &Status Bar
da: &Statusbjælke

source: &Ruler
da: &Lineal

source: &Options
da: &Indstillinger

source: &Insert
da: &Indsæt

source: Date and Time
da: Dato og klokkeslet

source: &Object...
da: &Objekt...

source: &Font
da: &Skrifttype

source: &Bullet Style
da: &Punktstil

source: &Paragraph
da: &Afsnit

source: &Tabs
da: &Tabulatorer

source: Help
da: Hjælp

source: &Tools
da: &Værktøjer

source: &Spelling
da: &Stavekontrol

source: Rich Text Files (*.RTF)|*.RTF|Text Files (*.TXT)|*.TXT
da: RTF filer (*.RTF)|*.RTF|Tekstfiler (*.TXT)|*.TXT

source: Black
da: Sort

source: Green
da: Grøn

source: Olive
da: Oliven

source: Navy
da: Marineblå

source: Purple
da: Lilla

source: Teal
da: Opal

source: Gray
da: Grå

source: Silver
da: Sølv

source: Red
da: Rød

source: Yellow
da: Gul

source: Blue
da: Blå

source: Aqua
da: Vand

source: White
da: Hvid

source: Automatic
da: Automatisk

source: Tabs
da: Tabulatorer

source: &Tab Stop Position
da: &Tabulatorposition

source: &Set
da: &Sæt

source: Clear A&ll
da: Ryd &alle

source: Select Fields
da: Vælg felter

source: Selected Fields
da: Valgte felter

source: Insert Line Break
da: Indsæt linjeskift

source: Field Properties
da: Feltegenskaber

source: Display
da: Visning

source: &Width
da: &Bredde

source: &Title
da: &Titel

source: Field display width in grid
da: Feltets visningsbredde i gitter

source: Field Title in grid
da: Felttitel i gitter

source: Store display settings in TFields
da: Gem visningsindstillinger i TFields

source: Read only
da: Skrivebeskyttet

source: &Control Type
da: &Kontroltype

source: Select Grid Control Type
da: Vælg gitterkontroltype

source: Field Bitmap CheckBox CustomEdit ImageIndex
da: Felt Billede Afkrydsningsfelt Programmørvalgt Billedeindeks

source: Bitmap
da: Billede

source: Bitmap Scaling
da: Billedeskalering

source: Raster Operation
da: Rasterhandling

source: Original Size Stretch To Fit Fit Height Fit Width
da: Originalstørrelse Udvid til det passer Tilpas højde Tilpas bredde

source: Source Copy Source Paint Source And Source Invert Source Erase Not Source Copy Not Source Erase Merge Paint
da: Kildekopiering Kilde mal Kilde OG Kilde inverteret Kilde slet Ingen kildekopiering Ingen kilde sletning Bland maling

source: Checkbox
da: Afkrydsningfelt

source: Value when checked:
da: Værdi ved afkrydsning:

source: Value when unchecked:
da: Værdi ved manglende kryds:

source: LookupCombo
da: Opslagskombo

source: Control Name
da: Kontrolnavn

source: Select control to attach to field
da: Tilknyt en kontrol til feltet

source: Field
da: Felt

source: ImageIndex
da: Billedeindeks

source: &Shrink to Fit
da: &Krymp til det passer

source: Masks
da: Masker

source: Us&e Mask to Edit Field in Grid
da: Beny&t maske til feltredigering i gitter

source: Links
da: Referencer

source: Linked Table:
da: Refereret tabel:

source: Display Field:
da: Vis felt:

source: &Clear Link
da: &Ryd reference

source: &Select Link and Field
da: &Vælg reference og felt

source: &Display &Edit Control &Masks &Links
da: &Visning &Redigeringskontrol &Masker &Referencer
