Repository: kuksundo/hgs
Catalog: OpenSrc/lib/dxgettext/trunk/translations/*/rave5.po
Languages: da, ja

source: Report Preview
da: Vis udskrift
ja: レポートプレビュー

source: &Open
da: &Åbn
ja: 開く(&O)

source: &Save As
da: &Gem som
ja: 名前を付けて保存(&S)

source: &Print
da: &Udskriv
ja: 印刷(&P)

source: &First
da: &Første
ja: 先頭(&F)

source: &Previous
da: &Forrige
ja: 戻る(&P)

source: &Next
da: &Næste
ja: 次を検索(&N)

source: &Last
da: &Sidste
ja: 最後(&L)

source: Page
da: Side
ja: ページ

source: of 3000
da: af 3000

source: Zoom &In
da: Zoom &ind
ja: 拡大(&I)

source: Zoom &Out
da: Zoom &ud
ja: 縮小(&O)

source: Fit to Page &Width
da: Vis &sidebredde
ja: ページの幅に合わせる(&W)

source: Fit to &Page
da: Vis &hele siden
ja: ページに合わせる(&P)

source: E&xit
da: &Afslut
ja: 終了(&X)

source: File
da: Filer
ja: ファイル

source: Print report
da: Udskriv rapport
ja: レポート印刷

source: Save report
da: Gem rapport
ja: レポート保存

source: Exit viewer
da: Afslut fremviser
ja: ビューの終了

source: Open another report
da: Åbn en anden rapport
ja: 別のファイルをオープン

source: Move to first page
da: Gå til første side
ja: 先頭ページに移動

source: Move to next page
da: Gå til sidste side
ja: 次のページに移動

source: Move to previous page
da: Gå til forrige side
ja: 前のページに移動

source: Move to last page
da: Gå til sidste side
ja: 最終ページに移動

source: Zoom In (+)
da: Zoom ind (+)
ja: 拡大 (+)

source: Zoom Out (-)
da: Zoom ud (-)
ja: 縮小 (-)

source: Zoom to fit page width
da: Zoom til sidebredde
ja: 拡大してページ幅に収める

source: Zoom to fit page
da: Zoom til hele siden
ja: 拡大してページ幅に収める

source: &File
da: &Filer
ja: ファイル(&F)

source: &Page
da: &Side
ja: &ページ

source: &Go to Page #
da: &Gå til side #
ja: &ページ #に移動

source: Go to specified page
da: Gå til specificeret side
ja: 指定したページに移動

source: Rave Snapshot Files (*.ndr)|*.ndr|All Files|*.*
da: Rave snapshot filer (*.ndr)|*.ndr|Alle filer|*.*
ja: Rave スナップショットファイル (*.ndr)|*.ndr|すべてのファイル|*.*

source: Open File
da: Åbn fil
ja: ファイルを開く

source: Adobe PDF (*.pdf)|*.pdf|HTML Files (One per page)|*.html;*.htm|Rave Snapshot Files (*.ndr)|*.ndr|All Files|*.*
da: Adobe PDF (*.pdf)|*.pdf|HTML filer (en per side)|*.html;*.htm|Rave snapshot filer (*.ndr)|*.ndr|Alle filer|*.*
ja: Adobe PDF (*.pdf)|*.pdf|HTML ファイル (ページにつき１ファイル)|*.html;*.htm|Rave スナップショットFiles (*.ndr)|*.ndr|All Files|*.*

source: Save File
da: Gem fil
ja: ファイルを保存

source: Output Options
da: Udskriftsindstillinger
ja: 出力オプション

source: Cancel
da: Annuller
ja: キャンセル

source: &Setup
da: &Opsætning
ja: 設定(&S)

source: Selected Printer
da: Vælg printer
ja: 選択されたプリンター

source: (none)
da: (ingen)
ja: (なし)

source: Options
da: Indstillinger
ja: オプション

source: &Copies
da: &Kopier
ja: コピー(&C)

source: C&ollate
da: S&amlet
ja: 部単位で印刷(&O)

source: &Duplex
da: &Dupleks
ja: 二重化(&D)

source: Report Destination
da: Rapportdestination
ja: レポート転送先

source: Pre&view
da: Vis udskrift
ja: プレビュー(&V)

source: Native Printer Output
da: Binært printer uddata
ja: Native プリンター出力

source: Print Range
da: Udskriv sideinterval
ja: 印刷範囲

source: From
da: Fra
ja: 始点

source: Selection
da: Udvalg
ja: 選択

source: to
da: til

source: All
da: Alle
ja: すべて

source: Pages
da: Sider
ja: ページ

source: All Files|*.*
da: Alle filer|*.*

source: Save As
da: Gem som
ja: 名前をつけて保存

source: Report Status
da: Rapport status
ja: レポートステータス

source: Add Column
da: Tilføj kolonne

source: Fields
da: Felter

source: &Custom
da: &Brugervalgt

source: Table Editor
da: Tabelredigeringsværktøj

source: Headers/Footers
da: Top/Bund

source: Available
da: Tilgængelig

source: Active
da: Aktiv

source: Columns
da: Kolonner

source: Add...
da: Tilføj...

source: Delete
da: Slet

source: Help
da: Hjælp

source: Widths
da: Bredder

source: Current Width:
da: Nuværende bredde:

source: Desired Width:
da: Ønsket bredde:

source: &Adjust
da: &Juster

source: Help
da: Hjælp

source: &About
da: &Om programmet

source: Displays about box
da: Viser vindue med information om programmet

source: Section
da: Sektion

source: Left
da: Venstre
ja: 左

source: Distance
da: Afstand

source: Margin
da: Margen

source: Right
da: Højre
ja: 右

source: Bottom
da: Bund
ja: 下

source: &Help
da: &Hjælp

source: Enabled
da: Slået til

source: Height
da: Højde

source: Min Height
da: Min højde

source: Units
da: Enheder

source: Lines
da: Linjer

source: Setup
da: Opsætning

source: Tab Index
da: Fanebladsindeks

source: Font Index
da: Skrifttypeindeks

source: Connection
da: Forbindelse

source: Use Data &Link File
da: Benyt &datalink fil

source: Use &Connection String
da: Anvend &forbindelsestekst

source: &Cancel
da: &Annuller
ja: キャンセル(&C)

source: Database Connection Parameters
da: Database forbindelsesparametre
ja: データベース接続パラメータ

source: Alias:
da: &Aliasnavn:

source: Driver:
da: Styreprogrammel:

source: Parameters:
da: Parametre:

source: Specify Alias
da: Angiv alias

source: Specify Parameters
da: Specificer parametre

source: Authentication
da: Autentifikation

source: &Username:
da: &Brugernavn:
ja: ユーザー名(&U):

source: &Password:
da: &Adgangskode:
ja: パスワード(&P):

source: Connection Name:
da: Forbindelsesnavn:

source: Connection Settings
da: Forbindelsesindstillinger

source: Defined Events
da: Definerede hændelser
ja: 定義されたイベント

source: Available Events
da: Tilgængelige hændelser
ja: 有効なイベント

source: Show Events for Selected
da: Vis hændelser for valgte
ja: 選択するイベントを表示

source: Show All Events on Page
da: Vis alle hændelser på side
ja: すべてのイベントをページに表示

source: Compile
da: Kompiler
ja: コンパイル

source: Anchor Editor
da: Ankerredigeringsværktøj
ja: アンカーの設定

source: &Left
da: &Venstre
ja: 左(&L)

source: &Right
da: &Højre
ja: 右(&R)

source: Stretc&h
da: Ud&vid
ja: 引き伸ばし(&H)

source: Resi&ze
da: &Ændr størrelse
ja: リサイズ(&Z)

source: Sprea&d
da: Spre&d
ja: スプレッド(&D)

source: Horizontal Anchor
da: Horisontalt anker
ja: 水平アンカー

source: &Bottom
da: &Bund
ja: 下(&B)

source: &Stretch
da: &Udvid
ja: 引き伸ばし(&S)

source: Res&ize
da: &Ændr størrelse
ja: リサイズ(&I)

source: S&pread
da: S&pred
ja: スプレッド(&P)

source: Vertical Anchor
da: Vertikalt anker
ja: 垂直アンカー

source: Vertical Sample
da: Vertikalt eksempel
ja: 垂直サンプル

source: Horizontal Sample
da: Horisontalt eksempel
ja: 水平サンプル

source: Band Style Editor
da: Båndstilsredigeringsværktøj
ja: バンドスタイルの設定

source: Band Display
da: Båndvisning
ja: バンドの表示

source: Print &Location
da: Udskriv &sted
ja: 印刷位置(&L)

source: &Body Header (B)
da: &Kropshoved (B)
ja: 本体ヘッダ(&B)

source: &Group Header (G)
da: &Gruppehoved (G)
ja: グループヘッダ(&G)

source: &Row Header (R)
da: &Rækkehoved (R)
ja: 行ヘッダ(&R)

source: &Detail (D)
da: &Detaljer (D)
ja: 詳細(&D)

source: Ro&w Footer (r)
da: Ræ&kkebund (r)
ja: 行フッタ(&W)

source: Grou&p Footer (g)
da: Gruppe bund (g)
ja: グループフッタ(&P)

source: Bod&y Footer (b)
da: Kro&psbund (b)
ja: 本体フッタ(&Y)

source: Print Occ&urrence
da: Udskriftstidspunkt
ja: 印刷回数(&U)

source: &First (1)
da: &Første (1)
ja: 先頭(&F)

source: &New Page (P)
da: &Ny side (P)
ja: 新規ページ(&N)

source: N&ew Column (C)
da: N&y kolonne (C)
ja: 新規の列(&E)

source: &Datasource:
da: &Datakilde:
ja: データソース(&D):

source: &Options:
da: &Indstillinger:
ja: オプション(&O):

source: Data Mirror Editor
da: Dataspejlsredigeringsværktøj
ja: データのミラーリングの設定

source: Data Mirrors
da: Dataspejl
ja: データのミラーリング

source: &Add
da: &Tilføj
ja: 追加(&A)

source: &Delete
da: &Slet
ja: 削除(&D)

source: Data Mirror Settings
da: Dataspejlsindstillinger
ja: データのミラーリングの設定

source: Field Value
da: Feltværdi
ja: フィールド値

source: Mirrored Section
da: Spejlet sektion
ja: ミラーセクション

source: Default
da: Standart
ja: デフォルト

source: Data Text Editor
da: Datatekstredigeringsværktøj
ja: データテキストの編集

source: Data Text
da: Datatekst
ja: データテキスト

source: Data Fields
da: Datafelter
ja: データフィールド

source: Data Field
da: Datafelt
ja: データフィールド

source: Insert &Field
da: Indsæt &felt
ja: フィールドの挿入(&F)

source: Data View
da: Datavisning
ja: データビュー

source: Selected
da: Valgte
ja: 選択項目

source: Report Variables
da: Rapportvariable
ja: レポート変数

source: Insert &Report Var
da: Indsæt &rapport var
ja: レポート変数の挿入(&R)

source: Project Parameters
da: Projektparametre
ja: プロジェクトパラメータ

source: Insert &Parameter
da: Indsæt &parameter
ja: パラメータの挿入(&P)

source: Post Initialize Variables
da: Variable til efter initialisering
ja: 後で初期化する変数

source: Insert PI &Var
da: Indsæt PI &Var
ja: PI 変数の挿入(&V)

source: Image Selector
da: Billedvælge
ja: イメージセレクタ

source: &Open...
da: &Åbn...
ja: 開く(&O)...

source: &Clear
da: &Slet
ja: 消去(&C)

source: &Save As...
da: Gem &som...
ja: 名前を付けて保存(&S)...

source: None
da: Ingen
ja: 表示しない(&N)

source: Save
da: Gem
ja: 保存

source: Mail Merge Editor
da: Brevfletningsredigeringsværktøj
ja: メールマージエディタ

source: Mail Merge Items
da: Brevfletteelementer
ja: メールマージ項目

source: Mail Merge Settings
da: Brevfletteindstillinger
ja: メールマージ設定

source: Search Token
da: Søgeord
ja: 検索トークン

source: Replacement String
da: Erstatningstekst
ja: 置換文字列

source: &Edit
da: &Rediger
ja: 編集(&E)

source: Case sensitive
da: Forskel på store/små bogstaver
ja: 大文字小文字を区別

source: Memo Editor
da: Memo redigeringsværktøj
ja: メモエディタ

source: Page List Editor
da: Sidelisteredigeringsværktøj
ja: ページリストエディタ

source: Page List
da: Sideliste
ja: ページリスト

source: Available Pages
da: Tilgængelige sider
ja: 有効なページ

source: Report Pages
da: Rapportsider
ja: レポートのページ

source: Global Pages
da: Globale sider
ja: グローバルページ

source: &Add Page
da: &Tilføj side
ja: ページの追加(&A)

source: Add &Global
da: Tilføj &global
ja: グローバルの追加(&G)

source: Move Page Up
da: Flyt side op
ja: ページを上に移動

source: Move Page Down
da: Flyt side ned
ja: ページを下に移動

source: Delete Page
da: Slet side
ja: ページを削除

source: Reprint Settings
da: Indstillinger for genudskrivning
ja: 設定の再印刷

source: Reprint For &Locations
da: Udskriv igen for
ja: 位置を再印刷(&L)

source: &Master (M)
da: &Mester (M)
ja: マスター(&M)

source: &All
da: &Alle
ja: すべて(&A)

source: &None
da: &Ingen
ja: なし(&N)

source: Strings Editor
da: Tekstredigeringsværktøj
ja: 文字列エディタ

source: Master/Detail Wizard
da: Mester/detalje vejledning
ja: マスター/詳細ウィザード

source: Page Description Here
da: Sidebeskrivelse her
ja: ページの説明

source: Cancel The Report Wizard
da: Annuller udskriftsvejledningen
ja: レポートウィザードをキャンセル

source: &Next >
da: &Næste >
ja: 次へ(&N) >

source: < &Back
da: < &Forrige
ja: < 戻る(&B)

source: Select All Fields
da: Vælg alle felter
ja: すべてのフィールドを選択

source: Clear All Selected Items
da: Slet alle valgte elementer
ja: 選択したすべての項目をクリア

source: Move the Selected Item Up One Position
da: Flyt det valgte element en position op
ja: 選択した項目を１つ上へ移動

source: Move The Selected Item Down One Position
da: Flyt det valgte element en position ned
ja: 選択した項目を１つ下へ移動

source: Detail Keys Selected: %s
da: Valgte detaljenøgler: %s
ja: 選択された詳細キー: %s

source: Master Keys Selected: %s
da: Valgte mesternøgler: %s
ja: 選択されたマスターキー: %s

source: Detail Indent
da: Detaljeindrykning
ja: 詳細インデント

source: Report Margins
da: Rapportmargener
ja: レポートのマージン

source: Type the position of the left margin
da: Indtast venstre margen
ja: 左マージンへ移動するよう記述

source: Type the position of the top margin
da: Indtast top margen
ja: 上マージンへ移動するよう記述

source: Type the position of the right margin
da: Indtast højre margen
ja: 右マージンへ移動するよう記述

source: Type the position for the bottom margin
da: Indtast bundmargen
ja: 下マージンへ移動するよう記述

source: Report Title
da: Rapport titel
ja: レポートらいとる

source: Type the Title You Want For This Report
da: Indtast titlen for rapporten
ja: このレポートへ記載するタイトルを記述

source: Master/Detail Report
da: Mester/detalje rapport
ja: マスター/詳細レポート

source: Print Report Title
da: Udskriv rapporttitel
ja: レポートタイトルの印刷

source: Title Font
da: Skrifttype for titel
ja: タイトルフォント

source: Change Font
da: Skift skrifttype
ja: フォントの変更

source: The Caption Font Will Look Like This
da: Overskriftsskriftstypen vil se sådan ud
ja: キャプションのフォントはこのように表示されます

source: Caption Font
da: Overskrift skrifttype
ja: キャプションのフォント

source: The Printed Data Will Look Like This
da: De udskrevne data vil se sådan ud
ja: 印刷されるデータはこのように表示されます

source: Body Font
da: Skriftstype til kroppen
ja: 本体のフォント

source: Simple Table
da: Simpel tabel
ja: 簡易テーブル

source: Simple Table Report
da: Simpel tabeludskrift
ja: 簡易テーブルレポート

source: Zoom
ja: ズーム

source: &Zoom
ja: &ズーム

source: Format:
ja: フォーマット:

source: &Printer
ja: プリンター(&P)

source: Rave Format (NDR)
ja: Rave フォーマット (NDR)

source: Top
ja: 上

source: &Ok
ja: OK(&O)

source: C&enter
ja: 中央に置く(&E)

source: &Top
ja: 上(&T)

source: &Center
ja: 中央に置く(&C)

source: &OK
ja: OK(&O)

source: OK
ja: OK(&O)
