Repository: kuksundo/hgs
Catalog: OpenSrc/App/karsten-Slide Show/locale/*/LC_MESSAGES/default.po
Languages: it

source: About
it: Info

source: Product Name
it: Nome del Prodotto

source: File Version
it: Versione

source: Copyright Label
it: Etichetta di Copyright

source: &Close
it: &Chiudi

source: Properties
it: Proprietà

source: &Name
it: &Nome

source: Display frequency relative to the sum of all frequency values
it: Mostra la frequenza relativa alla somma di tutte le frequenze

source: &Frequency
it: &Frequenza

source: Name or Title of the Slide
it: Nome o Titolo della Slide

source: File path of the picture file
it: Percorso dell'immagine

source: File &Path
it: &Percorso del File

source: Browse the file system
it: Sfoglia il disco rigido

source: &Browse
it: &Sfoglia

source: File path
it: Percorso del file

source: Time to the next slide change
it: Tempo mancante alla slide successiva

source: &Display Time
it: &Durata

source: &Cancel
it: &Annulla

source: Color of the window background
it: Colore di sfondo della finestra

source: &Background Color
it: &Colore di Sfondo

source: Open the help file
it: Apri il file di aiuto

source: Size and aspect of the picture during presentation
it: Dimensioni e proporzioni dell'immagine durante la presentazione

source: Original Size
it: Dimensioni Originali

source: Proportional Zoom
it: Zoom Proporzionale

source: Unproportional Stretch
it: Zoom Non Proporzionale

source: Explicit Factor:
it: Fattore di Zoom:

source: Integer Zoom Factor
it: Zoom Intero

source: &Sequence Number
it: Numero &Progressivo

source: All Image Files|*.jpg;*.jpeg;*.bmp;*.ico;*.emf;*.wmf;*.gif|Bitmaps (*.bmp)|*.bmp|Metafiles (*.wmf;*.emf)|*.wmf;*.emf|JPEG Images (*.jpg;*.jpeg)|*.jpg;*.jpeg|GIF Images (*.gif)|*.gif|Icons (*.ico)|*.ico
it: Tutti i Formati di Immagine|*.jpg;*.jpeg;*.bmp;*.ico;*.emf;*.wmf;*.gif|Bitmaps (*.bmp)|*.bmp|Metafiles (*.wmf;*.emf)|*.wmf;*.emf|Immagini JPEG(*.jpg;*.jpeg)|*.jpg;*.jpeg|Immagini GIF (*.gif)|*.gif|Icone (*.ico)|*.ico

source: Browse for Picture File
it: Sfoglia e Seleziona File di Immagine

source: Media Control
it: Controllo Multimediale

source: Pause
it: Interrompi

source: Play
it: Esegui

source: Skip back
it: Salta all'indietro

source: Skip forward
it: Salta in avanti

source: Karsten Main
it: Pagina Principale Karsten

source: &Color
it: &Colore

source: Color
it: Colore

source: &Green
it: &Verde

source: &Red
it: &Rosso

source: Close media control window
it: Chiudi la finestra di controllo multimediale

source: Preview
it: Anteprima

source: Repair Broken Links
it: Ripara Collegamenti Danneggiati

source: &Broken Links
it: &Collegamenti Danneggiati

source: &Replace Path
it: &Sostituisci il Percorso

source: &Previous Path
it: Percorso &Precedente

source: &New Path
it: &Nuovo Percorso

source: &Replace
it: &Sostituisci

source: From &List
it: Dalla &Lista

source: &Search
it: &Cerca

source: Search Progress
it: Ricerca in Corso

source: Search Result
it: Risultati della Ricerca

source: Start &Path
it: &Percorso Iniziale

source: &Start
it: &Inizia

source: &Stop
it: &Arresta

source: R&emove Items
it: &Rimuovi Elementi

source: Removes the broken items from the collection.
it: Rimuove i collegamenti danneggiati dalla collezione.

source: The image files are not deleted.
it: I file immagine non sono cancellati.

source: R&emove
it: &Elimina

source: All Files (*.png;*.jpg;*.jpeg;*.bmp;*.ico;*.emf;*.wmf)|*.png;*.jpg;*.jpeg;*.bmp;*.ico;*.emf;*.wmf|Portable Network Graphics (*.png)|*.png|JPEG Image (*.jpg)|*.jpg|JPEG Image (*.jpeg)|*.jpeg|Bitmaps (*.bmp)|*.bmp|Icons (*.ico)|*.ico|Enhanced Metafiles (*.emf)|*.emf|Windows Metafiles (*.wmf)|*.wmf
it: Tutti i File (*.png;*.jpg;*.jpeg;*.bmp;*.ico;*.emf;*.wmf)|*.png;*.jpg;*.jpeg;*.bmp;*.ico;*.emf;*.wmf|Portable Network Graphics (*.png)|*.png|JPEG Image (*.jpg)|*.jpg|JPEG Image (*.jpeg)|*.jpeg|Bitmaps (*.bmp)|*.bmp|Icons (*.ico)|*.ico|Enhanced Metafiles (*.emf)|*.emf|Windows Metafiles (*.wmf)|*.wmf

source: Select a File From the Destination Folder
it: Scegli un File dalla Cartella di Destinazione

source: Select Search Start
it: Scegli Inizio Ricerca

source: Collection
it: Collezione

source: Title
it: Titolo

source: Display Time
it: Durata

source: Frequency
it: Frequenza

source: Sequence
it: Numero Progressivo

source: File Path
it: Percorso del File

source: Main Menu
it: Menu Principale

source: Tool Bar
it: Barra degli Strumenti

source: Reopen
it: Riapri

source: Slide Collection (*.kbs)|*.kbs
it: Collezione di Slide (*.kbs)|*.kbs

source: Open a Slide Collection
it: Apri una Collezione di Slide

source: Save the Slide Collection
it: Salva la Collezione di Slide

source: All Files (*.png;*.jpg;*.jpeg;*.bmp;*.ico;*.emf;*.wmf)|*.png;*.jpg;*.jpeg;*.bmp;*.ico;*.emf;*.wmf|Portable Network Graphics (*.png)|*.png|JPEG Images (*.jpg)|*.jpg|JPEG Images (*.jpeg)|*.jpeg|Bitmaps (*.bmp)|*.bmp|Icons (*.ico)|*.ico|Enhanced Metafiles (*.emf)|*.emf|Windows Metafiles (*.wmf)|*.wmf
it: Tutti i File (*.png;*.jpg;*.jpeg;*.bmp;*.ico;*.emf;*.wmf)|*.png;*.jpg;*.jpeg;*.bmp;*.ico;*.emf;*.wmf|Portable Network Graphics (*.png)|*.png|JPEG Images (*.jpg)|*.jpg|JPEG Images (*.jpeg)|*.jpeg|Bitmaps (*.bmp)|*.bmp|Icons (*.ico)|*.ico|Enhanced Metafiles (*.emf)|*.emf|Windows Metafiles (*.wmf)|*.wmf

source: Add Slides
it: Aggiungi Slide

source: Reo&pen
it: Ria&pri

source: R&epair...
it: R&ipara...

source: A&llow Duplicates
it: &Consenti Duplicati

source: &Select all
it: Seleziona &Tutto

source: P&roperties...
it: &Proprietà

source: &Edit
it: &Modifica

source: L&ist
it: Icone &Piccole

source: &By Frequency
it: Per &Frequenza

source: B&y Display Time
it: Per &Durata

source: So&rt
it: &Ordinamento

source: &Order
it: &Ordine

source: &View
it: &Visualizza

source: W&allpaper
it: &Sfondo del Desktop

source: &Monitor
it: &Schermo

source: P&roceed
it: &Procedi

source: S&creen Saver...
it: &Salvaschermo...

source: &Slide Show
it: &Presentazione

source: &Help
it: &Aiuto

source: Co&py
it: &Copia

source: Pas&te
it: &Incolla

source: Lar&ge Icons
it: Icone &Grandi

source: S&mall Icons
it: Ocone &Piccole

source: D&etails
it: &Dettagli

source: Contents
it: Contenuti

source: &Reopen
it: &Riapri

source: &New
it: &Nuovo

source: Create a new collection
it: Crea una nuova collezione

source: New &Window
it: Nuova &Finestra

source: Open another collection window
it: Apri un'altra finestra di collezione

source: &Open
it: &Apri

source: Open an existing collection
it: Apri una collezione esitente

source: &Save
it: &Salva

source: Save the collection
it: Salva la collezione

source: Save &as...
it: Salva con &nome...

source: Save collection to another file
it: Salva la collezione in un altro file

source: Sen&d...
it: &Invia...

source: Send collection via E-Mail
it: Invia la collezione per e-mail

source: Close the collection and the window
it: Chiudi la collezione e la finestra di collezione corrente

source: &Repair...
it: &Ripara...

source: Repair broken links
it: Ripara i collegamenti danneggiati

source: E&xit
it: &Esci

source: Close collection and exit the program
it: Chiudi la collezione e termina il programma

source: Edit
it: Modifica

source: &Add File...
it: &Aggiungi un File...

source: Add an image or media file to the collection
it: Aggiungi un'immagine o un file multimediale alla collezione

source: Add &Multiple Files...
it: Aggiungi File &Multipli...

source: Add &Folder...
it: Aggiungi una &Cartella...

source: Add a folder that contains image or media files to the collection
it: Aggiungi una cartella contenente immagini o filmati alla collezione

source: Insert &Files
it: Inserisci &File

source: Insert all image and media files from the folder
it: Inserisci tutte le immagini e i filmati dalla cartella

source: Allow &Duplicates
it: Consenti &Duplicati

source: &Cut
it: &Taglia

source: Copy the selected slides to the clipboard and remove them from the collection
it: Copia le slide selezionate nella clipboard e rimuovile dalla collezione

source: C&opy
it: &Copia

source: Copy the selected slides to the clipboard
it: Copia le slide selezionate nella clipboard

source: &Paste
it: &Incolla

source: Paste slides from the clipboard
it: Incolla slide dalla clipboard

source: &Delete
it: &Rimuovi

source: Remove the selected slides from the collection
it: Rimuovi le slide selezionate dalla collezione

source: Select &all
it: Sleziona &tutto

source: Select all collection items
it: Seleziona tutti gli elementi della collezione

source: &Properties...
it: &Proprietà

source: Edit slide properties
it: Modifica le proprietà della slide

source: Help
it: Aiuto

source: &Contents
it: &Contenuti

source: Table of contents
it: Apri il file di aiuto

source: &Index
it: &Indice

source: Help index
it: Apri l'indice dell'aiuto

source: &About...
it: &Info...

source: Display version and license information
it: Mostra versione e informazioni di copyright

source: View
it: Visualizza

source: &Large Icons
it: Icone &Grandi

source: Show large icons for the collection items
it: Mostra gli elementi della collezione come icone grandi

source: &Small Icons
it: Icone &Piccole

source: Show small icons for the collection items
it: Mostra gli elementi della collezione come icone piccole

source: &List
it: &Lista

source: Show the collection items in a list with small icons
it: Mostra gli elementi della collezione come icone piccole

source: &Details
it: &Dettagli

source: Show the collection items in detailed column format
it: Mostra gli elementi della collezione in formato dettagliato

source: By &Title
it: Per &Titolo

source: Sort by title
it: Ordina per titolo

source: By &File Name
it: Per &Nome

source: Sort by file name
it: Ordina per nome del file

source: By File &Path
it: Per &Percorso

source: Sort by file path
it: Ordina per percorso del file

source: By &Frequency
it: Per &Frequenza

source: Sort by frequency
it: Ordina per frequenza

source: By Display &Time
it: Per &Durata

source: Sort by display time
it: Ordina per durata di visualizzazione

source: &Off
it: &Disabilitato

source: Disable sorting
it: Ordinamento disabilitato

source: &Ascending
it: &Crescente

source: Ascending sort order
it: Ordinamento crescente

source: &Descending
it: &Decrescente

source: Descending sort order
it: Ordinamento decrescente

source: Tools
it: Strumenti

source: &Customize...
it: &Personalizza...

source: Slide Show
it: Presentazione

source: &Window
it: &Finestra

source: Run slide show in a regular window
it: Esegui la presentazione in una finestra normale

source: &Borderless Window
it: &Finestra Senza Bordi

source: Run slide show in a borderless window
it: Esegui la presentazione in una finestra senza bordi

source: &Full Screen
it: &A Tutto Schermo

source: Run slide show at full screen
it: Mostra la presentazione a tutto schermo

source: &Wallpaper
it: &Sfondo del Desktop

source: Run slide show on the desktop wallpaper
it: Esegui la presentazione sullo sfondo del desktop

source: &Proceed
it: &Avanza

source: Proceed to next slide
it: Avanza alla slide successiva

source: &Pause
it: &Interrompi

source: Pause/Resume slide show
it: Interrompi/Riprendi la presentazione

source: &Show Slide
it: &Mostra la Slide

source: Show the selected slide immediately
it: Mostra immediatamente la slide selezionata

source: &Screen Saver...
it: &Salvaschermo...

source: Set up slide show for screen saver
it: Imposta la presentazione come salvaschermo

source: &Debug Function
it: &Funzione di Debug

source: By &Sequence
it: Per Numero &Progressivo

source: Sort by sequence number
it: Ordina per numero progressivo

source: &Film Strip
it: &Pellicola

source: Show the collection in film strip layout with a large preview
it: Mostra la collezione in formato pellicola con anteprima grande

source: Monitor
it: Schermo

source: Monitor &1
it: Schermo &1

source: Monitor &2
it: Schermo &2

source: Monitor &3
it: Schermo &3

source: Monitor &4
it: Schermo &4

source: Monitor &5
it: Schermo &5

source: Monitor &6
it: Schermo &6

source: Monitor &7
it: Schermo &7

source: Monitor &8
it: Schermo &8

source: Monitor &9
it: Schermo &9

source: Slide Show &Mode
it: Modalità Presentazione

source: Pause slide show temporarily
it: Interrompi temporaneamente la presentazione

source: &Resume
it: &Ricomincia

source: Resume slide show
it: Ricomincia la presentazione

source: Display the next slide
it: Mostra la slide successiva

source: &Stop Media
it: &Arresta il Filmato

source: Stop media playback (but not the slide show)
it: Arresta il filmato (ma non la presentazione)

source: &Media Control
it: &Controllo del Filmato

source: Show media control window
it: Mostra la finestra di controllo del filmato

source: Go to &Collection Window
it: Vai alla Finestra della &Collezione

source: Switch to the collection window
it: Passa alla finestra di collezione

source: &Pick Background Color
it: &Scegli un Colore di Sfondo

source: Switch color picker mode
it: Passa alla modalità di scelta del colore

source: Close slide show
it: Chiudi la presentazione

source: Regular window with border and title
it: Finestra normale con bordi e titolo

source: Window without visible border and title
it: Finestra senza bordo e senza titolo

source: Maximized window without border and title
it: Finestra ingrandita senza bordo e senza titolo

source: Display on desktop wallpaper
it: Mostra sullo sfondo del desktop

source: Screen Saver Configuration
it: Configurazione del Salvaschermo

source: Accept the settings and close the window
it: Accetta le impostazioni e chiudi la finestra

source: Close the window and revert to the previous settings
it: Chiudi la finestra e mantieni le impostazioni precedenti

source: Karsten Screen Saver
it: Salvaschermo Karsten

source: Karsten Screen Saver Configuration
it: Configurazione del Salvaschermo Karsten

source: Settings for the current user
it: Impostazioni per l'utente corrente

source: Current &User
it: &Utente Corrente

source: Settings for new user accounts
it: Impostazioni per nuovi utenti

source: &Default User
it: &Utente Predefinito

source: Slide show file that the screen saver will run
it: File di slide show che verrà eseguito dal salvaschermo

source: Collection &File
it: &File di Collezione

source: Path to the collection file
it: Percorso del file di collezione

source: &Browse...
it: &Sfoglia...

source: Use the collection that is currently open in the main window
it: Usa la collezione che è attualmente aperta nella finestra principale

source: Use &Open Collection
it: Usa la Collezione &Aperta

source: Set Karsten as the active screen saver program
it: Seleziona Karsten come il programma salvaschermo corrente

source: &Enable Karsten Screen Saver
it: &Attiva il Salvaschermo Karsten

source: Karsten Slide Collection (*.kbs)|*.kbs
it: Collezione di Slide Karsten (*.kbs)|*.kbs

source: Select slide collection for the screen saver
it: Scegli la collezione di slide per il salvaschermo

source: &Maximized
it: &Ingrandita

source: &Borderless
it: &Senza bordi

source: Incompatible media type
it: Formato del filmato incompatibile

source: Output device does not support %s files.
it: Il dispositivo di visualizzazione non supporta %s file.

source: Images from
it: Immagini da

source: Select any image from the desired folder
it: Seleziona qualunque immagine dalla cartella desiderata

source: Select image file
it: Seleziona il file di immagine

source: Please enter a title.
it: Prego inserire un titolo.

source: The selected file path is invalid.
it: Il percorso selezionato non è valido.

source: The selected zoom mode or zoom factor is invalid.
it: La modalità o il fattore di zoom selezionato non è valido.

source: Slide Properties
it: Proprietà della Slide

source: Folder Properties
it: Proprietà della Cartella

source: &Path to Image File
it: &Percorso del File di Immagine

source: &Path of Image Folder
it: &Percorso della Cartella di Immagini

source: (Multiple Selection)
it: (Selezione Multipla)

source: (unchanged)
it: (invariato)

source: The folder "%s" contains no image files.
it: La cartella "%s" non contiene alcun file di immagine.

source: The file "%s" cannot be found.
it: Il file "%s" non esite.

source: unknown
it: sconosciuto

source: Icon
it: Icona

source: JPEG Image
it: Immagine JPEG

source: PNG Image
it: Immagine PNG

source: GIF Image
it: Immagine GIF

source: Media File
it: Filmato Multimediale

source: OLE Object
it: Oggetto OLE

source: Access to the desktop wallpaper is denied.
it: L'accesso allo sfondo del desktop è stato negato.

source: Invalid window handle %x.
it: L'handle %x alla finestra non è valida.

source: Invalid device context handle %x.
it: L'handle %x al contesto del dispositivo non è valida.

source: Karsten Slide Collection
it: Collezione di Slide Karsten

source: All Image Files
it: Tutti i Formati di Immagine

source: All Media Files
it: Tutti i Filmati

source: All Files
it: Tutti i File

source: All Image and Media Files
it: Tutti i Formati di Immagine e i Filmati

source: No Description
it: Nessuna Descrizione

source: Error opening the Windows registry: Access to the key %s\%s is denied.
it: Errore nell'accedere il registro di Windows: L'accesso alla chiave %s\%s è negato.

source: Caution: Your operating system does not support multiple users.
it: Avvertenza: Il sistema operativo non supporta utenti multipli.

source: Frequency: %d
it: Frequenza: %d

source: Display Time: %d s
it: Durata: %d s

source: Sequence Number: %d
it: Numero Progressivo: %d

source: Status
it: Stato

source: Previous Path
it: Percorso Precedente

source: New Path
it: Nuovo Percorso

source: Invalid Path
it: Percorso Non Valido

source: File found
it: File trovato

source: To be removed
it: Da rimuovere

source: The repair process cannot be undone. Would you like to proceed anyway?
it: Il processo di riparazione non può essere annullato. Vuoi procedere ugualmente?

source: %s (%s) searched
it: %s (%s) cercato

source: %s found
it: %s trovato

source: untitled
it: senza titolo

source: Error sending E-Mail
it: Errore nell'invio e-mail

source: Please select an item for editing first!
it: Per favore selezionare l'elemento da modificare!

source: The collection "%s" has changed. Would you like to save the changed version?
it: La collezione "%s" è cambiata. Vuoi salvare la versione modificata?

source: The file "%s" is write-protected. Would you like to enter a new name [YES] or ignore the write protection [NO]?
it: Il file "%s" è di sola lettura. Vuoi indicare un nuovo nome [YESI] oppure ignorare la protezione di scrittura [NO]?

source: Cannot create backup copy of file "%s". Error message: "%s"
it: Non è possibile creare una copia di backup del file "%s". Messaggio di errore: "%s"

source: The collection contains %u duplicates. Do you want to delete them from the collection? (If you click [NO] the duplicate items will be highlighted.)
it: La collezione contiene %u duplicati. Vuoi cancellarli dalla collezione? (Selezionando [NO], gli elementi duplicati verranno evidenziati.)

source: Background jobs: Status %d, Links %d, Thumbnails %d
it: Lavori in background: Stato %d, Collegamenti %d, Anteprime %d

source: Unknown file format: The file is either not a Karsten Slide Collection or it is corrupt.
it: Formato del file sconosciuto: Il file non è un file di collezione Karsten, oppure è danneggiato.

source: Read error: The file is corrupt and cannot be read.
it: Errore di lettura: Il file è corrotto e non può essere letto.

source: Incompatible file format: In order to load this file you need a newer program version.
it: Formato del file incompatibile: Per caricare questo file è necessaria una versione più aggiornata del programma.

source: Error loading file
it: Errore nel caricamento del file

source: Error displaying image
it: Errore nel mostrare l'immagine

source: Error switching image
it: Errore nel passare all'immagine successiva

source: No image loaded
it: Nessuna immagine caricata

source: Karsten ScreenSaver
it: Salvaschermo Karsten

source: Karsten screen saver cannot start. Please check that the application is installed properly. Error message: %s
it: Il salvaschermo Karsten non può iniziare. Prego verificare che l'applicazione sia installata correttamente. Messaggio di errore: %s

source: The selected file is not a Karsten Slide Collection (.kbs).
it: Il file selezionato non è una collezione di slide Karsten (.kbs).

source: The selected file name is invalid.
it: Il nome del file selezionato non è valido.

source: The desktop wallpaper (Active Desktop) cannot be accessed. Your system is probably using an old version of SHELL32.DLL. Karsten requires at least version 4.71.
it: Lo sfondo del desktop (Active Desktop) non è accessibile. Il sistema probabilmente sta usando una vecchia versione di SHELL32.DLL. Karsten richiede versione 4.71 o superiore.
